<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['post_icons'] = "آیکن‌های ارسال";
$l['add_post_icon'] = "افزودن آیکن ارسال جدید";
$l['add_post_icon_desc'] = "در اینجا می‌توانید یک آیکن ارسال جدید اضافه کنید.";
$l['add_multiple_post_icons'] = "افزودن چندین آیکن ارسال";
$l['add_multiple_post_icons_desc'] = "در اینجا می‌توانید چندین آیکن ارسال جدید اضافه کنید.";
$l['edit_post_icon'] = "ویرایش آیکن ارسال";
$l['edit_post_icon_desc'] = "در اینجا می‌توانید یک آیکن ارسال را ویرایش کنید.";
$l['manage_post_icons'] = "مدیریت آیکن‌های ارسال";
$l['manage_post_icons_desc'] = "این بخش به شما امکان می‌دهد آیکن‌های ارسال خود را ویرایش، حذف و مدیریت کنید.";

$l['name_desc'] = "این نام برای آیکن ارسال است.";
$l['image_path'] = "مسیر تصویر";
$l['image_path_desc'] = "این مسیر به تصویر آیکن ارسال است. اگر می‌خواهید از تصاویر آیکن ارسال مختلف برای پوسته‌های مختلف استفاده کنید، لطفاً از <strong>{theme}</strong> برای نشان دادن دایرکتوری تصویر هر پوسته استفاده کنید.";
$l['save_post_icon'] = "ذخیره آیکن ارسال";
$l['reset'] = "بازنشانی";

$l['path_to_images'] = "مسیر به تصاویر";
$l['path_to_images_desc'] = "این مسیر به پوشه‌ای است که تصاویر در آن قرار دارند.";
$l['show_post_icons'] = "نمایش آیکن‌های ارسال";
$l['image'] = "تصویر";
$l['add'] = "افزودن؟";
$l['save_post_icons'] = "ذخیره آیکن‌های ارسال";

$l['no_post_icons'] = "در حال حاضر هیچ آیکن ارسالی در انجمن شما وجود ندارد.";

$l['error_missing_name'] = "شما نامی برای این آیکن ارسال وارد نکرده‌اید";
$l['error_missing_path'] = "شما مسیری برای این آیکن ارسال وارد نکرده‌اید";
$l['error_missing_path_multiple'] = "شما مسیری وارد نکرده‌اید";
$l['error_invalid_path'] = "شما مسیر معتبری وارد نکرده‌اید";
$l['error_no_images'] = "هیچ آیکن ارسالی در دایرکتوری مشخص شده وجود ندارد، یا همه آیکن‌های ارسال در دایرکتوری قبلاً اضافه شده‌اند.";
$l['error_none_included'] = "شما هیچ آیکن ارسالی برای شامل شدن انتخاب نکرده‌اید.";
$l['error_invalid_post_icon'] = "آیکن ارسال مشخص شده وجود ندارد.";

$l['success_post_icon_added'] = "آیکن ارسال با موفقیت اضافه شد.";
$l['success_post_icons_added'] = "آیکن‌های ارسال انتخاب شده با موفقیت اضافه شدند.";
$l['success_post_icon_updated'] = "آیکن ارسال با موفقیت به‌روزرسانی شد.";
$l['success_post_icon_deleted'] = "آیکن ارسال انتخاب شده با موفقیت حذف شد.";

$l['confirm_post_icon_deletion'] = "آیا مطمئن هستید که می‌خواهید این آیکن ارسال را حذف کنید؟";
