<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['custom_profile_fields'] = "فیلدهای پروفایل سفارشی";
$l['custom_profile_fields_desc'] = "این بخش به شما امکان می‌دهد فیلدهای پروفایل سفارشی خود را ویرایش، حذف و مدیریت کنید.";
$l['add_profile_field'] = "افزودن فیلد پروفایل";
$l['add_new_profile_field'] = "افزودن فیلد پروفایل جدید";
$l['add_new_profile_field_desc'] = "در اینجا می‌توانید یک فیلد پروفایل سفارشی جدید اضافه کنید.";
$l['edit_profile_field'] = "ویرایش فیلد پروفایل";
$l['edit_profile_field_desc'] = "در اینجا می‌توانید یک فیلد پروفایل سفارشی را ویرایش کنید.";

$l['title'] = "عنوان";
$l['short_description'] = "توضیح کوتاه";
$l['maximum_length'] = "حداکثر طول";
$l['maximum_length_desc'] = "این حداکثر تعداد کاراکترهایی است که می‌توان وارد کرد. این فقط برای جعبه‌های متنی و ناحیه‌های متنی اعمال می‌شود.";
$l['field_length'] = "طول فیلد";
$l['field_length_desc'] = "این طول فیلد است. این فقط برای جعبه‌های انتخاب تکی و چندگانه اعمال می‌شود.";
$l['display_order'] = "ترتیب نمایش";
$l['display_order_desc'] = "این ترتیب فیلدهای پروفایل سفارشی در رابطه با سایر فیلدهای پروفایل سفارشی است. این عدد نباید با فیلد دیگری یکسان باشد.";
$l['text'] = "جعبه متنی (TextBox)";
$l['textarea'] = "ناحیه متنی (TextArea)";
$l['select'] = "جعبه انتخاب کشویی (Select)";
$l['multiselect'] = "جعبه انتخاب چند گزینه‌ای (Select Multi)";
$l['radio'] = "دکمه‌های رادیویی (Radio)";
$l['checkbox'] = "جعبه‌های انتخابی (CheckBox)";
$l['field_type'] = "نوع فیلد";
$l['field_type_desc'] = "این نوع فیلدی است که نمایش داده خواهد شد.";
$l['field_regex'] = "عبارت منظم";
$l['field_regex_desc'] = "یک عبارت منظم وارد کنید که باید با ورودی کاربر مطابقت داشته باشد. شما باید مطمئن شوید که عبارت منظم معتبر و ایمن است - هیچ اعتبارسنجی انجام نمی‌شود. برای هر چیزی خالی بگذارید.<br />
<strong>مثال:</strong> ([a-z0-9_\- ,.+]+)";
$l['selectable_options'] = "گزینه‌های قابل انتخاب؟";
$l['selectable_options_desc'] = "لطفاً هر گزینه را در یک خط جداگانه وارد کنید. این فقط برای انواع جعبه‌ انتخاب کشویی، جعبه‌های انتخابی و دکمه‌های رادیویی اعمال می‌شود.";
$l['required'] = "الزامی؟";
$l['required_desc'] = "آیا این فیلد باید در حین ثبت‌نام یا ویرایش پروفایل پر شود؟ توجه داشته باشید که این در صورتی اعمال نمی‌شود که فیلد مخفی باشد یا فیلد قابل ویرایش نباشد.";
$l['show_on_registration'] = "نمایش در ثبت‌نام؟";
$l['show_on_registration_desc'] = "آیا این فیلد باید در فرم ثبت‌نام ظاهر شود؟ توجه داشته باشید که این در صورتی اعمال نمی‌شود که فیلد قابل ویرایش نباشد. فیلدهایی که الزامی هستند همیشه در ثبت‌نام ظاهر می‌شوند.";
$l['display_on_profile'] = "نمایش در پروفایل؟";
$l['display_on_profile_desc'] = "آیا این فیلد باید در پروفایل کاربر نمایش داده شود؟";
$l['display_on_postbit'] = "نمایش در postbit؟";
$l['display_on_postbit_desc'] = "آیا این فیلد باید در ارسال‌های کاربر نمایش داده شود؟";
$l['viewableby'] = 'قابل مشاهده توسط';
$l['viewableby_desc'] = 'گروه‌های مجاز برای مشاهده این فیلد پروفایل را انتخاب کنید.';
$l['editableby'] = 'قابل ویرایش توسط';
$l['editableby_desc'] = 'گروه‌های مجاز برای ویرایش این فیلد پروفایل را انتخاب کنید.';
$l['min_posts_enabled'] = "حداقل تعداد ارسال؟";
$l['min_posts_enabled_desc'] = "آیا این فیلد فقط باید برای کاربران با تعداد ارسال مشخصی در دسترس باشد؟ اگر چنین است، حداقل مقدار ارسال مورد نیاز را اینجا تنظیم کنید.";
$l['parser_options'] = "گزینه‌های تجزیه";
$l['parse_allowhtml'] = "بله، HTML در این فیلد پروفایل مجاز است.";
$l['parse_allowmycode'] = "بله، MyCode در این فیلد پروفایل مجاز است.";
$l['parse_allowsmilies'] = "بله، شکلک‌ها در این فیلد پروفایل مجاز است.";
$l['parse_allowimgcode'] = "بله، کد [img] در این فیلد پروفایل مجاز است.";
$l['parse_allowvideocode'] = "بله، کد [video] در این فیلد پروفایل مجاز است.";
$l['save_profile_field'] = "ذخیره فیلد پروفایل";
$l['name'] = "نام";
$l['registration'] = "ثبت‌نام؟";
$l['editable'] = "قابل ویرایش؟";
$l['profile'] = "پروفایل؟";
$l['postbit'] = "Postbit؟";
$l['edit_field'] = "ویرایش فیلد";
$l['delete_field'] = "حذف فیلد";
$l['no_profile_fields'] = "در حال حاضر هیچ فیلد پروفایل سفارشی در انجمن شما وجود ندارد.";

$l['error_missing_name'] = "شما عنوانی برای این فیلد پروفایل سفارشی وارد نکرده‌اید";
$l['error_missing_description'] = "شما توضیحی برای این فیلد پروفایل سفارشی وارد نکرده‌اید";
$l['error_invalid_fid'] = "فیلد پروفایل انتخاب شده وجود ندارد.";

$l['success_profile_field_added'] = "فیلد پروفایل سفارشی با موفقیت ایجاد شد.";
$l['success_profile_field_saved'] = "فیلد پروفایل سفارشی با موفقیت ذخیره شد.";
$l['success_profile_field_deleted'] = "فیلد پروفایل سفارشی انتخاب شده با موفقیت حذف شد.";

$l['confirm_profile_field_deletion'] = "آیا مطمئن هستید که می‌خواهید این فیلد پروفایل را حذف کنید؟";
