<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['smilies'] = "شکلک‌ها";
$l['manage_smilies'] = "مدیریت شکلک‌ها";
$l['manage_smilies_desc'] = "این بخش به شما امکان می‌دهد شکلک‌های خود را ویرایش و حذف کنید.";
$l['add_smilie'] = "افزودن شکلک جدید";
$l['add_smilie_desc'] = "در اینجا می‌توانید یک شکلک جدید اضافه کنید.";
$l['add_multiple_smilies'] = "افزودن چندین شکلک";
$l['add_multiple_smilies_desc'] = "در اینجا می‌توانید چندین شکلک جدید به طور همزمان اضافه کنید.";
$l['edit_smilie'] = "ویرایش شکلک";
$l['edit_smilie_desc'] = "در اینجا می‌توانید یک شکلک را ویرایش کنید.";
$l['mass_edit'] = "ویرایش گروهی";
$l['mass_edit_desc'] = "در اینجا می‌توانید به راحتی همه شکلک‌های خود را یکجا ویرایش کنید.";

$l['no_smilies'] = "در حال حاضر هیچ شکلکی در انجمن شما وجود ندارد.";

$l['image'] = "تصویر";
$l['name'] = "نام";
$l['text_replace'] = "متن برای جایگزینی";
$l['text_replace_desc'] = "این متنی است که با شکلک جایگزین می‌شود (یک مورد در هر خط وارد کنید).";
$l['image_path'] = "مسیر تصویر";
$l['image_path_desc'] = "این مسیر به تصویر شکلک است. اگر می‌خواهید از تصاویر شکلک مختلف برای پوسته‌های مختلف استفاده کنید، لطفاً از <strong>{theme}</strong> برای نشان دادن دایرکتوری تصویر هر پوسته استفاده کنید.";
$l['order'] = "ترتیب";
$l['display_order'] = "ترتیب نمایش";
$l['display_order_desc'] = "ترتیب در لیست شکلک‌ها که این نمایش داده خواهد شد. این عدد نباید با شکلک دیگری یکسان باشد.";
$l['mass_edit_show_clickable'] = "نمایش در قابل کلیک؟";
$l['show_clickable'] = "نمایش در لیست قابل کلیک؟";
$l['show_clickable_desc'] = "آیا می‌خواهید این شکلک در لیست شکلک‌های قابل کلیک در ویرایشگر ارسال نمایش داده شود؟";
$l['include'] = "افزودن؟";
$l['path_to_images'] = "مسیر به تصاویر";
$l['path_to_images_desc'] = "این مسیر به پوشه‌ای است که تصاویر در آن قرار دارند.";
$l['smilie_delete'] = "حذف؟";
$l['save_smilie'] = "ذخیره شکلک";
$l['save_smilies'] = "ذخیره شکلک‌ها";
$l['show_smilies'] = "نمایش شکلک‌ها";
$l['reset'] = "بازنشانی";

$l['error_missing_name'] = "شما نامی برای این شکلک وارد نکرده‌اید.";
$l['error_missing_text_replacement'] = "شما جایگزین متنی برای این شکلک وارد نکرده‌اید.";
$l['error_missing_path'] = "شما مسیری برای این شکلک وارد نکرده‌اید.";
$l['error_missing_path_multiple'] = "شما مسیری وارد نکرده‌اید.";
$l['error_missing_order'] = "شما ترتیب نمایشی برای این شکلک وارد نکرده‌اید.";
$l['error_duplicate_order'] = "شما یک ترتیب نمایش معتبر برای این شکلک وارد نکرده‌اید.";
$l['error_missing_clickable'] = "شما بله یا خیر برای ویژگی \"نمایش قابل کلیک\" مشخص نکرده‌اید.";
$l['error_no_smilies'] = "هیچ شکلکی در دایرکتوری مشخص شده وجود ندارد، یا همه شکلک‌ها در دایرکتوری قبلاً اضافه شده‌اند.";
$l['error_no_images'] = "هیچ تصویری در دایرکتوری مشخص شده وجود ندارد.";
$l['error_none_included'] = "شما هیچ شکلکی برای شامل شدن انتخاب نکرده‌اید.";
$l['error_invalid_path'] = "شما یک مسیر معتبر وارد نکرده‌اید.";
$l['error_invalid_smilie'] = "شکلک مشخص شده وجود ندارد.";

$l['success_smilie_added'] = "شکلک با موفقیت اضافه شد.";
$l['success_multiple_smilies_added'] = "شکلک‌های انتخاب شده با موفقیت اضافه شدند.";
$l['success_smilie_updated'] = "شکلک با موفقیت به‌روزرسانی شد.";
$l['success_multiple_smilies_updated'] = "شکلک‌ها با موفقیت به‌روزرسانی شدند.";
$l['success_smilie_deleted'] = "شکلک انتخاب شده با موفقیت حذف شد.";
$l['success_mass_edit_updated'] = "شکلک‌ها با موفقیت به‌روزرسانی شدند.";

$l['confirm_smilie_deletion'] = "آیا مطمئن هستید که می‌خواهید این شکلک را حذف کنید؟";
