<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['thread_prefixes'] = "پیشوندهای موضوع";
$l['thread_prefixes_in'] = "پیشوندهای موضوع در \"{1}\"";
$l['thread_prefixes_desc'] = "پیشوندهای موضوع به شما امکان می‌دهند پیشوندهایی تعریف کنید که کاربران می‌توانند به موضوعات خود اختصاص دهند. سپس موضوعات می‌توانند بر اساس پیشوند در یک انجمن فیلتر شوند.";

$l['add_new_thread_prefix'] = "افزودن پیشوند موضوع جدید";
$l['add_new_thread_prefix_desc'] = "در اینجا می‌توانید یک پیشوند موضوع جدید اضافه کنید و تعریف کنید که در کجا در دسترس است و همچنین کدام گروه‌های کاربری می‌توانند از آن استفاده کنند.";

$l['edit_prefix'] = "ویرایش پیشوند";
$l['edit_prefix_desc'] = "در اینجا می‌توانید یک پیشوند موضوع را ویرایش کنید و نحوه نمایش آن، جایی که در دسترس است و کدام گروه‌های کاربری می‌توانند از آن استفاده کنند را تغییر دهید.";
$l['edit_thread_prefix'] = "ویرایش پیشوند موضوع";
$l['delete_thread_prefix'] = "حذف پیشوند موضوع";

$l['prefix_options'] = "گزینه‌های پیشوند";
$l['save_thread_prefix'] = "ذخیره پیشوند موضوع";

$l['prefix'] = "پیشوند";
$l['forums'] = "در دسترس در انجمن‌ها";
$l['prefix_desc'] = "نسخه متنی ساده پیشوند که در منوهای انتخاب نمایش داده می‌شود.";
$l['display_style'] = "سبک نمایش";
$l['display_style_desc'] = "این نحوه نمایش پیشوند در کنار موضوعات موضوع است. شما می‌توانید در اینجا نشانه‌گذاری HTML وارد کنید یا به سادگی از همان نسخه متنی ساده بالا استفاده کنید.";
$l['available_in_forums'] = "در دسترس در انجمن‌ها";
$l['available_to_groups'] = "در دسترس برای گروه‌ها";

$l['no_thread_prefixes'] = "هیچ پیشوند موضوعی تنظیم نشده است.";

$l['confirm_thread_prefix_deletion'] = "آیا مطمئن هستید که می‌خواهید این پیشوند موضوع را حذف کنید؟ توجه: باید به یاد داشته باشید که پس از حذف، هر ابزار مدیریت سفارشی که از این پیشوند استفاده می‌کند را به‌روزرسانی کنید.";

$l['success_thread_prefix_created'] = "پیشوند موضوع با موفقیت ایجاد شد.";
$l['success_thread_prefix_updated'] = "پیشوند موضوع با موفقیت به‌روزرسانی شد.";
$l['success_thread_prefix_deleted'] = "پیشوند موضوع با موفقیت حذف شد. لطفاً هر ابزار مدیریت سفارشی که از این پیشوند استفاده می‌کند را به‌روزرسانی کنید";

$l['error_missing_prefix'] = "لطفاً پیشوندی را که می‌خواهید اضافه کنید وارد کنید.";
$l['error_missing_display_style'] = "لطفاً یک سبک نمایش برای این پیشوند وارد کنید.";
$l['error_no_forums_selected'] = "لطفاً انجمن‌هایی که این پیشوند در آن‌ها در دسترس خواهد بود را انتخاب کنید.";
$l['error_no_groups_selected'] = "لطفاً گروه‌هایی که این پیشوند برای آن‌ها در دسترس خواهد بود را انتخاب کنید.";
$l['error_invalid_prefix'] = "پیشوند موضوع مشخص شده وجود ندارد.";
