<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['bad_words'] = "فیلترهای کلمات";
$l['edit_bad_word'] = "ویرایش فیلتر";
$l['edit_bad_word_desc'] = "در اینجا می‌توانید فیلتر و جایگزین آن را ویرایش کنید.";
$l['bad_word_filters'] = "فیلترهای کلمات";
$l['bad_word_filters_desc'] = "این ویژگی به شما امکان می‌دهد لیستی از کلمات یا عباراتی را مدیریت کنید که به طور خودکار در ارسال‌های انجمن شما جایگزین می‌شوند. برای جایگزینی کلمات ناسزا و موارد مشابه مفید است.";

$l['bad_word'] = "کلمه";
$l['bad_word_desc'] = "کلمه‌ای را که می‌خواهید فیلتر شود وارد کنید. نماد '*' نشان‌دهنده هر تعداد کاراکتر و نماد '+' نشان‌دهنده هر کاراکتر واحد (به غیر از فاصله و خط جدید) است.";
$l['bad_word_max'] = "یک کلمه فیلتر شده نمی‌تواند طولانی‌تر از 100 کاراکتر باشد.";
$l['replacement'] = "جایگزین";
$l['replacement_desc'] = "رشته‌ای را که جایگزین کلمه فیلتر شده می‌شود وارد کنید (اگر خالی باشد، ستاره‌ها نمایش داده می‌شوند).";
$l['regex'] = "عبارت منظم";
$l['regex_desc'] = "فیلد \"کلمه\" را به عنوان یک عبارت منظم در نظر بگیرید.";
$l['replacement_word_max'] = "کلمه جایگزین نمی‌تواند طولانی‌تر از 100 کاراکتر باشد.";
$l['error_replacement_word_invalid'] = "کلمه جایگزین نمی‌تواند معادل کلمه فیلتر شده باشد.";

$l['save_bad_word'] = "ذخیره فیلتر";
$l['no_bad_words'] = "در حال حاضر هیچ فیلتر کلمه‌ای تنظیم نشده است.";
$l['add_bad_word'] = "افزودن فیلتر";
$l['add_bad_word_desc'] = "در اینجا می‌توانید یک فیلتر کلمه و جایگزین آن را اضافه کنید.";

$l['error_missing_bad_word'] = "شما فیلتر کلمه‌ای وارد نکرده‌اید.";
$l['error_invalid_regex'] = "عبارت منظم مشخص شده معتبر نیست.";
$l['error_invalid_bid'] = "فیلتر مشخص شده وجود ندارد.";
$l['error_bad_word_filtered'] = "فیلتری که وارد کرده‌اید از قبل وجود دارد.";

$l['success_added_bad_word'] = "فیلتر با موفقیت اضافه شد.";
$l['success_deleted_bad_word'] = "فیلتر با موفقیت حذف شد.";
$l['success_updated_bad_word'] = "فیلتر با موفقیت به‌روزرسانی شد.";

$l['confirm_bad_word_deletion'] = "آیا مطمئن هستید که می‌خواهید این فیلتر را حذف کنید؟";
