<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['spiders_bots'] = "عنکبوت‌ها / ربات‌ها";
$l['spiders_bots_desc'] = "این بخش به شما امکان می‌دهد عنکبوت‌های موتور جستجو و ربات‌هایی را که به طور خودکار توسط انجمن شما شناسایی می‌شوند مدیریت کنید. شما همچنین می‌توانید ببینید که یک ربات خاص آخرین بار چه زمانی بازدید کرده است.";
$l['add_new_bot'] = "افزودن ربات جدید";
$l['add_new_bot_desc'] = "در اینجا می‌توانید یک ربات جدید اضافه کنید که می‌خواهید توسط انجمن شما شناسایی شود.";

$l['edit_bot'] = "ویرایش ربات";
$l['edit_bot_desc'] = "در اینجا می‌توانید یک ربات موجود را ویرایش کنید.";

$l['bot'] = "ربات";
$l['last_visit'] = "آخرین بازدید";
$l['no_bots'] = "هیچ عنکبوت موتور جستجو یا خزنده وب توسط این انجمن ردیابی نمی‌شود.";

$l['name'] = "نام";
$l['name_desc'] = "نام این ربات را که می‌خواهید با آن شناسایی شود وارد کنید";
$l['user_agent'] = "رشته User Agent";
$l['user_agent_desc'] = "رشته‌ای را که با user agent ربات مطابقت داده می‌شود وارد کنید (مطابقت‌های جزئی پذیرفته می‌شوند)";
$l['language_str'] = "زبان";
$l['language_desc'] = "بسته زبانی را که ربات هنگام مشاهده انجمن استفاده می‌کند انتخاب کنید.";
$l['theme'] = "پوسته";
$l['theme_desc'] = "پوسته‌ای را که ربات هنگام مشاهده انجمن استفاده می‌کند انتخاب کنید.";
$l['user_group'] = "گروه کاربری";
$l['user_group_desc'] = "گروه کاربری که مجوزها از آن برای این انجمن اعمال می‌شود را انتخاب کنید (توجه: توصیه نمی‌شود این را از گروه مهمانان پیش‌فرض تغییر دهید)";
$l['save_bot'] = "ذخیره ربات";
$l['use_board_default'] = "استفاده از پیش‌فرض انجمن";

$l['error_invalid_bot'] = "ربات مشخص شده وجود ندارد.";
$l['error_missing_name'] = "شما نامی برای این ربات وارد نکرده‌اید";
$l['error_missing_agent'] = "شما رشته user agent برای این ربات وارد نکرده‌اید";

$l['success_bot_created'] = "ربات با موفقیت ایجاد شد.";
$l['success_bot_updated'] = "ربات با موفقیت به‌روزرسانی شد.";
$l['success_bot_deleted'] = "ربات انتخاب شده با موفقیت حذف شد.";

$l['confirm_bot_deletion'] = "آیا مطمئن هستید که می‌خواهید این ربات را حذف کنید؟";
