<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['warning_system'] = "سیستم اخطار";
$l['warning_types'] = "انواع اخطار";
$l['warning_types_desc'] = "در اینجا می‌توانید لیست انواع مختلف اخطارهایی را که کارکنان مجاز به صدور برای کاربران هستند مدیریت کنید.";
$l['add_warning_type'] = "افزودن نوع اخطار جدید";
$l['add_warning_type_desc'] = "در اینجا می‌توانید یک نوع اخطار از پیش تعریف شده ایجاد کنید. انواع اخطار هنگام اخطار دادن به کاربران قابل انتخاب هستند و می‌توانید مقداری را که برای این نوع اضافه می‌شود و همچنین دوره زمانی قبل از انقضای اخطارهای این نوع را تعریف کنید.";
$l['edit_warning_type'] = "ویرایش نوع اخطار";
$l['edit_warning_type_desc'] = "در اینجا می‌توانید این نوع اخطار را ویرایش کنید. انواع اخطار هنگام اخطار دادن به کاربران قابل انتخاب هستند و می‌توانید مقداری را که برای این نوع اضافه می‌شود و همچنین دوره زمانی قبل از انقضای اخطارهای این نوع را تعریف کنید.";
$l['warning_levels'] = "سطوح اخطار";
$l['warning_levels_desc'] = "سطوح اخطار تعریف می‌کنند که چه اتفاقی برای کاربر می‌افتد وقتی به یک سطح اخطار خاص می‌رسند (درصدی از حداکثر سطح اخطار). شما می‌توانید کاربران را مسدود کنید یا امتیازات(امکان ارسال پست...) آن‌ها را معلق کنید.";
$l['add_warning_level'] = "افزودن سطح اخطار جدید";
$l['add_warning_level_desc'] = "در اینجا می‌توانید یک سطح اخطار جدید ایجاد کنید. سطوح اخطار اقداماتی هستند که باید علیه کاربران هنگامی که به درصد خاصی از سطح اخطار حداکثر می‌رسند انجام شوند.";
$l['edit_warning_level'] = "ویرایش سطح اخطار";
$l['edit_warning_level_desc'] = "سطوح اخطار اقداماتی هستند که باید علیه کاربران هنگامی که به درصد خاصی از سطح اخطار حداکثر می‌رسند انجام شوند.";

$l['percentage'] = "درصد";
$l['action_to_take'] = "اقدام برای انجام";
$l['move_banned_group'] = "انتقال به گروه مسدود شده ({3}) برای {1} {2}";
$l['move_banned_group_permanent'] = "انتقال به گروه مسدود شده ({1}) به طور دائمی";
$l['suspend_posting'] = "معلق کردن امتیازات ارسال(امکان ارسال پست...) برای {1} {2}";
$l['suspend_posting_permanent'] = "معلق کردن امتیازات ارسال(امکان ارسال پست...) به طور دائمی";
$l['moderate_new_posts'] = "تایید ارسال‌های جدید برای {1} {2}";
$l['moderate_new_posts_permanent'] = "تایید ارسال‌های جدید به طور دائمی";
$l['no_warning_levels'] = "در حال حاضر هیچ سطح اخطاری در انجمن شما وجود ندارد.";

$l['warning_type'] = "نوع اخطار";
$l['points'] = "مورد";
$l['expires_after'] = "انقضا پس از";
$l['no_warning_types'] = "در حال حاضر هیچ نوع اخطاری در انجمن شما وجود ندارد.";

$l['warning_points_percentage'] = "درصد از حداکثر میزان اخطار";
$l['warning_points_percentage_desc'] = "لطفاً یک مقدار عددی بین 1 و 100 وارد کنید.";
$l['action_to_be_taken'] = "اقدامی که باید انجام شود";
$l['action_to_be_taken_desc'] = "اقدامی را که می‌خواهید هنگامی که کاربران به سطح بالا می‌رسند انجام شود انتخاب کنید.";
$l['ban_user'] = "مسدود کردن کاربر";
$l['banned_group'] = "گروه مسدود شده:";
$l['ban_length'] = "طول مسدودسازی:";
$l['suspend_posting_privileges'] = "معلق کردن امتیازات ارسال(امکان ارسال پست...)";
$l['suspension_length'] = "طول تعلیق:";
$l['moderate_posts'] = "تایید ارسال‌ها";
$l['moderation_length'] = "طول تایید:";
$l['save_warning_level'] = "ذخیره سطح اخطار";

$l['title'] = "عنوان";
$l['points_to_add'] = "مقادیر اخطار اضافه شده";
$l['points_to_add_desc'] = "میزان اخطاری که به سطح اخطار کاربر اضافه می‌شود.";
$l['warning_expiry'] = "انقضای اخطار";
$l['warning_expiry_desc'] = "چقدر پس از دادن این اخطار می‌خواهید منقضی شود؟";
$l['save_warning_type'] = "ذخیره نوع اخطار";

$l['expiration_hours'] = "ساعت";
$l['expiration_days'] = "روز";
$l['expiration_weeks'] = "هفته";
$l['expiration_months'] = "ماه";
$l['expiration_never'] = "هرگز";
$l['expiration_permanent'] = "دائمی";

$l['error_invalid_warning_level'] = "سطح اخطار مشخص شده وجود ندارد.";
$l['error_invalid_warning_percentage'] = "شما یک مقدار درصد معتبر برای این سطح اخطار وارد نکرده‌اید. مقدار درصد شما باید بین 1 و 100 باشد.";
$l['error_invalid_warning_type'] = "نوع اخطار مشخص شده وجود ندارد.";
$l['error_missing_action_type'] = "لطفاً یکی از اقداماتی را که باید با این سطح اخطار جدید انجام شود انتخاب کنید.";
$l['error_missing_type_title'] = "شما عنوانی برای این نوع اخطار وارد نکرده‌اید";
$l['error_missing_type_points'] = "شما مقدار معتبری برای اضافه کردن هنگام اخطار دادن از این نوع وارد نکرده‌اید. شما باید عددی بزرگتر از 0 اما نه بزرگتر از {1} وارد کنید";

$l['success_warning_level_created'] = "سطح اخطار با موفقیت ایجاد شد.";
$l['success_warning_level_updated'] = "سطح اخطار با موفقیت به‌روزرسانی شد.";
$l['success_warning_level_deleted'] = "سطح اخطار انتخاب شده با موفقیت حذف شد.";
$l['success_warning_type_created'] = "نوع اخطار با موفقیت ایجاد شد.";
$l['success_warning_type_updated'] = "نوع اخطار با موفقیت به‌روزرسانی شد.";
$l['success_warning_type_deleted'] = "نوع اخطار انتخاب شده با موفقیت حذف شد.";

$l['confirm_warning_level_deletion'] = "آیا مطمئن هستید که می‌خواهید این سطح اخطار را حذف کنید؟";
$l['confirm_warning_type_deletion'] = "آیا مطمئن هستید که می‌خواهید این نوع اخطار را حذف کنید؟";
