<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['attachment_types'] = "انواع پیوست";
$l['attachment_types_desc'] = "در اینجا می‌توانید انواع پیوست‌ها را ایجاد و مدیریت کنید که مشخص می‌کنند کاربران چه نوع فایل‌هایی می‌توانند به ارسال‌ها ضمیمه کنند. توجه: غیرفعال کردن یک نوع پیوست، پیوست‌های موجود از این نوع را غیرقابل دسترس می‌کند.";
$l['add_new_attachment_type'] = "افزودن نوع پیوست جدید";
$l['add_attachment_type'] = "افزودن نوع پیوست";
$l['add_attachment_type_desc'] = "افزودن یک نوع پیوست جدید به اعضا امکان می‌دهد فایل‌های این نوع را به ارسال‌های خود ضمیمه کنند. شما توانایی کنترل پسوند، نوع MIME، اندازه حداکثر و نمایش یک آیکن کوچک برای هر نوع پیوست را دارید.";
$l['edit_attachment_type'] = "ویرایش نوع پیوست";
$l['edit_attachment_type_desc'] = "شما توانایی کنترل پسوند، نوع MIME، اندازه حداکثر و نمایش یک نوع MIME کوچک برای این نوع پیوست را دارید.";

$l['extension'] = "پسوند";
$l['maximum_size'] = "حداکثر اندازه";
$l['no_attachment_types'] = "در حال حاضر هیچ نوع پیوستی در انجمن شما وجود ندارد.";

$l['name'] = "نام";
$l['name_desc'] = "نام نوع پیوست را وارد کنید.";
$l['file_extension'] = "پسوند فایل";
$l['file_extension_desc'] = "پسوند فایلی که می‌خواهید آپلود آن مجاز باشد را اینجا وارد کنید (نقطه قبل از پسوند را وارد نکنید) (مثال: txt)";
$l['mime_type'] = "نوع MIME";
$l['mime_type_desc'] = "نوع MIME ارسال شده توسط سرور هنگام دانلود فایل‌های این نوع را وارد کنید (<a href=\"http://www.freeformatter.com/mime-types-list.html\">لیست را اینجا ببینید</a>)";
$l['maximum_file_size'] = "حداکثر اندازه فایل (کیلوبایت)";
$l['maximum_file_size_desc'] = "حداکثر اندازه فایل برای آپلودهای این نوع پیوست بر حسب کیلوبایت (1 مگابایت = 1024 کیلوبایت)";
$l['limit_intro'] = "لطفاً اطمینان حاصل کنید که حداکثر اندازه فایل کمتر از کوچک‌ترین محدودیت‌های PHP زیر باشد:";
$l['limit_post_max_size'] = "حداکثر اندازه پست: {1}";
$l['limit_upload_max_filesize'] = "حداکثر اندازه فایل آپلود: {1}";
$l['attachment_icon'] = "آیکن پیوست";
$l['attachment_icon_desc'] = "اگر می‌خواهید یک آیکن پیوست کوچک برای پیوست‌های این نوع نمایش دهید، مسیر آن را اینجا وارد کنید. {theme} با دایرکتوری تصویر پوسته بیننده جایگزین می‌شود و به شما امکان می‌دهد آیکن‌های پیوست مختص هر پوسته را مشخص کنید.";
$l['save_attachment_type'] = "ذخیره نوع پیوست";

$l['error_invalid_attachment_type'] = "شما یک نوع پیوست نامعتبر انتخاب کرده‌اید.";
$l['error_missing_mime_type'] = "شما نوع MIME را برای این نوع پیوست وارد نکرده‌اید";
$l['error_missing_extension'] = "شما پسوند فایل را برای این نوع پیوست وارد نکرده‌اید";

$l['success_attachment_type_created'] = "نوع پیوست با موفقیت ایجاد شد.";
$l['success_attachment_type_updated'] = "نوع پیوست با موفقیت به‌روزرسانی شد.";
$l['success_attachment_type_deleted'] = "نوع پیوست با موفقیت حذف شد.";

$l['confirm_attachment_type_deletion'] = "آیا مطمئن هستید که می‌خواهید این نوع پیوست را حذف کنید؟";

$l['success_activated_attachment_type'] = 'نوع پیوست انتخاب شده با موفقیت فعال شد.';
$l['success_deactivated_attachment_type'] = 'نوع پیوست انتخاب شده با موفقیت غیرفعال شد.';

$l['enabled'] = "فعال شده؟";
$l['forcedownload'] = "اجبار به دانلود";
$l['forcedownload_desc'] = "فعال کردن این گزینه همیشه پیوست را مجبور به دانلود به عنوان یک فایل می‌کند.";
$l['avatar_file'] = 'فایل آواتار';
$l['avatar_file_desc'] = 'آیا می‌خواهید این نوع پیوست برای آواتارها قابل استفاده باشد؟';

$l['available_to_groups'] = 'در دسترس برای گروه‌ها';
$l['available_in_forums'] = 'در دسترس در انجمن‌ها';
