<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['themes'] = "پوسته‌ها";
$l['themes_desc'] = "در اینجا می‌توانید پوسته‌های تنظیم شده در انجمن خود را مدیریت کنید. پوسته‌ها به شما امکان می‌دهند ظاهر انجمن خود را سفارشی کنید. لیستی از پوسته‌هایی که در حال حاضر تنظیم شده‌اند در زیر نشان داده شده است.";

$l['create_new_theme'] = "ایجاد پوسته جدید";
$l['create_new_theme_desc'] = "در اینجا می‌توانید یک پوسته جدید بر اساس پیش‌فرض ایجاد کنید. <strong>مجموعه قالب‌ها، استایل‌شیت‌ها و سایر تنظیمات از پوسته والد به ارث برده می‌شوند.</strong>";

$l['import_a_theme'] = "وارد کردن یک پوسته";
$l['import_a_theme_desc'] = "در اینجا می‌توانید پوسته‌های جدید را وارد کنید. می‌توانید یک پوسته را از کامپیوتر خود یا از یک آدرس اینترنتی وارد کنید.";

$l['edit_stylesheets'] = "ویرایش استایل‌شیت‌ها";
$l['edit_stylesheets_desc'] = "در اینجا می‌توانید به راحتی استایل‌شیت‌های مورد استفاده توسط این پوسته را مدیریت کنید. استایل‌شیت‌ها بر اساس CSS هستند و فونت‌ها، رنگ‌ها و سایر جنبه‌های بصری این پوسته را تعریف می‌کنند. لیستی از استایل‌شیت‌های متصل به این پوسته در زیر آمده است.";

$l['add_stylesheet'] = "افزودن استایل‌شیت";
$l['add_stylesheet_desc'] = "در اینجا می‌توانید یک استایل‌شیت جدید به این پوسته اضافه کنید. یک استایل‌شیت حاوی CSS است که به شما امکان می‌دهد ظاهر این پوسته را سفارشی کنید. پس از ایجاد، به صفحه ویرایش استایل‌شیت منتقل خواهید شد.";

$l['browse_themes'] = "مرور پوسته‌ها";
$l['browse_themes_desc'] = "در اینجا می‌توانید سایت اصلاحات رسمی MyBB را برای پوسته‌های سازگار با سری MyBB خود مرور کنید.";

$l['browse_all_themes'] = "مرور تمام پوسته‌ها";

$l['export_theme'] = "صدور پوسته";
$l['export_theme_desc'] = "در اینجا می‌توانید پوسته‌ها و قالب‌های سفارشی شده خود را صادر کنید. صدور پوسته‌ها در صورتی مفید است که بخواهید آن‌ها را با دیگران به اشتراک بگذارید یا به انجمن دیگری وارد کنید.";

$l['duplicate_theme'] = "تکثیر پوسته";
$l['duplicate_theme_desc'] = "در اینجا می‌توانید پوسته‌های خود را تکثیر کنید. این به شما کمک می‌کند اگر بخواهید نسخه دیگری از آن را توسعه دهید.";

$l['colors_manage'] = "مدیریت رنگ‌ها";
$l['colors_attached_to'] = "تنظیم رنگ";
$l['colors_setting'] = "رنگ پایه";
$l['colors_setting_desc'] = "رنگی را که این پوسته باید به عنوان رنگ پایه خود استفاده کند انتخاب کنید. استایل‌شیت‌های متصل به این رنگ استفاده خواهند شد.";
$l['colors_no_color_setting'] = "هیچ رنگی در دسترس نیست. لطفاً لیستی از رنگ‌ها را در زیر ایجاد کنید تا از این ویژگی استفاده کنید.";
$l['colors_add'] = "مدیریت رنگ‌ها";
$l['colors_add_desc'] = "لیستی از رنگ‌های موجود برای این پوسته. این باید لیستی از رنگ‌های جفت کلید (key=item) باشد، برای مثال، <em>blue=آبی</em>. موارد را با خط جدید جدا کنید.";
$l['colors_please_select'] = "هیچکدام";
$l['colors_add_edit_desc'] = "یک رنگ برای اتصال این استایل‌شیت انتخاب کنید. می‌توانید بیش از یک رنگ را انتخاب کنید.";
$l['colors_specific_color'] = "رنگ خاص";

$l['include_custom_only'] = "شامل موارد سفارشی شده فقط؟";
$l['include_custom_only_desc'] = "اگر می‌خواهید موارد (css و استایل‌شیت‌ها) به ارث برده شده از پوسته‌های والد را شامل شوید \"خیر\" را انتخاب کنید، در غیر این صورت فقط عناصر سفارشی شده صادر خواهند شد.";
$l['include_templates'] = "قالب‌ها نیز در صادرات گنجانده شوند؟";
$l['include_templates_desc'] = "اگر می‌خواهید قالب‌های سفارشی شده استفاده شده در این پوسته نیز صادر شوند، بله را انتخاب کنید.";

$l['edit_stylesheet_simple_mode'] = "ویرایش استایل‌شیت: حالت ساده";
$l['edit_stylesheet_simple_mode_desc'] = "در اینجا می‌توانید به راحتی استایل‌شیت پوسته خود را ویرایش کنید. حالت ساده به شما امکان می‌دهد CSS در این استایل‌شیت را با دانش کم یا بدون دانش CSS سفارشی کنید. با انتخاب یک مورد در زیر شروع کنید.";
$l['edit_stylesheet_advanced_mode'] = "ویرایش استایل‌شیت: حالت پیشرفته";
$l['edit_stylesheet_advanced_mode_desc'] = "در اینجا می‌توانید این استایل‌شیت را مانند یک فایل ساده ویرایش کنید. محتوای استایل‌شیت CSS در ناحیه متن زیر نشان داده شده است.";

$l['theme'] = "پوسته";
$l['num_users'] = "# کاربران";
$l['edit_theme'] = "ویرایش پوسته";
$l['delete_theme'] = "حذف پوسته";
$l['set_as_default'] = "تنظیم به عنوان پیش‌فرض";
$l['default_theme'] = "پوسته پیش‌فرض";
$l['force_on_users'] = "اجبار بر کاربران";
$l['delete_revert'] = "حذف / بازگشت";

$l['local_file'] = "فایل محلی";
$l['url'] = "URL";
$l['import_from'] = "وارد کردن از";
$l['import_from_desc'] = "یک فایل برای وارد کردن انتخاب کنید. می‌توانید فایل پوسته را از کامپیوتر خود یا از یک آدرس اینترنتی وارد کنید. به خاطر داشته باشید که فقط از پوسته‌های <strong>از منابع ایمن و قابل اعتماد</strong> استفاده کنید.";
$l['parent_theme'] = "پوسته والد";
$l['parent_theme_desc'] = "پوسته‌ای را انتخاب کنید که این پوسته باید فرزند آن باشد.";
$l['new_name'] = "نام جدید";
$l['new_name_desc'] = "یک نام جدید برای پوسته وارد شده. اگر خالی رها شود، نام موجود در فایل پوسته استفاده خواهد شد.";
$l['advanced_options'] = "گزینه‌های پیشرفته";
$l['ignore_version_compatibility'] = "نادیده گرفتن سازگاری نسخه";
$l['ignore_version_compat_desc'] = "آیا این پوسته بدون توجه به نسخه MyBB که برای آن ایجاد شده است نصب شود؟";
$l['import_stylesheets'] = "وارد کردن استایل‌شیت‌ها";
$l['import_stylesheets_desc'] = "اگر این پوسته حاوی استایل‌شیت‌های سفارشی است، آیا باید وارد شوند؟";
$l['import_templates'] = "وارد کردن قالب‌ها";
$l['import_templates_desc'] = "اگر این پوسته حاوی قالب‌های سفارشی است، آیا باید وارد شوند؟";
$l['import_theme'] = "وارد کردن پوسته";

$l['new_name_duplicate_desc'] = "یک نام جدید برای پوسته تکثیر شده.";
$l['duplicate_stylesheets'] = "تکثیر استایل‌شیت‌ها";
$l['duplicate_stylesheets_desc'] = "اگر این پوسته حاوی استایل‌شیت‌های سفارشی است، آیا باید تکثیر شوند؟";
$l['duplicate_templates'] = "تکثیر قالب‌ها";
$l['duplicate_templates_desc'] = "اگر این پوسته حاوی قالب‌های سفارشی است، آیا باید تکثیر شوند؟";

$l['create_a_theme'] = "ایجاد یک پوسته";
$l['name'] = "نام";
$l['name_desc'] = "یک نام برای پوسته جدید مشخص کنید.";
$l['display_order'] = "ترتیب نمایش";

$l['edit_theme_properties'] = "ویرایش ویژگی‌های پوسته";
$l['name_desc_edit'] = "یک نام برای پوسته مشخص کنید.";
$l['allowed_user_groups'] = "گروه‌های کاربری مجاز";
$l['allowed_user_groups_desc'] = "مشخص کنید کدام گروه‌های کاربری مجاز به استفاده از این پوسته هستند. انتخاب 'همه گروه‌های کاربری' هر انتخاب دیگری را لغو می‌کند. برای انتخاب چند گروه کاربری، کلید CTRL را نگه دارید.";
$l['all_user_groups'] = "همه گروه‌های کاربری";
$l['template_set'] = "مجموعه قالب";
$l['template_set_desc'] = "مجموعه قالب‌ای که پوسته باید استفاده کند را مشخص کنید. مجموعه قالب انتخاب شده، نشانه‌گذاری (HTML) استفاده شده در ارائه پوسته را تعریف می‌کند.";
$l['editor_theme'] = "سبک ویرایشگر";
$l['editor_theme_desc'] = "سبک مورد استفاده برای ویرایشگر MyCode در این پوسته را مشخص کنید. سبک‌های ویرایشگر در پوشه <strong>jscripts/sceditor/themes</strong> یافت می‌شوند.";
$l['img_directory'] = "پوشه تصاویر";
$l['img_directory_desc'] = "پوشه ریشه برای مکان تصاویر استفاده شده در این پوسته. توجه داشته باشید که این فقط پوشه تصاویر استفاده شده در قالب‌ها را مشخص می‌کند، نه استایل‌شیت‌ها.";
$l['logo'] = "لوگوی انجمن";
$l['logo_desc'] = "مکان لوگوی انجمن استفاده شده در این پوسته (این لوگویی است که در بالای هر صفحه ظاهر می‌شود).";
$l['table_spacing'] = "فاصله‌گذاری جدول";
$l['table_spacing_desc'] = "عرض padding داخلی سلول‌های جدول، بر حسب پیکسل. این ویژگی <em>cellpadding</em> HTML تگ <em>table</em> است.";
$l['inner_border'] = "عرض حاشیه داخلی جدول";
$l['inner_border_desc'] = "مقدار padding بین هر سلول جدول، بر حسب پیکسل. این ویژگی <em>cellspacing</em> HTML تگ <em>table</em> است.";
$l['save_theme_properties'] = "ذخیره ویژگی‌های پوسته";
$l['save_stylesheet_order'] = "ذخیره ترتیب استایل‌شیت‌ها";

$l['background'] = "پس‌زمینه";
$l['extra_css_atribs'] = "ویژگی‌های CSS اضافی";
$l['color'] = "رنگ";
$l['width'] = "عرض";
$l['text_decoration'] = "تزئین متن";
$l['font_family'] = "خانواده فونت";
$l['font_size'] = "اندازه فونت";
$l['font_style'] = "سبک فونت";
$l['font_weight'] = "ضخامت فونت";

$l['stylesheets'] = "استایل‌شیت‌ها";
$l['inherited_from'] = "به ارث برده شده از";
$l['attached_to'] = "متصل به";
$l['attached_to_nothing'] = "به چیزی متصل نیست";
$l['attached_to_desc'] = "می‌توانید استایل‌شیت‌ها را به طور سراسری یا به فایل‌های خاص متصل کنید. اگر آن را به فایل‌های خاص متصل کنید، می‌توانید آن را به اقدامات خاص در هر فایل متصل کنید.";
$l['actions'] = "اقدامات";
$l['of'] = "از";
$l['attached_to_all_pages'] = "متصل به تمام صفحات";
$l['properties'] = "ویژگی‌ها";
$l['edit_style'] = "ویرایش سبک";
$l['stylesheets_in'] = "استایل‌شیت‌ها در";
$l['stylesheet_properties'] = "ویژگی‌های استایل‌شیت";
$l['stylesheet_inherited_default'] = "این استایل‌شیت در حال حاضر از {1} به ارث برده می‌شود. هر تغییری که ایجاد کنید ارث‌بری را قطع می‌کند و استایل‌شیت به این پوسته کپی می‌شود.";
$l['stylesheet_inherited'] = "این استایل‌شیت در حال حاضر از {1} به ارث برده می‌شود. هر تغییری که ایجاد کنید ارث‌بری را قطع می‌کند و استایل‌شیت به این پوسته کپی می‌شود. این استایل‌شیت را در {1} ویرایش کنید تا ارث‌بری حفظ شود.";
$l['globally'] = "سراسری";
$l['specific_files'] = "فایل‌های خاص";
$l['specific_actions'] = "اقدامات خاص";
$l['specific_actions_desc'] = "اقدامات با کاما جدا می‌شوند";
$l['file'] = "فایل";
$l['add_another'] = "افزودن دیگری";
$l['edit_stylesheet_properties_for'] = "ویرایش ویژگی‌های استایل‌شیت برای";
$l['file_name'] = "نام فایل";
$l['file_name_desc'] = "نام استایل‌شیت، معمولاً به <strong>[.css]</strong> ختم می‌شود";
$l['save_stylesheet_properties'] = "ذخیره ویژگی‌های استایل‌شیت";
$l['saved'] = "ذخیره شده";
$l['editing'] = "در حال ویرایش";
$l['selector'] = "انتخابگر";
$l['save_changes'] = "ذخیره تغییرات";
$l['save_changes_and_close'] = "ذخیره تغییرات و بستن";
$l['save_changes_js'] = "آیا می‌خواهید ابتدا تغییرات خود را ذخیره کنید؟";
$l['delete_confirm_js'] = "آیا مطمئن هستید که می‌خواهید این را حذف کنید؟";
$l['import_stylesheet_from'] = "وارد کردن از استایل‌شیت دیگر در این پوسته";
$l['write_own'] = "نوشتن محتوای خودم";
$l['save_stylesheet'] = "ذخیره استایل‌شیت";
$l['add_stylesheet_to'] = "افزودن استایل‌شیت به";

$l['full_stylesheet_for'] = "استایل‌شیت کامل برای";

$l['recommended_themes_for_mybb'] = "پوسته‌های توصیه شده برای MyBB {1}";
$l['browse_results_for_mybb'] = "مرور نتایج برای MyBB {1}";
$l['search_for_themes'] = "جستجو برای پوسته‌ها";
$l['search'] = "جستجو";
$l['download'] = "دانلود";
$l['created_by'] = "ساخته شده توسط";
$l['theme_thumbnail'] = "بندانگشتی پوسته";

$l['error_invalid_stylesheet'] = "شما یک استایل‌شیت نامعتبر انتخاب کرده‌اید.";
$l['error_invalid_theme'] = "شما یک پوسته نامعتبر انتخاب کرده‌اید.";
$l['error_missing_name'] = "لطفاً یک نام برای این پوسته وارد کنید.";
$l['error_missing_url'] = "لطفاً یک آدرس اینترنتی معتبر برای وارد کردن یک پوسته وارد کنید.";
$l['error_theme_already_exists'] = "یک پوسته با همین نام از قبل وجود دارد. لطفاً یک نام متفاوت مشخص کنید.";
$l['error_theme_security_problem'] = "یک مشکل امنیتی بالقوه در پوسته یافت شد. وارد نشد. لطفاً با نویسنده یا گروه MyBB برای پشتیبانی تماس بگیرید.";

$l['error_local_file'] = "فایل محلی قابل باز کردن نبود. آیا وجود دارد؟ لطفاً بررسی کرده و دوباره تلاش کنید.";
$l['error_uploadfailed'] = "آپلود ناموفق بود. لطفاً دوباره تلاش کنید.";
$l['error_uploadfailed_detail'] = "جزئیات خطا: ";
$l['error_uploadfailed_php1'] = "PHP برگرداند: فایل آپلود شده از دستور upload_max_filesize در php.ini تجاوز کرد. لطفاً با مدیر انجمن خود با این خطا تماس بگیرید.";
$l['error_uploadfailed_php2'] = "فایل آپلود شده از حداکثر اندازه فایل مشخص شده تجاوز کرد.";
$l['error_uploadfailed_php3'] = "فایل آپلود شده فقط частиاً آپلود شد.";
$l['error_uploadfailed_php4'] = "هیچ فایلی آپلود نشد.";
$l['error_uploadfailed_php6'] = "PHP برگرداند: پوشه موقت وجود ندارد. لطفاً با مدیر انجمن خود با این خطا تماس بگیرید.";
$l['error_uploadfailed_php7'] = "PHP برگرداند: نوشتن فایل روی دیسک ناموفق بود. لطفاً با مدیر انجمن خود با این خطا تماس بگیرید.";
$l['error_uploadfailed_phpx'] = "PHP کد خطا برگرداند: {1}. لطفاً با مدیر انجمن خود با این خطا تماس بگیرید.";
$l['error_uploadfailed_lost'] = "فایل روی سرور یافت نشد.";
$l['error_uploadfailed_nocontents'] = "MyBB نتوانست پوسته را با فایلی که آپلود کردید پیدا کند. لطفاً بررسی کنید فایل صحیح است و خراب نیست.";
$l['error_invalid_version'] = "این پوسته برای نسخه دیگری از MyBB نوشته شده است. لطفاً \"نادیده گرفتن سازگاری نسخه\" را بررسی کنید تا این خطا نادیده گرفته شود.";
$l['error_missing_stylesheet_name'] = "لطفاً یک نام برای این استایل‌شیت وارد کنید.";
$l['error_missing_stylesheet_extension'] = "این استایل‌شیت باید با پسوند فایل صحیح ختم شود، برای مثال، {1}<em>.css</em>";
$l['error_invalid_parent_theme'] = "پوسته والد انتخاب شده وجود ندارد. لطفاً یک پوسته والد معتبر انتخاب کنید.";
$l['error_invalid_templateset'] = "مجموعه قالب انتخاب شده وجود ندارد. لطفاً یک مجموعه قالب معتبر انتخاب کنید.";
$l['error_invalid_color'] = "مجموعه رنگ تعریف شده \"{1}\" یا دارای کاراکتر(های) نامعتبر است یا در فرمت تجویز شده نیست. فقط اعداد، حروف یونیکد و زیرخط در نام رنگ و مقدار آن مجاز هستند که باید با '=' جدا شوند.";
$l['error_invalid_editortheme'] = "سبک ویرایشگر انتخاب شده وجود ندارد. لطفاً یک سبک ویرایشگر معتبر انتخاب کنید.";
$l['error_inheriting_stylesheets'] = "شما نمی‌توانید این پوسته را حذف کنید زیرا هنوز پوسته‌های دیگری وجود دارند که استایل‌شیت‌ها را از آن به ارث می‌برند.";
$l['error_cannot_parse'] = "MyBB نمی‌تواند این استایل‌شیت را برای ویرایشگر ساده تجزیه کند. فقط می‌تواند در حالت پیشرفته ویرایش شود.";
$l['error_communication_problem'] = "مشکلی در ارتباط با سرور پوسته‌های MyBB وجود داشت. لطفاً چند دقیقه دیگر دوباره تلاش کنید.";
$l['error_no_results_found'] = "هیچ نتیجه‌ای برای کلمه(های) کلیدی مشخص شده یافت نشد.";
$l['error_no_color_picked'] = "شما مشخص نکرده‌اید که این استایل‌شیت به کدام رنگ‌ها متصل شود.";
$l['error_no_display_order'] = "خطایی در یافتن ترتیب نمایش برای استایل‌شیت‌ها وجود داشت. لطفاً صفحه را تازه کرده و دوباره تلاش کنید.";

$l['success_duplicated_theme'] = "پوسته انتخاب شده با موفقیت تکثیر شد.";
$l['success_imported_theme'] = "پوسته انتخاب شده با موفقیت وارد شد.";
$l['success_theme_created'] = "پوسته با موفقیت ایجاد شد.";
$l['success_theme_deleted'] = "پوسته انتخاب شده با موفقیت حذف شد.";
$l['success_stylesheet_properties_updated'] = "ویژگی‌های استایل‌شیت انتخاب شده با موفقیت به‌روز شد.";
$l['success_stylesheet_updated'] = "استایل‌شیت انتخاب شده با موفقیت به‌روز شد.";
$l['success_stylesheet_deleted'] = "استایل‌شیت انتخاب شده با موفقیت حذف / بازگردانده شد.";
$l['success_theme_set_default'] = "پوسته انتخاب شده اکنون پیش‌فرض انجمن است.";
$l['success_theme_forced'] = "تمام کاربران با موفقیت مجبور به استفاده از پوسته انتخاب شده شدند.";
$l['success_theme_properties_updated'] = "ویژگی‌های پوسته انتخاب شده با موفقیت به‌روز شد.";
$l['success_stylesheet_added'] = "استایل‌شیت برای این پوسته با موفقیت ایجاد شد.";
$l['success_stylesheet_order_updated'] = "ترتیب نمایش استایل‌شیت‌ها با موفقیت به‌روز شد.";

$l['confirm_theme_deletion'] = "آیا مطمئن هستید که می‌خواهید این پوسته را حذف کنید؟";
$l['confirm_stylesheet_deletion'] = "آیا مطمئن هستید که می‌خواهید این استایل‌شیت را حذف / بازگردانید؟";
$l['confirm_theme_forced'] = "آیا مطمئن هستید که می‌خواهید این پوسته را بر تمام کاربران تحمیل کنید؟ این ممکن است سطح دسترسی پوسته را بازنشانی کند.";

$l['theme_info_fetch_error'] = 'خطایی در دریافت اطلاعات سبک رخ داد.';
$l['theme_info_save_error'] = 'خطایی در ذخیره اطلاعات سبک رخ داد.';

$l['saving'] = 'در حال ذخیره‌سازی&hellip;';
