<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['recount_rebuild'] = "بازشماری و بازسازی";
$l['recount_rebuild_desc'] = "در اینجا می‌توانید داده‌ها را بازشماری و بازسازی کنید تا هرگونه خطای همگام‌سازی در انجمن خود را برطرف کنید.";

$l['data_per_page'] = "تعداد ورودی‌های داده در هر صفحه";
$l['recount_stats'] = "بازشماری آمار";
$l['recount_stats_desc'] = "این کار آمار انجمن شما را در صفحات فهرست انجمن و آمار بازشماری و به‌روزرسانی می‌کند.";
$l['recount_reputation'] = "بازشماری اعتبار";
$l['recount_reputation_desc'] = "این کار اعتبار هر کاربر را بازشماری می‌کند.";
$l['recount_warning'] = "بازشماری نقاط اخطار";
$l['recount_warning_desc'] = "این کار نقاط اخطار فعال هر کاربر را بازشماری می‌کند.";
$l['recount_private_messages'] = "بازشماری پیام‌های خصوصی";
$l['recount_private_messages_desc'] = "این تعداد پیام‌های خصوصی هر کاربر را بازشماری می‌کند.";
$l['recount_referrals'] = "بازشماری معرفی‌ها";
$l['recount_referrals_desc'] = "این تعداد معرفی‌های هر کاربر را بازشماری می‌کند.";
$l['recount_thread_ratings'] = "بازشماری رتبه‌بندی موضوعات";
$l['recount_thread_ratings_desc'] = "این رتبه‌بندی هر موضوع را بازشماری می‌کند.";
$l['rebuild_forum_counters'] = "بازسازی شمارنده‌های انجمن";
$l['rebuild_forum_counters_desc'] = "هنگامی که این اجرا می‌شود، شمارنده‌های پست/موضوع و آخرین پست هر انجمن برای نمایش مقادیر صحیح به‌روزرسانی می‌شوند.";
$l['rebuild_thread_counters'] = "بازسازی شمارنده‌های موضوع";
$l['rebuild_thread_counters_desc'] = "هنگامی که این اجرا می‌شود، شمارنده‌های پست/بازدید و آخرین پست هر موضوع به‌روزرسانی می‌شوند تا مقادیر صحیح را منعکس کنند.";
$l['rebuild_poll_counters'] = "بازسازی شمارنده‌های نظرسنجی";
$l['rebuild_poll_counters_desc'] = "هنگامی که این اجرا می‌شود، شمارنده‌های رأی و تعداد کل آرای هر نظرسنجی به‌روزرسانی می‌شوند تا مقادیر صحیح را منعکس کنند.";
$l['recount_user_posts'] = "بازشماری تعداد پست‌های کاربر";
$l['recount_user_posts_desc'] = "هنگامی که این اجرا می‌شود، تعداد پست‌های هر کاربر به‌روزرسانی می‌شود تا مقدار زنده فعلی آن را بر اساس پست‌های موجود در پایگاه داده و انجمن‌هایی که شمارش پست در آنها غیرفعال است، منعکس کند.";
$l['recount_user_threads'] = "شمارش مجدد تعداد موضوعات کاربر";
$l['recount_user_threads_desc'] = "هنگامی که این اجرا می‌شود، تعداد موضوعات برای هر کاربر به‌روزرسانی می‌شود تا منعکس کننده مقدار فعلی آن بر اساس موضوعات موجود در پایگاه داده و انجمن‌هایی باشد که تعداد موضوعات در آنها غیرفعال است.";
$l['rebuild_attachment_thumbs'] = "بازسازی تصاویر کوچک پیوست";
$l['rebuild_attachment_thumbs_desc'] = "این کار تصاویر کوچک پیوست‌ها را بازسازی می‌کند تا اطمینان حاصل شود که از ابعاد عرض و ارتفاع فعلی استفاده می‌کنند و همچنین تصاویر کوچک از دست رفته را نیز بازسازی می‌کند.";

$l['success_rebuilt_forum_counters'] = "شمارنده‌های انجمن با موفقیت بازسازی شدند.";
$l['success_rebuilt_thread_counters'] = "شمارنده‌های موضوع با موفقیت بازسازی شدند.";
$l['success_rebuilt_poll_counters'] = "شمارنده‌های نظرسنجی با موفقیت بازسازی شدند.";
$l['success_rebuilt_user_post_counters'] = "تعداد پست‌های کاربر با موفقیت شمارش شد.";
$l['success_rebuilt_user_thread_counters'] = "تعداد موضوعات کاربر با موفقیت شمارش شد.";
$l['success_rebuilt_attachment_thumbnails'] = "تصویر بندانگشتی پیوست‌ها با موفقیت بازسازی شدند.";
$l['success_rebuilt_forum_stats'] = "آمار انجمن با موفقیت بازسازی شد.";
$l['success_rebuilt_reputation'] = "اعتبار کاربر با موفقیت بازسازی شد.";
$l['success_rebuilt_warning'] = "نقاط اخطار کاربر با موفقیت بازسازی شدند.";
$l['success_rebuilt_private_messages'] = "تعداد پیام‌های خصوصی کاربر با موفقیت شمارش شد.";
$l['success_rebuilt_referral'] = "تعداد معرفی‌های کاربر با موفقیت شمارش شد.";
$l['success_rebuilt_thread_ratings'] = "رتبه‌بندی موضوعات با موفقیت شمارش شد.";

$l['confirm_proceed rebuild'] = "برای ادامه فرآیند بازشماری و بازسازی، روی \"اقدام کردن\" کلیک کنید.";
$l['automatically redirecting'] = "در حال هدایت خودکار &hellip;";

