<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['system_health'] = "سلامت سیستم";
$l['system_health_desc'] = "در اینجا می‌توانید اطلاعات مربوط به سلامت سیستم خود را مشاهده کنید.";
$l['utf8_conversion'] = "تبدیل UTF-8";
$l['utf8_conversion_desc'] = "شما در حال حاضر یک جدول پایگاه داده را به فرمت UTF-8 تبدیل می‌کنید. توجه داشته باشید که این فرآیند ممکن است بسته به اندازه انجمن و این جدول، تا چند ساعت طول بکشد. هنگامی که فرآیند کامل شد، به صفحه اصلی تبدیل UTF-8 بازگردانده خواهید شد.";
$l['utf8_conversion_desc2'] = "این ابزار جداول پایگاه داده را بررسی می‌کند تا مطمئن شود که در فرمت UTF-8 هستند و به شما امکان می‌دهد در صورت عدم بودن، آن‌ها را تبدیل کنید.";

$l['convert_all'] = "تبدیل همه";
$l['converting_to_utf8'] = "MyBB در حال تبدیل جدول \"{1}\" به کدگذاری زبان UTF-8 از کدگذاری {2} است.";
$l['convert_to_utf8'] = "شما در حال تبدیل جدول \"{1}\" به کدگذاری زبان UTF-8 از کدگذاری {2} هستید.";
$l['convert_all_to_utf'] = "شما در حال تبدیل تمام جداول به کدگذاری زبان UTF-8 از کدگذاری {1} هستید.";
$l['convert_all_to_utf8mb4'] = "شما در حال تبدیل تمام جداول به کدگذاری زبان یونیکد 4-Byte UTF-8 از کدگذاری {1} هستید.";
$l['converting_to_utf8mb4'] = "MyBB در حال تبدیل جدول \"{1}\" به کدگذاری زبان یونیکد 4-Byte UTF-8 از کدگذاری {2} است.";
$l['please_wait'] = "لطفاً منتظر بمانید&hellip;";
$l['converting_table'] = "در حال تبدیل جدول: {1}";
$l['convert_table'] = "تبدیل جدول";
$l['convert_tables'] = "تبدیل تمام جداول";
$l['convert_database_table'] = "تبدیل جدول پایگاه داده";
$l['convert_database_tables'] = "تبدیل تمام جداول پایگاه داده";
$l['table'] = "جدول";
$l['status_utf8'] = "وضعیت UTF-8";
$l['status_utf8mb4'] = "پشتیبانی از 4-Byte UTF-8<br />(نیازمند MySQL 5.5.3 یا بالاتر)";
$l['not_available'] = "در دسترس نیست";
$l['all_tables'] = "تمام جداول";
$l['convert_now'] = "تبدیل اکنون";
$l['totals'] = "مجموع‌ها";
$l['attachments'] = "پیوست‌ها";
$l['total_database_size'] = "حجم کل پایگاه داده";
$l['attachment_space_used'] = "فضای استفاده شده پیوست";
$l['total_cache_size'] = "حجم کل حافظه نهان";
$l['estimated_attachment_bandwidth_usage'] = "تخمین استفاده از پهنای باند پیوست";
$l['max_upload_post_size'] = "حداکثر اندازه آپلود / POST";
$l['average_attachment_size'] = "میانگین اندازه پیوست";
$l['stats'] = "آمار";
$l['task'] = "وظیفه";
$l['run_time'] = "زمان اجرا";
$l['next_3_tasks'] = "3 وظیفه بعدی";
$l['no_tasks'] = "در حال حاضر هیچ وظیفه‌ای در حال اجرا نیست.";
$l['backup_time'] = "زمان پشتیبان";
$l['no_backups'] = "در حال حاضر هیچ پشتیبانی ایجاد نشده است.";
$l['existing_db_backups'] = "پشتیبان‌های موجود پایگاه داده";
$l['writable'] = "قابل نوشتن";
$l['not_writable'] = "غیر قابل نوشتن";
$l['please_chmod_777'] = "لطفاً CHMOD را به 777 تغییر دهید.";
$l['chmod_info'] = "لطفاً تنظیمات CHMOD را به موارد مشخص شده با فایل زیر تغییر دهید. برای اطلاعات بیشتر در مورد CHMOD، به";
$l['file'] = "فایل";
$l['location'] = "مکان";
$l['settings_file'] = "فایل تنظیمات";
$l['config_file'] = "فایل پیکربندی";
$l['file_upload_dir'] = "پوشه آپلود فایل";
$l['avatar_upload_dir'] = "پوشه آپلود آواتار";
$l['language_files'] = "فایل‌های زبان";
$l['backup_dir'] = "پوشه پشتیبان‌ها";
$l['cache_dir'] = "پوشه حافظه نهان";
$l['themes_dir'] = "پوشه پوسته‌ها";
$l['chmod_files_and_dirs'] = "فایل‌ها و پوشه‌های CHMOD";

$l['notice_process_long_time'] = "این فرآیند ممکن است بسته به اندازه انجمن و این جدول، تا چند ساعت طول بکشد. <strong>توصیه می‌شود یک پشتیبان از پایگاه داده ایجاد کنید زیرا این فرآیند قابل برگشت نیست.</strong>";
$l['notice_mb4_warning'] = "پشتیبانی 4-Byte UTF-8 نیازمند MySQL 5.5.3 یا بالاتر است. شما نخواهید توانست پایگاه داده خود را روی یک سرور MySQL با نسخه دیگر وارد کنید.";

$l['check_templates'] = "بررسی قالب‌ها";
$l['check_templates_desc'] = "تمام قالب‌های نصب شده را برای مسائل امنیتی شناخته شده بررسی می‌کند.";
$l['check_templates_title'] = "بررسی امنیت قالب";
$l['check_templates_info'] = "این فرآیند قالب‌های شما را در برابر مسائل امنیتی که می‌تواند بر انجمن و سروری که روی آن اجرا می‌شود تأثیر بگذارد، بررسی می‌کند. اگر پوسته‌های زیادی نصب کرده‌اید، این ممکن است مدتی طول بکشد.
<br /><br />برای شروع فرآیند، دکمه 'ادامه' را در زیر فشار دهید.";
$l['check_templates_info_desc'] = "قالب‌های زیر با مسائل امنیتی شناخته شده مطابقت داشتند. لطفاً آن‌ها را بررسی کنید.";
$l['full_edit'] = "ویرایش کامل";

$l['error_chmod'] = "از فایل‌ها و پوشه‌های مورد نیاز تنظیمات CHMOD مناسب را ندارند.";
$l['error_invalid_table'] = "جدول مشخص شده وجود ندارد.";
$l['error_db_encoding_not_set'] = "تنظیمات فعلی MyBB شما هنوز برای استفاده از این ابزار تنظیم نشده است. لطفاً برای اطلاعات بیشتر در مورد نحوه تنظیم آن، <a href=\"https://docs.mybb.com/1.8/administration/utf-8-setup/\">مستندات MyBB</a> را ببینید.";
$l['error_not_supported'] = "موتور پایگاه داده فعلی شما توسط ابزار تبدیل UTF-8 پشتیبانی نمی‌شود.";
$l['error_invalid_input'] = "مشکلی در بررسی قالب‌ها وجود داشت. لطفاً دوباره تلاش کنید یا با گروه MyBB برای پشتیبانی تماس بگیرید.";
$l['error_master_templates_altered'] = "قالب‌های اصلی تغییر یافته‌اند. لطفاً برای راهنمایی در مورد چگونگی تغییر این‌ها با گروه MyBB تماس بگیرید.";
$l['error_utf8mb4_version'] = "نسخه MySQL شما از کدگذاری 4-Byte UTF-8 پشتیبانی نمی‌کند.";

$l['warning_multiple_encodings'] = "توصیه می‌شود از کدگذاری‌های مختلف در پایگاه داده خود استفاده نکنید. این ممکن است باعث رفتار غیرمنتظره یا خطاهای MySQL شود.";
$l['warning_utf8mb4_config'] = "برای پشتیبانی کامل 4-Byte UTF-8، باید <i>\$config['database']['encoding'] = 'utf8';</i> را به <i>\$config['database']['encoding'] = 'utf8mb4';</i> در فایل inc/config.php خود تغییر دهید.";

$l['success_templates_checked'] = "قالب‌ها با موفقیت بررسی شدند - هیچ مشکل امنیتی یافت نشد!";
$l['success_all_tables_already_converted'] = "تمام جداول قبلاً تبدیل شده‌اند یا از قبل در فرمت UTF-8 هستند.";
$l['success_table_converted'] = "جدول انتخاب شده \"{1}\" با موفقیت به UTF-8 تبدیل شد.";
$l['success_chmod'] = "تمام فایل‌ها و پوشه‌های مورد نیاز تنظیمات CHMOD مناسب را دارند.";
