<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 */


$l['spam_logs'] = 'گزارش‌های هرزنامه';
$l['spam_logs_desc'] = 'این بخش به شما امکان می‌دهد سابقه کاربران مسدود شده توسط فیلترهای هرزنامه را مشاهده کنید.';
$l['prune_spam_logs'] = 'حذف گزارش‌های هرزنامه';
$l['prune_spam_logs_desc'] = 'در اینجا می‌توانید گزارش‌های هرزنامه‌ای را که با معیارهای مشخص شده مطابقت دارند، حذف کنید.';
$l['spam_username'] = 'نام کاربری';
$l['spam_email'] = 'آدرس ایمیل';
$l['spam_ip'] = 'آدرس IP';
$l['spam_date'] = 'تاریخ';
$l['spam_confidence'] = 'اعتماد به نفس';
$l['no_spam_logs'] = 'هنوز هیچ کاربری توسط فیلترهای هرزنامه مسدود نشده است.';
$l['success_pruned_spam_logs'] = 'گزارش‌های هرزنامه با موفقیت حذف شدند.';
$l['note_logs_locked'] = 'به دلایل امنیتی، گزارش‌هایی که کمتر از ۲۴ ساعت از تاریخ انتشارشان گذشته باشد، قابل حذف نیستند.';
$l['all_usernames'] = 'همه نام‌‌کاربری‌ها';
$l['all_emails'] = 'همه ایمیل‌ها';
$l['date_range'] = "محدوده تاریخ:";
$l['older_than'] = "قدیمی‌تر از ";
$l['days'] = "روز";
$l['filter_spam_logs'] = 'فیلتر گزارش‌های هرزنامه';
$l['asc'] = "صعودی";
$l['desc'] = "نزولی";
$l['search_ip_on_sfs'] = "جستجوی این IP در جلوگیری از هرزنامه انجمن";
$l['search'] = "جستجو";

$l['in'] = "در";
$l['order'] = "سفارش";
$l['sort_by'] = "مرتب سازی بر اساس";
$l['results_per_page'] = "نتایج بر اساس صفحه";
