<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['task_manager'] = "مدیریت وظایف";
$l['add_new_task'] = "افزودن وظیفه جدید";
$l['add_new_task_desc'] = "در اینجا می‌توانید وظایف زمان‌بندی شده جدیدی ایجاد کنید که به طور خودکار در انجمن شما اجرا می‌شوند.";
$l['edit_task'] = "ویرایش وظیفه";
$l['edit_task_desc'] = "در زیر می‌توانید تنظیمات مختلف این وظیفه زمان‌بندی شده را ویرایش کنید.";
$l['task_logs'] = "گزارش‌های وظایف";
$l['view_task_logs'] = "مشاهده گزارش‌های وظایف";
$l['view_task_logs_desc'] = "هنگامی که یک وظیفه اجرا شده و ثبت‌رویداد فعال باشد، هر گونه نتیجه یا خطا در زیر فهرست خواهد شد. ورودی‌های قدیمی‌تر از 30 روز به طور خودکار حذف می‌شوند.";
$l['scheduled_tasks'] = "وظایف زمان‌بندی شده";
$l['scheduled_tasks_desc'] = "در اینجا می‌توانید وظایفی را که به طور خودکار در انجمن شما اجرا می‌شوند مدیریت کنید. برای اجرای یک وظیفه اکنون، روی آیکن سمت راست وظیفه کلیک کنید.";

$l['title'] = "عنوان";
$l['short_description'] = "شرح کوتاه";
$l['task_file'] = "فایل وظیفه";
$l['task_file_desc'] = "فایل وظیفه‌ای را که می‌خواهید این وظیفه اجرا کند انتخاب کنید.";
$l['time_minutes'] = "زمان: دقیقه";
$l['time_minutes_desc'] = "لیستی از دقیقه‌ها (0-59) را که این وظیفه باید در آن اجرا شود با کاما جدا کنید. اگر این وظیفه باید در هر دقیقه اجرا شود '*' وارد کنید.";
$l['time_hours'] = "زمان: ساعت";
$l['time_hours_desc'] = "لیستی از ساعت‌ها (0-23) را که این وظیفه باید در آن اجرا شود با کاما جدا کنید. اگر این وظیفه باید در هر ساعت اجرا شود '*' وارد کنید.";
$l['time_days_of_month'] = "زمان: روزهای ماه";
$l['time_days_of_month_desc'] = "لیستی از روزها (1-31) را که این وظیفه باید در آن اجرا شود با کاما جدا کنید. اگر این وظیفه باید در هر روز اجرا شود یا می‌خواهید یک روز هفته را در زیر مشخص کنید '*' وارد کنید.";
$l['every_weekday'] = "هر روز هفته";
$l['sunday'] = "یکشنبه";
$l['monday'] = "دوشنبه";
$l['tuesday'] = "سه‌شنبه";
$l['wednesday'] = "چهارشنبه";
$l['thursday'] = "پنجشنبه";
$l['friday'] = "جمعه";
$l['saturday'] = "شنبه";
$l['time_weekdays'] = "زمان: روزهای هفته";
$l['time_weekdays_desc'] = "روزهای هفته‌ای را که این وظیفه باید در آن اجرا شود انتخاب کنید. نگه داشتن CTRL چندین روز هفته را انتخاب می‌کند. اگر می‌خواهید این وظیفه هر روز هفته اجرا شود یا یک روز از پیش تعریف شده در بالا وارد کرده‌اید، 'هر روز هفته' را انتخاب کنید.";
$l['every_month'] = "هر ماه";
$l['time_months'] = "زمان: ماه‌ها";
$l['time_months_desc'] = "ماه‌هایی را که این وظیفه باید در آن اجرا شود انتخاب کنید. نگه داشتن CTRL چندین ماه را انتخاب می‌کند. اگر می‌خواهید این وظیفه هر ماه اجرا شود، 'هر ماه' را انتخاب کنید.";
$l['enabled'] = "وظیفه فعال است؟";
$l['enable_logging'] = "ثبت‌رویداد فعال شود؟";
$l['save_task'] = "ذخیره وظیفه";
$l['task'] = "وظیفه";
$l['date'] = "تاریخ";
$l['data'] = "داده";
$l['no_task_logs'] = "در حال حاضر هیچ گزارشی برای هیچ یک از وظایف زمان‌بندی شده ثبت نشده است.";
$l['next_run'] = "اجرای بعدی";
$l['run_task_now'] = "این وظیفه را اکنون اجرا کن";
$l['disable_task'] = "غیرفعال کردن وظیفه";
$l['run_task'] = "اجرای وظیفه";
$l['enable_task'] = "فعال کردن وظیفه";
$l['delete_task'] = "حذف وظیفه";

$l['error_invalid_task'] = "وظیفه مشخص شده وجود ندارد.";
$l['error_missing_title'] = "شما عنوانی برای این وظیفه زمان‌بندی شده وارد نکرده‌اید";
$l['error_missing_description'] = "شما توضیحی برای این وظیفه زمان‌بندی شده وارد نکرده‌اید";
$l['error_invalid_task_file'] = "فایل وظیفه‌ای که انتخاب کرده‌اید وجود ندارد.";
$l['error_invalid_minute'] = "دقیقه‌ای که وارد کرده‌اید نامعتبر است.";
$l['error_invalid_hour'] = "ساعتی که وارد کرده‌اید نامعتبر است.";
$l['error_invalid_day'] = "روزی که وارد کرده‌اید نامعتبر است.";
$l['error_invalid_weekday'] = "روز هفته‌ای که انتخاب کرده‌اید نامعتبر است.";
$l['error_invalid_month'] = "ماهی که انتخاب کرده‌اید نامعتبر است.";

$l['success_task_created'] = "وظیفه با موفقیت ایجاد شد.";
$l['success_task_updated'] = "وظیفه انتخاب شده با موفقیت به‌روز شد.";
$l['success_task_deleted'] = "وظیفه انتخاب شده با موفقیت حذف شد.";
$l['success_task_enabled'] = "وظیفه انتخاب شده با موفقیت فعال شد.";
$l['success_task_disabled'] = "وظیفه انتخاب شده با موفقیت غیرفعال شد.";
$l['success_task_run'] = "وظیفه انتخاب شده با موفقیت اجرا شد.";

$l['confirm_task_deletion'] = "آیا مطمئن هستید که می‌خواهید این وظیفه زمان‌بندی شده را حذف کنید؟";
$l['confirm_task_enable'] = "<strong>هشدار:</strong> شما در حال فعال کردن یک وظیفه هستید که فقط قرار است از طریق cron اجرا شود (لطفاً برای اطلاعات بیشتر <a href=\"https://docs.mybb.com/1.8/administration/task-manager\" target=\"_blank\" rel=\"noopener\">مستندات MyBB</a> را ببینید). ادامه دهید؟";
$l['no_tasks'] = "در حال حاضر هیچ وظیفه‌ای در انجمن شما وجود ندارد.";
