<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['cache'] = "حافظه پنهان:";
$l['cache_manager'] = "مدیر حافظه پنهان";
$l['cache_manager_description'] = "در اینجا می‌توانید حافظه‌های پنهانی را که به عنوان روشی برای بهینه‌سازی MyBB استفاده می‌شوند، مدیریت کنید. بازسازی یک حافظه پنهان، تمام داده‌های لازم برای ایجاد حافظه پنهان را گرفته و آن را دوباره همگام‌سازی می‌کند. بارگذاری مجدد یک حافظه پنهان، آن را در کنترل‌کننده حافظه پنهان انتخاب شده (دیسک، eaccelerator، memcache و غیره) بارگذاری مجدد می‌کند. بارگذاری مجدد هنگام تغییر از پایگاه داده یا سیستم فایل به xcache، eaccelerator یا یک کنترل‌کننده حافظه پنهان دیگر مفید است.";
$l['rebuild_cache'] = "بازسازی حافظه پنهان";
$l['reload_cache'] = "بارگیری حافظه پنهان";
$l['rebuild_reload_all'] = "(بازسازی و بارگذاری مجدد همه)";

$l['error_cannot_rebuild'] = "این حافظه پنهان قابل بازسازی نیست.";
$l['error_empty_cache'] = "حافظه پنهان خالی است.";
$l['error_incorrect_cache'] = "حافظه پنهان نادرست مشخص شده است.";
$l['error_no_cache_specified'] = "شما حافظه پنهانی را برای مشاهده مشخص نکردید.";

$l['success_cache_rebuilt'] = "حافظه پنهان با موفقیت بازسازی شد.";
$l['success_cache_reloaded'] = "حافظه پنهان با موفقیت بارگذاری مجدد شد.";

