<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['user_group_promotions'] = "ترفیع‌های گروه کاربری";
$l['user_group_promotions_desc'] = "در اینجا می‌توانید ترفیع‌های گروه کاربری را مدیریت کنید.";
$l['edit_promotion'] = "ویرایش ترفیع";
$l['edit_promotion_desc'] = "در اینجا می‌توانید ترفیع‌هایی را که به طور خودکار در انجمن شما اجرا می‌شوند ویرایش کنید.";
$l['add_new_promotion'] = "افزودن ترفیع جدید";
$l['add_new_promotion_desc'] = "در اینجا می‌توانید ترفیع‌های جدیدی ایجاد کنید که به طور خودکار در انجمن شما اجرا می‌شوند.";

$l['title'] = "عنوان";
$l['short_desc'] = "شرح کوتاه";
$l['post_count'] = "تعداد پست";
$l['thread_count'] = "تعداد موضوع";
$l['reputation'] = "اعتبار";
$l['referrals'] = "معرفی‌ها";
$l['time_registered'] = "زمان ثبت‌نام";
$l['time_online'] = "زمان آنلاین";
$l['promo_requirements'] = "الزامات ترفیع";
$l['promo_requirements_desc'] = "انتخاب کنید کدام معیارها باید برای این ترفیع برآورده شوند. نگه داشتن CTRL چندین معیار را انتخاب می‌کند.";
$l['greater_than_or_equal_to'] = "بزرگتر یا مساوی با";
$l['greater_than'] = "بزرگتر از";
$l['equal_to'] = "مساوی با";
$l['less_than_or_equal_to'] = "کوچکتر یا مساوی با";
$l['less_than'] = "کوچکتر از";
$l['reputation_count'] = "تعداد اعتبار";
$l['reputation_count_desc'] = "مقدار اعتبار مورد نیاز را وارد کنید. اعتبار باید به عنوان یک مقدار الزامی انتخاب شده باشد تا این مورد لحاظ شود. نوع مقایسه برای اعتبار را انتخاب کنید.";
$l['referral_count'] = "تعداد معرفی‌";
$l['referral_count_desc'] = "تعداد معرفی‌های مورد نیاز را وارد کنید. تعداد معرفی باید به عنوان یک مقدار الزامی انتخاب شده باشد تا این مورد لحاظ شود. نوع مقایسه برای معرفی‌ها را انتخاب کنید.";
$l['warning_points'] = "نقاط اخطار";
$l['warning_points_desc'] = "تعداد نقاط اخطار مورد نیاز را وارد کنید. نقاط اخطار باید به عنوان یک مقدار الزامی انتخاب شده باشد تا این مورد لحاظ شود. نوع مقایسه برای نقاط اخطار را انتخاب کنید.";
$l['post_count_desc'] = "تعداد پست‌های مورد نیاز را وارد کنید. تعداد پست باید به عنوان یک مقدار الزامی انتخاب شده باشد تا این مورد لحاظ شود. نوع مقایسه برای پست‌ها را انتخاب کنید.";
$l['thread_count_desc'] = "تعداد موضوع‌های مورد نیاز را وارد کنید. تعداد موضوع باید به عنوان یک مقدار الزامی انتخاب شده باشد تا این مورد لحاظ شود. نوع مقایسه برای موضوع‌ها را انتخاب کنید.";
$l['hours'] = "ساعت";
$l['days'] = "روز";
$l['weeks'] = "هفته";
$l['months'] = "ماه";
$l['years'] = "سال";
$l['time_registered_desc'] = "تعداد ساعت، روز، هفته، ماه یا سالی را که این کاربر باید ثبت‌نام کرده باشد وارد کنید. زمان ثبت‌نام باید به عنوان یک مقدار الزامی انتخاب شده باشد تا این گنجانده شود. انتخاب کنید که زمان ثبت‌نام باید بر حسب ساعت، روز، هفته، ماه یا سال شمارش شود.";
$l['time_online_desc'] = "تعداد ساعت، روز، هفته، ماه یا سالی را که این کاربر باید آنلاین بوده باشد وارد کنید. زمان آنلاین باید به عنوان یک مقدار الزامی انتخاب شده باشد تا این گنجانده شود. انتخاب کنید که زمان صرف شده آنلاین باید بر حسب ساعت، روز، هفته، ماه یا سال شمارش شود.";
$l['all_user_groups'] = 'همه گروه‌های کاربری';
$l['orig_user_group'] = 'گروه کاربری اصلی';
$l['orig_user_group_desc'] = "انتخاب کنید کاربر باید در کدام گروه کاربری یا گروه‌های کاربری باشد تا ترفیع اجرا شود. نگه داشتن CTRL چندین گروه را انتخاب می‌کند.";
$l['new_user_group'] = 'گروه کاربری جدید';
$l['new_user_group_desc'] = "گروه کاربری که کاربر پس از این ترفیع به آن منتقل خواهد شد را انتخاب کنید.";
$l['primary_user_group'] = 'گروه کاربری اصلی';
$l['secondary_user_group'] = 'گروه کاربری ثانویه';
$l['user_group_change_type'] = 'نوع تغییر گروه کاربری';
$l['user_group_change_type_desc'] = "اگر کاربر باید گروه کاربری اصلی خود را به گروه کاربری جدید تغییر دهد 'گروه کاربری اصلی' را انتخاب کنید. اگر کاربر باید گروه کاربری جدید را به عنوان یک گروه کاربری ثانویه به پروفایل خود اضافه کند 'گروه کاربری ثانویه' را انتخاب کنید.";
$l['enabled'] = "فعال است؟";
$l['enable_logging'] = "ثبت‌رویداد فعال شود؟";
$l['promotion_logs'] = "گزارش‌های ترفیع";
$l['view_promotion_logs'] = "مشاهده گزارش‌های ترفیع";
$l['view_promotion_logs_desc'] = 'در اینجا می‌توانید گزارش‌های ترفیع‌هایی که قبلاً اجرا شده‌اند را مشاهده کنید.';
$l['promoted_user'] = "کاربر ترفیع یافته";
$l['time_promoted'] = "زمان ترفیع";
$l['no_promotion_logs'] = "در حال حاضر هیچ ترفیعی ثبت نشده است.";
$l['promotion_manager'] = "مدیر ترفیع‌ها";
$l['promotion'] = "ترفیع";
$l['disable_promotion'] = "غیرفعال کردن ترفیع";
$l['enable_promotion'] = "فعال کردن ترفیع";
$l['delete_promotion'] = "حذف ترفیع";
$l['no_promotions_set'] = "در حال حاضر هیچ ترفیعی تنظیم نشده است.";
$l['update_promotion'] = "ذخیره ترفیع";
$l['multiple_usergroups'] = "چندین گروه کاربری";
$l['secondary'] = "ثانویه";
$l['primary'] = "اصلی";

$l['error_no_promo_id'] = 'شما شناسه ترفیعی وارد نکرده‌اید';
$l['error_invalid_promo_id'] = 'شما یک شناسه ترفیع معتبر وارد نکرده‌اید';

$l['error_no_title'] = "شما عنوانی برای این ترفیع وارد نکرده‌اید";
$l['error_no_desc'] = "شما توضیحی برای این ترفیع وارد نکرده‌اید";
$l['error_no_requirements'] = "شما حداقل یک الزام برای این ترفیع انتخاب نکرده‌اید";
$l['error_no_orig_usergroup'] = "شما حداقل یک گروه کاربری اصلی برای این ترفیع انتخاب نکرده‌اید";
$l['error_no_new_usergroup'] = "شما حداقل یک گروه کاربری جدید برای این ترفیع انتخاب نکرده‌اید";
$l['error_no_usergroup_change_type'] = "شما حداقل یک نوع تغییر گروه کاربری برای این ترفیع انتخاب نکرده‌اید";

$l['success_promo_disabled'] = 'ترفیع گروه انتخاب شده با موفقیت غیرفعال شد.';
$l['success_promo_deleted'] = 'ترفیع گروه انتخاب شده با موفقیت حذف شد.';
$l['success_promo_enabled'] = 'ترفیع گروه انتخاب شده با موفقیت فعال شد.';
$l['success_promo_updated'] = 'ترفیع گروه انتخاب شده با موفقیت به‌روز شد.';
$l['success_promo_added'] = 'ترفیع با موفقیت ایجاد شد.';

$l['confirm_promo_disable'] = "آیا مطمئن هستید که می‌خواهید این ترفیع را غیرفعال کنید؟";
$l['confirm_promo_deletion'] = "آیا مطمئن هستید که می‌خواهید این ترفیع را حذف کنید؟";
