<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['user_titles'] = "عناوین کاربر";
$l['user_titles_desc'] = "این بخش امکان مدیریت عناوین کاربر را فراهم می‌کند. عناوین کاربر بر اساس تعداد پست‌هایی که کاربران ایجاد می‌کنند به آنها اختصاص داده می‌شود و همچنین امکان نمایش تصویر 'ستاره' سفارشی بر اساس تعداد پست‌هایی که کاربر دارد را فراهم می‌کند.";
$l['add_new_user_title'] = "افزودن عنوان کاربر جدید";
$l['add_new_user_title_desc'] = "این بخش به شما امکان می‌دهد عنوان کاربر جدیدی اضافه کنید. <i>توجه: این <strong>سیستم <u><a href=\"index.php?module=user-group_promotions\">ترفیع نیست.</a></u></i>";

$l['error_missing_title'] = "شما عنوانی برای این عنوان کاربر وارد نکردید";
$l['error_missing_posts'] = "شما حداقل تعداد پست‌ها را برای این عنوان کاربری وارد نکردید";
$l['error_cannot_have_same_posts'] = "این عنوان کاربری نمی‌تواند حداقل تعداد پست‌های یکسانی با عنوان دیگری داشته باشد";
$l['error_invalid_user_title'] = "شما یک عنوان کاربری نامعتبر مشخص کرده‌اید";

$l['success_user_title_created'] = "عنوان کاربری جدید با موفقیت ایجاد شد.";
$l['success_user_title_updated'] = "عنوان کاربری با موفقیت به‌روزرسانی شد.";
$l['success_user_title_deleted'] = "عنوان کاربری مشخص شده با موفقیت حذف شد.";

$l['title_to_assign'] = "عنوان برای اختصاص دادن";
$l['title_to_assign_desc'] = "این عنوان برای کاربرانی که عنوان سفارشی ندارند، زیر نامشان نمایش داده می‌شود.";
$l['minimum_posts'] = "حداقل پست‌ها";
$l['minimum_posts_desc'] = "حداقل تعداد پست‌هایی که یک کاربر باید داشته باشد تا این عنوان کاربری به او اختصاص داده شود.";
$l['number_of_stars'] = "تعداد ستاره‌ها";
$l['number_of_stars_desc'] = "تعداد ستاره‌هایی که باید زیر این عنوان کاربری نمایش داده شوند را وارد کنید. برای نمایش ندادن ستاره‌ها، عدد 0 را وارد کنید.";
$l['star_image'] = "تصویر ستاره";
$l['star_image_desc'] = "اگر این عنوان کاربری باید ستاره داشته باشد، مسیر تصویر ستاره را اینجا وارد کنید. اگر خالی باشد، تصویر ستاره گروه کاربری نمایش داده خواهد شد. از {theme} برای مشخص کردن دایرکتوری تصویر برای قالب فعلی بینندگان استفاده کنید.";
$l['save_user_title'] = "ذخیره عنوان کاربر";
$l['edit_user_title'] = "ویرایش عنوان کاربر";
$l['edit_user_title_desc'] = "این بخش به شما امکان ویرایش عنوان کاربر را می‌دهد.";
$l['user_title_deletion_confirmation'] = "آیا مطمئن هستید که می‌خواهید این عنوان کاربر را حذف کنید؟";
$l['manage_user_titles'] = "مدیریت عنوان‌های کاربر";
$l['user_titles'] = "عنوان کاربر";
$l['no_user_titles'] = "در حال حاضر هیچ عنوان کاربری تعریف نشده است";

