<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['admin_permissions'] = "مجوزهای مدیرکل";
$l['user_permissions'] = "مجوزهای کاربر";
$l['user_permissions_desc'] = "در اینجا می‌توانید مجوزهای مدیرکل را برای کاربران بصورت منحصربفرد مدیریت کنید. این به طور مؤثر به شما امکان می‌دهد برخی مدیران‌کل را از دسترسی به بخش‌های مختلف کنترل‌پنل مدیرکل قفل کنید.";
$l['group_permissions'] = "مجوزهای گروه";
$l['group_permissions_desc'] = "مجوزهای مدیریت‌کلی همچنین می‌توانند برای گروه‌های کاربری که اجازه دسترسی به پنل مدیرکل را دارند، اعمال شوند. به طور مشابه، می‌توانید از این ابزار برای قفل کردن دسترسی تمام گروه‌های مدیریتی به قسمت‌های مختلف پنل‌مدیریت‌کل استفاده کنید.";
$l['default_permissions'] = "مجوزهای پیش‌فرض";
$l['default_permissions_desc'] = "مجوزهای مدیریتی پیش‌فرض، مجوزهایی هستند که به کاربرانی اعمال می‌شوند که مجوزهای مدیریتی سفارشی برای آنها تعیین نشده است یا مجوزهای مدیریتی گروه را به ارث نمی‌برند.";

$l['admin_permissions_updated'] = "مجوزهای مدیر با موفقیت به‌روز شدند.";
$l['revoke_permissions'] = "لغو مجوزها";
$l['edit_permissions'] = "ویرایش مجوزها";
$l['set_permissions'] = "تنظیم مجوزها";
$l['edit_permissions_desc'] = "در اینجا می‌توانید دسترسی به کل تب‌ها یا صفحات منحصربفرد را محدود کنید. توجه داشته باشید که تب \"خانه\" برای تمام مدیران قابل دسترسی است.";
$l['update_permissions'] = "به‌روزرسانی مجوزها";
$l['view_log'] = "مشاهده گزارش";
$l['permissions_type_group'] = "نوع مجوز گروه";
$l['permissions_type_user'] = "نوع مجوز کاربر";
$l['no_group_perms'] = "در حال حاضر هیچ مجوز گروهی تنظیم نشده است.";
$l['no_user_perms'] = "در حال حاضر هیچ مجوز کاربری تنظیم نشده است.";
$l['edit_user'] = "ویرایش پروفایل کاربر";
$l['using_individual_perms'] = "استفاده از مجوزهای منحصربفرد";
$l['using_custom_perms'] = "استفاده از مجوزهای سفارشی";
$l['using_group_perms'] = "استفاده از مجوزهای گروه";
$l['using_default_perms'] = "استفاده از مجوزهای پیش‌فرض";
$l['last_active'] = "آخرین فعالیت";
$l['user'] = "کاربر";
$l['edit_group'] = "ویرایش گروه";
$l['default'] = "پیش‌فرض";
$l['group'] = "گروه";

$l['error_super_admin'] = 'متأسفانه، شما نمی‌توانید این عمل را روی کاربر مشخص شده انجام دهید زیرا او یک super administrator هست.';
$l['error_delete_no_uid'] = 'شما یک شناسه مجوز کاربر/گروه کاربری مدیر وارد نکرده‌اید';
$l['error_delete_invalid_uid'] = 'شما یک شناسه مجوز کاربر/گروه کاربری مدیر معتبر وارد نکرده‌اید';

$l['success_perms_deleted'] = 'مجوزهای کاربر/گروه کاربری مدیر با موفقیت لغو شد.';

$l['confirm_perms_deletion'] = "آیا مطمئن هستید که می‌خواهید این مجوزهای کاربر/گروه کاربری مدیر را لغو کنید؟";
$l['confirm_perms_deletion2'] = "آیا مطمئن هستید که می‌خواهید مجوزهای این کاربر را لغو کنید؟";
$l['confirm_perms_deletion3'] = "آیا مطمئن هستید که می‌خواهید مجوزهای این گروه را لغو کنید؟";
