<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

// Tabs
$l['banning'] = "مسدودسازی";
$l['banned_accounts'] = "حساب‌های مسدود شده";
$l['banned_accounts_desc'] = "در اینجا می‌توانید حساب‌های کاربری را که از دسترسی به انجمن مسدود شده‌اند مدیریت کنید.";
$l['ban_a_user'] = "مسدود کردن یک کاربر";
$l['ban_a_user_desc'] = "در اینجا می‌توانید یک کاربر را مسدود کنید.";
$l['edit_ban'] = "ویرایش مسدودیت";
$l['edit_ban_desc'] = "در اینجا می‌توانید دلیل و مدت زمان کاربران در حال حاضر مسدود شده را ویرایش کنید.";
$l['banned_ips'] = "IPهای مسدود شده";
$l['disallowed_usernames'] = "نام‌های کاربری غیرمجاز";
$l['disallowed_email_addresses'] = "آدرس‌های ایمیل غیرمجاز";

// Errors
$l['error_invalid_ban'] = "شما یک مسدودیت نامعتبر برای ویرایش انتخاب کرده‌اید.";
$l['error_invalid_username'] = "نام کاربری که وارد کرده‌اید نامعتبر است و وجود ندارد.";
$l['error_no_perm_to_ban'] = "شما مجوز مسدود کردن این کاربر را ندارید.";
$l['error_already_banned'] = "این کاربر از قبل متعلق به یک گروه مسدود شده است و نمی‌تواند به یک گروه جدید اضافه شود.";
$l['error_ban_self'] = "شما نمی‌توانید خودتان را مسدود کنید.";
$l['error_no_reason'] = "شما دلیلی برای مسدود کردن این کاربر وارد نکرده‌اید.";

// Success
$l['success_ban_lifted'] = "مسدودیت انتخاب شده با موفقیت لغو شد.";
$l['success_banned'] = "کاربر انتخاب شده با موفقیت مسدود شد.";
$l['success_ban_updated'] = "مسدودیت انتخاب شده با موفقیت به‌روز شد.";
$l['success_pruned'] = "پست‌ها و موضوع‌های کاربر انتخاب شده با موفقیت هرس شدند.";

// Confirm
$l['confirm_lift_ban'] = "آیا مطمئن هستید که می‌خواهید این مسدودیت را لغو کنید؟";
$l['confirm_prune'] = "آیا مطمئن هستید که می‌خواهید تمام موضوع‌ها و پست‌های ایجاد شده توسط این کاربر را هرس کنید؟";

//== Pages
//= Add / Edit
$l['ban_username'] = "نام کاربری <em>*</em>";
$l['autocomplete_enabled'] = "تکمیل خودکار در این فیلد فعال است.";
$l['ban_reason'] = "دلیل مسدودیت";
$l['ban_group'] = "گروه مسدود شده <em>*</em>";
$l['ban_group_desc'] = "برای اینکه این کاربر مسدود شود، باید به یک گروه مسدود شده منتقل شود.";
$l['ban_time'] = "مدت مسدودیت <em>*</em>";

//= Index
$l['user'] = "کاربر";
$l['moderation'] = "مدیریت";
$l['ban_lifts_on'] = "مسدودیت در تاریخ لغو می‌شود";
$l['time_left'] = "زمان باقی‌مانده";
$l['permenantly'] = "دائمی";
$l['na'] = "N/A";
$l['for'] = "برای";
$l['bannedby_x_on_x'] = "<strong>{1}</strong><br /><small>مسدود شده توسط {2} در {3} {4}</small>";
$l['lift'] = "لغو";
$l['no_banned_users'] = "شما در حال حاضر هیچ کاربر مسدود شده‌ای ندارید.";
$l['prune_threads_and_posts'] = "هرس موضوع‌ها و پست‌ها";

// Buttons
$l['ban_user'] = "مسدود کردن کاربر";
$l['update_ban'] = "به‌روزرسانی مسدودیت";
