<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['contact'] = 'تماس با ما';
$l['contact_no_message'] = 'شما پیامی برای ارسال ارائه نکرده‌اید.';
$l['contact_no_subject'] = 'وارد کردن موضوع الزامی است.';
$l['contact_no_email'] = 'شما باید یک آدرس ایمیل معتبر وارد کنید.';
$l['contact_success_message'] = 'پیام شما با موفقیت به مدیر ارسال شد.';
$l['contact_subject'] = 'موضوع';
$l['contact_subject_desc'] = 'موضوع پیام خود را مختصر بیان کنید.';
$l['contact_message'] = 'پیام';
$l['contact_message_desc'] = 'نگرانی خود را در این زمینه با جزئیات شرح دهید.';
$l['contact_email'] = 'ایمیل';
$l['contact_email_desc'] = 'ایمیل خود را وارد کنید تا بتوانیم با شما تماس بگیریم.';
$l['contact_send'] = 'ارسال';
$l['subject_too_long'] = 'موضوع خیلی طولانی است. لطفاً موضوعی کوتاه‌تر از {1} کاراکتر (در حال حاضر {2}) وارد کنید..';
$l['message_too_short'] = 'پیام خیلی کوتاه است. لطفاً پیامی طولانی‌تر از {1} کاراکتر (در حال حاضر {2}) وارد کنید..';
$l['message_too_long'] = 'پیام خیلی طولانی است. لطفاً پیامی کوتاه‌تر از {1} کاراکتر (در حال حاضر {2}) وارد کنید..';

$l['error_stop_forum_spam_spammer'] = 'متاسفیم، {1} با یک اسپمر شناخته شده مطابقت دارد و بنابراین ارسال اطلاعات تماس شما مسدود شده است.';
$l['error_stop_forum_spam_fetching'] = 'متاسفیم، هنگام تأیید پیام شما در پایگاه داده اسپمرها، مشکلی پیش آمد. به احتمال زیاد دسترسی به پایگاه داده امکان‌پذیر نیست. لطفاً بعداً دوباره امتحان کنید.';

