<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['eventdata_missing_name'] = 'نام رویداد وارد نشده است. لطفاً نام رویداد را وارد کنید.';
$l['eventdata_missing_description'] = 'توضیحات رویداد وارد نشده است. لطفاً توضیحات رویداد را وارد کنید.';

$l['eventdata_invalid_start_date'] = 'تاریخ شروع رویدادی که وارد کرده‌اید نامعتبر است. باید مطمئن شوید که روز، ماه و سال را مشخص کرده‌اید و همچنین مطمئن شوید که روزی که وارد کرده‌اید برای ماه خاص معتبر است.';
$l['eventdata_invalid_start_year'] = "رویدادها فقط می‌توانند در ۵ سال آینده ایجاد شوند. لطفاً یک سال شروع معقول را از لیست انتخاب کنید.";
$l['eventdata_invalid_start_month'] = 'ماه شروعی که وارد کرده‌اید، ماه معتبری نیست. لطفاً یک ماه شروع معتبر وارد کنید.';

$l['eventdata_invalid_end_date'] = 'تاریخ پایان رویدادی که وارد کرده‌اید نامعتبر است. باید مطمئن شوید که روز، ماه و سال را مشخص کرده‌اید و همچنین مطمئن شوید که روزی که وارد کرده‌اید برای ماه خاص معتبر است.';
$l['eventdata_invalid_end_year'] = "رویدادها فقط می‌توانند در ۵ سال آینده ایجاد شوند. لطفاً یک سال پایان معقول را از لیست انتخاب کنید.";
$l['eventdata_invalid_end_month'] = 'ماه پایانی که وارد کرده‌اید، ماه معتبری نیست. لطفاً یک ماه پایان معتبر وارد کنید.';
$l['eventdata_invalid_end_day'] = 'روز پایانی که وارد کرده‌اید، معتبر نیست. احتمالاً روزی که انتخاب کرده‌اید از تعداد روزهای این ماه بیشتر است.';

$l['eventdata_cant_specify_one_time'] = "اگر زمان شروع رویداد را مشخص می‌کنید، باید زمان پایان رویداد را نیز وارد کنید.";
$l['eventdata_start_time_invalid'] = "زمان شروع وارد شده نامعتبر است. مثال‌های معتبر عبارتند از 12 بامداد، 12:01 بامداد، 00:01.";
$l['eventdata_end_time_invalid'] = "زمان پایان وارد شده نامعتبر است. مثال‌های معتبر عبارتند از 12 بامداد، 12:01 بامداد، 00:01.";
$l['eventdata_invalid_timezone'] = "منطقه زمانی که برای این رویداد انتخاب کرده‌اید نامعتبر است.";
$l['eventdata_end_in_past'] = "تاریخ یا زمان پایان رویداد شما قبل از تاریخ یا زمان شروع است.";

$l['eventdata_only_ranged_events_repeat'] = "فقط رویدادهای محدوده‌ای (رویدادهایی با تاریخ شروع و پایان) می‌توانند تکرار شوند.";
$l['eventdata_invalid_repeat_day_interval'] = "شما یک بازه تکرار روز نامعتبر وارد کرده‌اید.";
$l['eventdata_invalid_repeat_week_interval'] = "شما یک بازه تکرار هفته نامعتبر وارد کرده‌اید.";
$l['eventdata_invalid_repeat_weekly_days'] = "شما هیچ روزی را برای وقوع این رویداد انتخاب نکرده‌اید.";
$l['eventdata_invalid_repeat_month_interval'] = "شما یک بازه تکرار ماه نامعتبر وارد کرده‌اید.";
$l['eventdata_invalid_repeat_year_interval'] = "شما یک بازه تکرار سال نامعتبر وارد کرده‌اید.";
$l['eventdata_event_wont_occur'] = "شروع و پایان رویداد را مطابق تنظیمات وارد کنید. در غیر این صورت رویداد به وجود نخواهد آمد.";

$l['eventdata_no_permission_private_event'] = "شما اجازه ارسال رویدادهای خصوصی را ندارید.";
