<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['postdata_invalid_user_id'] = 'شناسه کاربری وجود ندارد. لطفاً یک شناسه کاربری معتبر وارد کنید.';
$l['postdata_firstpost_no_subject'] = 'موضوع موضوع مشخص نیست. لطفاً یک موضوع وارد کنید.';
$l['postdata_missing_subject'] = 'موضوع مشخص نیست. لطفاً یک موضوع وارد کنید.';
$l['postdata_missing_message'] = 'پیام مشخص نیست. لطفاً یک پیام وارد کنید.';
$l['postdata_message_too_long'] = 'پیام خیلی طولانی است. لطفاً یک پیام کوتاه‌تر از {1} کاراکتر (در حال حاضر {2}) وارد کنید.';
$l['postdata_message_too_short'] = 'پیام خیلی کوتاه است. لطفاً یک پیام طولانی‌تر از {1} کاراکتر وارد کنید.';
$l['postdata_subject_too_long'] = 'موضوع خیلی طولانی است. لطفاً موضوعی کوتاه‌تر از 85 کاراکتر (در حال حاضر {1}) وارد کنید.';
$l['postdata_banned_username'] = 'نام کاربری که وارد کرده‌اید ممکن است ثبت نشده باشد. لطفاً نام کاربری دیگری وارد کنید.';
$l['postdata_bad_characters_username'] = 'نام کاربری که وارد کرده‌اید حاوی کاراکترهای نامناسب است. لطفاً نام کاربری دیگری وارد کنید.';
$l['postdata_invalid_username_length'] = 'نام کاربری که وارد کرده‌اید طول نامعتبری دارد. لطفاً نام کاربری بین {1} و {2} کاراکتر وارد کنید.';
$l['postdata_username_exists'] = 'نام کاربری که وارد کرده‌اید از قبل وجود دارد. لطفاً نام کاربری دیگری وارد کنید.';
$l['postdata_post_flooding'] = 'شما سعی می‌کنید خیلی سریع پس از ارسال پیام قبلی، پیام دیگری ارسال کنید. لطفاً {1} ثانیه دیگر صبر کنید.';
$l['postdata_post_flooding_one_second'] = 'شما سعی دارید خیلی سریع بعد از ارسال پیام قبلی، پیام دیگری ارسال کنید. لطفاً ۱ ثانیه دیگر صبر کنید.';
$l['postdata_too_many_images'] = 'پیامی که وارد کردید حاوی {1} تصویر بود، در حالی که فقط {2} تصویر در هر پیام مجاز است. لطفاً تعداد تصاویر را در پیام خود کاهش دهید تا به حد مجاز برسید.';
$l['postdata_too_many_videos'] = 'پیامی که وارد کردید حاوی {1} ویدیو بود، در حالی که فقط {2} ویدیو در هر پیام مجاز است. لطفاً تعداد ویدیوهای پیام خود را کاهش دهید تا به حد مجاز برسید.';
$l['postdata_invalid_prefix'] = 'پیشوند انتخاب شده نامعتبر است. لطفاً یک پیشوند معتبر انتخاب کنید.';
$l['postdata_require_prefix'] = 'این انجمن نیاز به تنظیم پیشوند موضوع دارد. لطفاً یک پیشوند معتبر انتخاب کنید.';

$l['thread_closed'] = "موضوع بسته شد";
$l['thread_opened'] = "موضوع باز شد";
$l['thread_stuck'] = "موضوع گیر کرده";
$l['thread_unstuck'] = "موضوع از حالت گیر کرده خارج شد";

