<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['pmdata_too_long_subject'] = 'موضوع پیام خصوصی شما خیلی طولانی است. لطفاً یک موضوع کوتاه‌تر وارد کنید.';
$l['pmdata_code_no_subject'] = '[بدون موضوع]';
$l['pmdata_missing_subject'] = 'شما موضوعی برای پیام خود وارد نکردید. لطفاً یک موضوع وارد کنید.';
$l['pmdata_missing_message'] = 'شما پیامی برای ارسال وارد نکردید. لطفاً یک پیام وارد کنید.';
$l['pmdata_message_too_long'] = 'پیام خیلی طولانی است. لطفاً پیامی کوتاه‌تر از {1} کاراکتر (در حال حاضر {2}) وارد کنید.';
$l['pmdata_invalid_recipients'] = "یک یا چند گیرنده که مشخص کرده‌اید نام کاربری ثبت نشده‌اند. گیرندگان نامعتبر: {1}";
$l['pmdata_no_recipients'] = "شما هیچ گیرنده‌ای برای ارسال این پیام وارد نکردید. شما باید حداقل یک نام کاربری را در فیلد 'گیرنده' وارد کنید.";
$l['pmdata_too_many_recipients'] = "شما فقط مجاز به ارسال پیام به {1} کاربر در یک زمان هستید.";
$l['pmdata_recipient_is_ignoring'] = "شما نمی‌توانید به {1} پیام ارسال کنید زیرا در لیست نادیده گرفته شده آنها هستید.";
$l['pmdata_recipient_has_buddy_only'] = "شما نمی‌توانید به {1} پیام ارسال کنید زیرا در لیست دوستان آنها نیستید.";
$l['pmdata_recipient_pms_disabled'] = '{1} پیام خصوصی را غیرفعال کرده است. شما نمی‌توانید به این کاربر پیام خصوصی ارسال کنید.';
$l['pmdata_recipient_reached_quota'] = '{1} به سهمیه پیام خصوصی خود رسیده است، بنابراین پیام شما ارسال نشد.';

$l['pmdata_pm_flooding'] = 'شما پس از ارسال پیام قبلی، سعی در ارسال سریع پیام دارید. لطفاً {1} ثانیه دیگر صبر کنید.';
$l['pmdata_pm_flooding_one_second'] = 'شما پس از ارسال پیام قبلی، سعی در ارسال سریع پیام دارید. لطفاً 1 ثانیه دیگر صبر کنید.';
