<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['userdata_missing_username'] = 'شما نام کاربری وارد نکردید. لطفاً نامی وارد کنید.';
$l['userdata_banned_username'] = 'نام کاربری که وارد کرده‌اید قابل ثبت نیست. لطفاً نام کاربری دیگری وارد کنید.';
$l['userdata_bad_characters_username'] = 'نام کاربری که وارد کرده‌اید حاوی کاراکترهای نامناسب است. لطفاً نام کاربری دیگری وارد کنید.';
$l['userdata_invalid_username_length'] = 'نام کاربری که وارد کرده‌اید طول نامعتبر دارد. لطفاً نام کاربری بین {1} و {2} کاراکتر وارد کنید.';
$l['userdata_invalid_usertitle_length'] = 'عنوان کاربری سفارشی که وارد کرده‌اید طول نامعتبر دارد. لطفاً عنوانی وارد کنید که بیش از {1} کاراکتر نباشد.';
$l['userdata_username_exists'] = 'نام کاربری که وارد کرده‌اید از قبل وجود دارد. لطفاً نام کاربری دیگری وارد کنید.';

$l['userdata_invalid_password_length'] = 'رمز عبوری که وارد کرده‌اید طول نامعتبری دارد. لطفاً رمز عبوری بین {1} و {2} کاراکتر وارد کنید.';
$l['userdata_no_complex_characters'] = 'رمز عبوری که وارد کرده‌اید به اندازه کافی پیچیده نیست. لطفاً رمز عبوری وارد کنید که حداقل {1} کاراکتر داشته باشد و شامل حروف بزرگ، حروف کوچک و عدد باشد.';
$l['userdata_passwords_dont_match'] = 'رمزی که به عنوان تأیید وارد کرده‌اید با رمز عبور اصلی مطابقت ندارد. لطفاً رمز عبور خود را به درستی تأیید کنید.';
$l['userdata_bad_password_security'] = 'رمز عبوری که وارد کرده‌اید مشابه نام کاربری یا آدرس ایمیل شما است. لطفاً رمز عبور قوی‌تری وارد کنید.';

$l['userdata_missing_email'] = 'شما آدرس ایمیلی وارد نکردید. لطفاً یکی وارد کنید.';
$l['userdata_invalid_email_format'] = 'آدرس ایمیلی که وارد کرده‌اید نامعتبر است. لطفاً یک آدرس ایمیل معتبر وارد کنید.';
$l['userdata_emails_dont_match'] = 'آدرس ایمیلی که به عنوان تأیید وارد کرده‌اید با آدرس اصلی مطابقت ندارد. لطفاً آدرس ایمیل خود را به درستی تأیید کنید.';
$l['userdata_banned_email'] = "آدرس ایمیلی که وارد کرده‌اید در حال حاضر مجاز به استفاده نیست. لطفاً یک آدرس ایمیل دیگر وارد کنید.";
$l['userdata_email_already_in_use'] = "شما یک آدرس ایمیل وارد کرده‌اید که قبلاً توسط عضو دیگری استفاده می‌شود. لطفاً یک آدرس ایمیل دیگر وارد کنید.";

$l['userdata_dob_required'] = "شما تاریخ تولد خود را انتخاب نکردید. لطفاً برای ادامه، تاریخ تولد خود را انتخاب کنید - با این حال، می‌توانید تاریخ تولد و سن خود را از سایر کاربران پنهان کنید.";
$l['userdata_invalid_website'] = 'آدرس وب‌سایتی که وارد کرده‌اید نامعتبر است. لطفاً یک آدرس وب‌سایت معتبر وارد کنید یا فیلد را خالی بگذارید.';
$l['userdata_invalid_birthday'] = 'تاریخ تولدی که وارد کرده‌اید نامعتبر است. لطفاً یک تاریخ تولد معتبر وارد کنید یا فیلد را خالی بگذارید.';
$l['userdata_invalid_birthday_coppa'] = 'برای تأیید سن خود، لطفاً سال تولد خود را وارد کنید. می‌توانید سن و تاریخ تولد خود را در گزینه‌های نمایه خود پنهان کنید.';
$l['userdata_invalid_birthday_coppa2'] = 'برای عضویت در این تالار گفتگو، باید حداقل ۱۳ سال سن داشته باشید. لطفاً با مدیر تماس بگیرید.';
$l['userdata_invalid_birthday_privacy'] = 'لطفاً یک گزینه معتبر برای حریم خصوصی تاریخ تولد انتخاب کنید.';
$l['userdata_conflicted_birthday_privacy'] = 'اگر می‌خواهید فقط سن را به عنوان حریم خصوصی تاریخ تولد خود نمایش دهید، باید سال تولد خود را مشخص کنید.';
$l['userdata_invalid_referrer'] = 'معرف‌ای که وارد کرده‌اید وجود ندارد. لطفاً یک معرف موجود وارد کنید یا فیلد را خالی بگذارید.';
$l['userdata_invalid_language'] = 'زبانی که انتخاب کرده‌اید وجود ندارد. لطفاً یک زبان موجود را انتخاب کنید.';
$l['userdata_invalid_style'] = 'سبکی که انتخاب کرده‌اید نامعتبر است. لطفاً یک سبک معتبر انتخاب کنید.';
$l['userdata_away_too_long'] = 'دلیل عدم حضور شما بیش از حد طولانی است. حداکثر ۲۰۰ کاراکتر برای این فیلد مجاز است. لطفاً {1} کاراکتر را از این فیلد حذف کنید.';
$l['userdata_missing_returndate'] = 'تاریخ بازگشتی که مشخص کرده‌اید، یک یا چند فیلد را از دست داده است. لطفاً مطمئن شوید که فیلدهای روز، ماه و سال را پر کرده‌اید.';
$l['userdata_missing_required_profile_field'] = 'شما گزینه‌ای برای فیلد "{1}" وارد نکردید. لطفاً مقداری را برای این فیلد وارد یا انتخاب کنید.';
$l['userdata_bad_profile_field_value'] = 'شما مقدار معتبری برای فیلد "{1}" وارد نکردید. لطفاً قبل از ادامه، یک مقدار معتبر وارد کنید.';
$l['userdata_bad_profile_field_values'] = 'شما گزینه معتبری برای فیلد "{1}" انتخاب نکردید. لطفاً مقداری را از گزینه‌های ارائه شده انتخاب کنید.';
$l['userdata_max_limit_reached'] = 'شما تعداد کاراکتر نامعتبری برای فیلد "{1}" وارد کرده‌اید. لطفاً این فیلد را با حداکثر {2} کاراکتر پر کنید.';
$l['userdata_invalid_checkfield'] = "تشخیص داده شده است که این فرم توسط یک ربات اسپم ارسال شده است. در صورت وجود خطا، لطفاً با مدیر تماس بگیرید.";
$l['userdata_invalid_postnum'] = "تعداد پست‌های وارد شده نامعتبر است. لطفاً تعداد پست‌های معتبری وارد کنید، یا فیلد را خالی بگذارید.";
$l['userdata_invalid_threadnum'] = "تعداد موضوع‌های وارد شده نامعتبر است. لطفاً تعداد موضوع‌های معتبری وارد کنید، یا فیلد را خالی بگذارید.";

$l['userdata_too_many_sig_images'] = "متاسفیم، اما نمی‌توانیم امضای شما را به‌روزرسانی کنیم زیرا حاوی تصاویر زیادی است. لطفاً برای ادامه، برخی تصاویر را از امضای خود حذف کنید.";
$l['userdata_too_many_sig_images2'] = "<strong>توجه:</strong> حداکثر تعداد تصاویر برای امضاها {1} است.";
$l['userdata_sig_too_long'] = "شما نمی‌توانید امضای خود را به‌روزرسانی کنید زیرا خیلی طولانی است. حداکثر طول امضاها {1} کاراکتر است. ";
$l['userdata_sig_remove_chars_plural'] = "لطفاً {1} کاراکتر را حذف کرده و دوباره امتحان کنید.";
$l['userdata_sig_remove_chars_singular'] = "لطفاً 1 کاراکتر را حذف کرده و دوباره امتحان کنید.";
