<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['nav_editpost'] = "ویرایش پست";
$l['edit_post'] = "ویرایش این پست";
$l['delete_post'] = "حذف پست";
$l['delete_q'] = "حذف؟";
$l['delete_1'] = "برای حذف این پست، کادر انتخاب سمت چپ را علامت بزنید و سپس روی دکمه سمت راست کلیک کنید.";
$l['delete_2'] = "<b>توجه:</b> اگر این پست اولین پست در یک موضوع باشد که حذف می‌شود، منجر به حذف کل موضوع خواهد شد.";
$l['subject'] = "موضوع:";
$l['your_message'] = "پیام شما:";
$l['post_options'] = "گزینه‌های پست:";
$l['editreason'] = "دلیل ویرایش:";
$l['options_sig'] = "<strong>امضا:</strong> امضای شما لحاظ شود. (فقط کاربران ثبت نام شده)";
$l['options_emailnotify'] = "<strong>ایمیل اطلاع رسانی:</strong> هر زمان که پاسخ جدیدی وجود داشته باشد، یک ایمیل دریافت کنید. (فقط کاربران ثبت نام شده)";
$l['options_disablesmilies'] = "<strong>غیرفعال کردن شکلک ها:</strong> نمایش شکلک ها را در این پست غیرفعال کنید.";
$l['preview_post'] = "پیش نمایش پست";
$l['update_post'] = "بروزرسانی پست";
$l['poll'] = "نظرسنجی:";
$l['poll_desc'] = "به صورت اختیاری می توانید یک نظرسنجی به این موضوع پیوست کنید.";
$l['poll_check'] = "من می خواهم یک نظرسنجی ارسال کنم";
$l['num_options'] = "تعداد گزینه‌ها:";
$l['max_options'] = "(حداکثر: {1})";
$l['delete_now'] = "اکنون حذف شود";
$l['edit_time_limit'] = "متاسفیم، اما شما نمی‌توانید پست خود را ویرایش کنید. مدیر سایت آن را طوری تنظیم کرده است که پست‌ها فقط ظرف {1} دقیقه از زمان ارسال قابل ویرایش باشند.";
$l['no_prefix'] = "بدون پیشوند";

$l['redirect_nodelete'] = "پست حذف نشد زیرا شما کادر انتخاب \"حذف\" را علامت نزده بودید.";
$l['redirect_norestore'] = "پست بازیابی نشد زیرا شما کادر انتخاب \"بازیابی\" را علامت نزده بودید.";
$l['redirect_postedited'] = "متشکرم، این پست ویرایش شده است.<br />";
$l['redirect_postedited_redirect'] = "اکنون به موضوع بازگردانده خواهید شد.";
$l['redirect_postedited_poll'] = "متشکرم، این پست ویرایش شده است. <br />از آنجایی که شما تصمیم به ارسال نظرسنجی گرفتید، اکنون به صفحه ایجاد نظرسنجی هدایت خواهید شد.";
$l['error_invalidpost'] = "متاسفیم، اما به نظر می‌رسد که شما یک آدرس نامعتبر را دنبال کرده‌اید. لطفاً مطمئن شوید که پست مشخص شده وجود دارد و دوباره امتحان کنید.";
$l['redirect_threaddeleted'] = "متشکرم، موضوع حذف شد.<br />اکنون به انجمن بازگردانده خواهید شد.";
$l['redirect_postdeleted'] = "متشکرم، پست حذف شد.<br />اکنون به موضوع بازگردانده خواهید شد.";
$l['redirect_threadrestored'] = "متشکرم، موضوع بازیابی شد.<br />اکنون به انجمن بازگردانده خواهید شد.";
$l['redirect_postrestored'] = "متشکرم، پست بازیابی شد.<br />اکنون به موضوع بازگردانده خواهید شد.";
$l['redirect_threadclosed'] = "شما نمی‌توانید پست‌های موجود در این موضوع را ویرایش کنید زیرا توسط یک مدیر بسته شده است.";
$l['redirect_post_moderation'] = "مدیر مشخص کرده است که همه ویرایش‌های پست‌ها نیاز به مدیریت دارد. اکنون به موضوع بازگردانده خواهید شد.";
$l['redirect_thread_moderation'] = "مدیر مشخص کرده است که همه ویرایش‌های موضوعات نیاز به مدیریت دارند. اکنون به فهرست انجمن بازگردانده خواهید شد.";
$l['error_already_delete'] = "متاسفیم، اما این پست قبلاً حذف شده است.";

$l['thread_deleted'] = "موضوع به طور دائم حذف شده";
$l['post_deleted'] = "پست به طور دائم حذف شده";
$l['thread_soft_deleted'] = "موضوع به طور موقت حذف شده";
$l['post_soft_deleted'] = "پست به طور موقت حذف شده";
$l['thread_restored'] = "موضوع بازیابی شده";
$l['post_restored'] = "پست بازیابی شده";

$l['error_already_deleted'] = 'پست انتخاب شده قبلاً حذف شده است.';
