<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['nav_group_management'] = "مدیریت گروه {1}";
$l['nav_join_requests'] = "درخواست‌های عضویت";
$l['nav_group_memberships'] = "عضویت گروه‌ها";

$l['not_leader_of_this_group'] = "متأسفیم، شما رهبر این گروه‌کاربری نیستید.";
$l['invalid_group'] = "این گروه‌کاربری وجود ندارد.";
$l['pending_requests'] = "درخواست‌های عضویت در انتظار";
$l['num_requests_pending'] = "در حال حاضر <strong>{1}</strong> درخواست عضویت معلق برای این گروه‌کاربری وجود دارد.";
$l['group_management'] = "مدیریت گروه";
$l['members_of'] = "اعضای \"{1}\"";
$l['user_name'] = "نام کاربری";
$l['contact'] = "تماس";
$l['reg_date'] = "تاریخ ثبت‌نام";
$l['post_count'] = "تعداد ارسال‌ها";
$l['remove_selected'] = "حذف کاربران انتخاب شده از گروه";
$l['add_member'] = "افزودن عضو به \"{1}\"";
$l['add_member_submit'] = "افزودن عضو به گروه";
$l['invite_member'] = "دعوت عضو به \"{1}\"";
$l['invite_member_submit'] = "دعوت عضو به گروه";
$l['join_requests'] = "درخواست‌های عضویت";
$l['join_requests_title'] = "درخواست‌های عضویت برای \"{1}\"";
$l['leader'] = "(رهبر)";
$l['reason'] = "دلیل";
$l['accept'] = "تأیید";
$l['ignore'] = "نادیده گرفتن";
$l['decline'] = "رد کردن";
$l['action_requests'] = "انجام اقدامات";
$l['join_requests_moderated'] = "درخواست‌های عضویت مدیریت شدند.<br />شما اکنون به لیست درخواست‌ها هدایت خواهید شد.";
$l['no_requests'] = "در حال حاضر هیچ درخواست عضویت معلقی برای این گروه وجود ندارد.";
$l['no_users'] = "هیچ کاربری در این گروه وجود ندارد.";
$l['user_added'] = "کاربر به گروه‌کاربری اضافه شد.";
$l['users_removed'] = "کاربران انتخاب شده از گروه‌کاربری حذف شدند.";
$l['group_no_members'] = "در حال حاضر هیچ عضوی در این گروه وجود ندارد.<br />برای بازگشت به صفحه مدیریت گروه، روی <a href=\"usercp.php?action=usergroups\">اینجا</a> کلیک کنید.";
$l['group_public_moderated'] = "این گروه‌کاربری عمومی است که هر کسی می‌تواند به آن بپیوندد. کلیه درخواست‌های عضویت باید توسط رهبر گروه مدیریت شوند.";
$l['group_public_not_moderated'] = "این گروه‌کاربری عمومی است که هر کسی می‌تواند آزادانه به آن بپیوندد.";
$l['group_public_invite'] = "این گروه‌کاربری عمومی است و برای پیوستن نیاز به دعوت از رهبر گروه دارد.";
$l['group_private'] = "این گروه‌کاربری خصوصی است. فقط کاربرانی که توسط رهبر گروه اضافه شده‌اند می‌توانند عضو این گروه باشند.";
$l['group_default'] = "این گروه‌کاربری یک گروه اصلی سیستمی است.";
$l['group_leaders'] = "رهبران گروه";
$l['no_users_selected'] = "متأسفیم، اما به نظر می‌رسد هیچ کاربری برای حذف انتخاب نشده است.<br />لطفاً به عقب بازگردید و کاربرانی را که می‌خواهید از این گروه حذف کنید، انتخاب نمایید.";

$l['error_alreadyingroup'] = "کاربر مورد نظر قبلاً عضو گروه‌کاربری بوده است.";
$l['error_alreadyinvited'] = "کاربر مورد نظر قبلاً دعوت شده است.";

$l['user_invited'] = "کاربر به گروه‌کاربری دعوت شد.";
$l['invite_pm_subject'] = "شما به عضویت در \"{1}\" دعوت شده‌اید";
$l['invite_pm_message'] = "شما یک دعوتنامه برای پیوستن به گروه‌کاربری \"{1}\" دریافت کرده‌اید.

برای پیوستن، لطفاً به صفحه [url={2}/usercp.php?action=usergroups]عضویت گروه‌ها[/url] خود بروید و روی 'تأیید دعوت' کلیک کنید.

این دعوتنامه منقضی نمی‌شود.";
$l['invite_pm_message_expires'] = "شما یک دعوتنامه برای پیوستن به گروه‌کاربری \"{1}\" دریافت کرده‌اید.

برای پیوستن، لطفاً به صفحه [url={2}/usercp.php?action=usergroups]عضویت گروه‌ها[/url] خود بروید و روی 'تأیید دعوت' کلیک کنید.

این دعوتنامه طی {3} روز منقضی خواهد شد.";


