<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['nav_register'] = "ثبت‌نام";
$l['nav_activate'] = "فعال‌سازی";
$l['nav_resendactivation'] = "ارسال مجدد ایمیل فعال‌سازی";
$l['nav_lostpw'] = "بازیابی رمز عبور فراموش شده";
$l['nav_resetpassword'] = "بازنشانی رمز عبور";
$l['nav_login'] = "ورود";
$l['nav_emailuser'] = "ایمیل کاربر";
$l['nav_referrals'] = "کاربران معرفی شده توسط {1}";
$l['nav_profile'] = "پروفایل {1}";

$l['referrals'] = 'معرفی ها';
$l['referral_date'] = 'تاریخ معرفی:';
$l['referrals_no_user_specified'] = 'کاربری مشخص نشده است.';
$l['referrals_invalid_user'] = 'کاربر نامعتبر مشخص شده است.';
$l['member_no_referrals'] = 'این کاربر معرف ندارد.';

$l['tpp_option'] = "نمایش {1} موضوع در هر صفحه";
$l['ppp_option'] = "نمایش {1} پست در هر صفحه";
$l['account_activation'] = "فعال‌سازی حساب";
$l['activate_account'] = "فعال‌سازی حساب";
$l['activation_code'] = "کد فعال‌سازی:";

$l['email_user'] = "ارسال ایمیل به {1}";
$l['email_subject'] = "موضوع ایمیل";
$l['email_message'] = "متن ایمیل";
$l['send_email'] = "ارسال ایمیل";
$l['error_hideemail'] = "گیرنده آدرس ایمیل خود را مخفی کرده است و در نتیجه شما نمی‌توانید به او ایمیل بزنید.";
$l['error_no_email_subject'] = "شما باید یک موضوع برای ایمیل خود وارد کنید";
$l['error_no_email_message'] = "شما باید متنی برای ایمیل خود وارد کنید";

$l['login'] = "ورود";
$l['pw_note'] = "لطفاً توجه داشته باشید که رمزهای عبور نسبت به حروف کوچک و بزرگ حساس هستند.";
$l['lostpw_note'] = "رمز عبور خود را فراموش کرده‌اید؟";
$l['lost_pw'] = "رمز عبور حساب فراموش شده";
$l['lost_pw_form'] = "فرم بازیابی رمز عبور فراموش شده";
$l['email_address'] = "آدرس ایمیل:";
$l['request_user_pass'] = "درخواست اطلاعات ورود";
$l['profile'] = "پروفایل {1}";
$l['registration_date'] = "تاریخ ثبت‌نام:";
$l['date_of_birth'] = "تاریخ تولد:";
$l['birthdayhidden'] = "مخفی";
$l['birthday'] = "تاریخ تولد:";
$l['local_time'] = "زمان محلی:";
$l['local_time_format'] = "{1} در {2}";
$l['users_forum_info'] = "اطلاعات انجمن {1}";
$l['joined'] = "عضویت از:";
$l['lastvisit'] = "آخرین بازدید:";
$l['total_posts'] = "کل پست‌ها:";
$l['ppd_percent_total'] = "{1} پست در روز | {2} درصد از کل پست‌ها";
$l['total_threads'] = "کل موضوعات:";
$l['tpd_percent_total'] = "{1} موضوع در روز | {2} درصد از کل موضوعات";
$l['find_posts'] = "یافتن همه پست‌ها";
$l['find_threads'] = "یافتن همه موضوعات";
$l['members_referred'] = "کاربران معرفی کرده:";
$l['rating'] = "اعتبار:";
$l['users_contact_details'] = "اطلاعات تماس {1}";
$l['homepage'] = "وب‌سایت:";
$l['pm'] = "پیام خصوصی:";
$l['send_pm'] = "ارسال پیام خصوصی به {1}.";
$l['skype_id'] = "شناسه Skype:";
$l['google_id'] = "شناسه Google Hangouts:";
$l['avatar']  = "آواتار:";
$l['warning_level'] = "سطح اخطار:";
$l['warn'] = "اخطار دادن";
$l['away_note'] = "{1} در حال حاضر غایب است.";
$l['away_reason'] = "دلیل:";
$l['away_since'] = "غیبت از:";
$l['away_returns'] = "بازگشت در:";
$l['away_no_reason'] = "مشخص نشده است.";
$l['ban_note'] = "این حساب کاربری در حال حاضر مسدود شده است.";
$l['ban_by'] = "مسدود کننده";
$l['ban_length'] = "مدت زمان مسدودیت";
$l['ban_remaining'] = "باقی‌مانده";

$l['users_additional_info'] = "اطلاعات تکمیلی درباره {1}";
$l['email'] = "ایمیل:";
$l['send_user_email'] = "برای {1} یک ایمیل ارسال کنید.";
$l['users_signature'] = "امضای {1}";
$l['agreement'] = "توافقنامه ثبت‌نام";
$l['agreement_1'] = "در حالی که ما تلاش می‌کنیم هر پیام حاوی مطالب نامناسب، جنسی، توهین‌آمیز، آزاردهنده کودکان، سوءاستفاده جنسی از کودکان، نفرت‌پراکنانه، افتراآمیز یا تهدیدآمیز که می‌تواند تجاوز به حریم خصوصی فرد تلقی شود، یا هر چیز دیگری که ناقض هر نوع قانونی باشد را ویرایش یا حذف کنیم، بررسی هر پیام ارسال شده در این سیستم بحث و گفتگو برای ما غیرممکن است. به همین دلیل شما اذعان می‌کنید که تمام پیام‌های ارسال شده در این سیستم بحث و گفتگو بیانگر دیدگاه‌ها و نظرات نویسنده اصلی پیام است و لزوماً بازتاب‌دهنده دیدگاه‌های این انجمن نیست. بنابراین ما هیچ مسئولیتی را نمی‌پذیریم و نمی‌توانیم در قبال پیام‌های ارسال شده پاسخگو باشیم. ما صحت و کامل بودن هر پیامی را تضمین یا تأیید نمی‌کنیم.";
$l['agreement_2'] = "با ثبت‌نام در این سیستم بحث و گفتگو موافقت می‌کنید که هیچ مطلبی را که عمداً نادرست، غیردقیق، توهین‌آمیز، نفرت‌پراکنانه، آزاردهنده، جنسی، تهدیدآمیز یا تجاوز به حریم خصوصی فرد باشد، یا هر ماده دیگری که ممکن است ناقض قوانین قابل اجرا باشد، ارسال نخواهید کرد.";
$l['agreement_3'] = "عدم رعایت این قوانین ممکن است منجر به خاتمه حساب کاربری شما، تعلیق موقت، یا مسدود شدن دائمی دسترسی شما به این انجمن‌ها شود. آدرس IP شما با هر پستی که در این سیستم بحث و گفتگو ارسال می‌کنید، ثبت می‌شود و در صورت لزوم توسط کارکنان انجمن قابل بازیابی است. شما موافقت می‌کنید که ما حق ویرایش، حذف یا قفل کردن هر حساب یا پیام را در هر زمان که صلاح بدانیم، داریم. همچنین موافقت می‌کنید که هر اطلاعاتی که در این سیستم بحث و گفتگو وارد می‌کنید در یک پایگاه داده ذخیره می‌شود و \"کوکی‌ها\" برای ذخیره اطلاعات ورود شما در کامپیوترتان ذخیره می‌گردند.";
$l['agreement_4'] = "هیچ یک از اطلاعاتی که در این انجمن‌ها ارائه می‌دهید، بدون رضایت کامل شما به شخص ثالثی افشا نخواهد شد، هرچند کارکنان نمی‌توانند در قبال هرگونه تلاش برای هک که طی آن داده‌های شما به خطر بیفتد، مسئول شناخته شوند.";
$l['agreement_5'] = "با ادامه دادن فرآیند ثبت‌نام، شما با قوانین فوق و هر قانون دیگری که مدیر تعیین کند، موافقت می‌کنید.";
$l['registration'] = "ثبت‌نام";
$l['required_fields'] = "فیلدهای مورد نیاز";
$l['complex_password'] = "<abbr title=\"یک رمز عبور با حداقل {1} کاراکتر که شامل یک حرف بزرگ، یک حرف کوچک و یک عدد باشد.\">رمز عبور پیچیده</abbr>:";
$l['confirm_email'] = "تأیید ایمیل:";
$l['optional_fields'] = "فیلدهای اختیاری";
$l['website_url'] = "آدرس وب‌سایت شما:";
$l['birthdate'] = "تاریخ تولد:";
$l['additional_info'] = "اطلاعات اضافی";
$l['required_info'] = "اطلاعات مورد نیاز";
$l['i_agree'] = "من موافقم";
$l['account_details'] = "جزئیات حساب کاربری";
$l['account_prefs'] = "تنظیمات حساب کاربری:";
$l['invisible_mode'] = "مرا از لیست «آنلاین‌ها» پنهان کن.";
$l['allow_notices'] = "دریافت ایمیل از مدیران.";
$l['hide_email'] = "ایمیل خود را از سایر اعضا پنهان کن.";
$l['email_notify'] = "به طور خودکار در موضوع‌هایی که پست می‌گذارم عضو شوم.";
$l['receive_pms'] = "دریافت پیام خصوصی از کاربران دیگر.";
$l['pm_notice'] = "هنگام دریافت پیام خصوصی، یک اعلان به من نشان داده شود.";
$l['email_notify_newpm'] = "هنگام دریافت پیام خصوصی جدید، از طریق ایمیل به من اطلاع داده شود.";
$l['time_offset'] = "منطقه زمانی (تصحیح ساعت تابستانی <abbr title=\"Daylight Saving Time\">DST</abbr> مستثنی است):";
$l['time_offset_desc'] = "اگر در منطقه‌ای زمانی زندگی می‌کنید که با منطقه زمانی تنظیم شده این انجمن متفاوت است، می‌توانید آن را از لیست زیر انتخاب کنید.";
$l['dst_correction'] = "تصحیح ساعت تابستانی:";
$l['dst_correction_auto'] = "تنظیمات DST را به طور خودکار تشخیص بده";
$l['dst_correction_enabled'] = "همیشه از تصحیح DST استفاده کن";
$l['dst_correction_disabled'] = "هرگز از تصحیح DST استفاده نکن";
$l['redirect_registered_coppa_activate'] = "از ثبت‌نام شما در {1}، {2} سپاسگزاریم. حساب شما با موفقیت ایجاد شد، اما از آنجایی که مالک این حساب زیر ۱۳ سال سن دارد، برای استفاده از این حساب نیاز به کسب اجازه والدین است.<br /><br />والدین یا سرپرست قانونی باید یک نسخه تکمیل شده از <a href=\"member.php?action=coppa_form\">فرم انطباق با COPPA</a> ما را دانلود، پر و برای ما ارسال کنند.<br /><br />به محض دریافت نسخه تکمیل شده این فرم، حساب فعال خواهد شد.";
$l['coppa_compliance'] = "انطباق با COPPA";
$l['coppa_desc'] = "جهت ثبت‌نام در این انجمن‌ها، ما ملزم به تأیید سن شما برای رعایت <a href=\"https://www.ftc.gov/enforcement/rules/rulemaking-regulatory-reform-proceedings/childrens-online-privacy-protection-rule\" title=\"قانون حفاظت از حریم خصوصی آنلاین کودکان\" target=\"_blank\" rel=\"noopener\">COPPA</a> هستیم. لطفاً تاریخ تولد خود را در زیر وارد کنید.<br /><br />اگر زیر ۱۳ سال سن دارید، برای ثبت‌نام باید اجازه والدین اخذ شود. والدین یا سرپرست قانونی باید یک نسخه تکمیل شده از <a href=\"member.php?action=coppa_form\" target=\"_blank\" rel=\"noopener\">فرم انطباق با COPPA</a> ما را دانلود، پر و برای ما ارسال کنند.";
$l['coppa_desc_for_deny'] = "جهت ثبت‌نام در این انجمن‌ها، ما ملزم به تأیید سن شما برای رعایت <a href=\"https://www.ftc.gov/enforcement/rules/rulemaking-regulatory-reform-proceedings/childrens-online-privacy-protection-rule\" title=\"قانون حفاظت از حریم خصوصی آنلاین کودکان\" target=\"_blank\" rel=\"noopener\">COPPA</a> هستیم. لطفاً تاریخ تولد خود را در زیر وارد کنید.";
$l['hide_dob'] = "می‌توانید با ویرایش پروفایل خود پس از ثبت‌نام، تاریخ تولد و سن خود را پنهان کنید.";
$l['signature'] = "امضا:";
$l['continue_registration'] = "ادامه ثبت‌نام";
$l['birthdayprivacy'] = "حریم خصوصی تاریخ تولد:";
$l['birthdayprivacyall'] = "نمایش سن و تاریخ تولد";
$l['birthdayprivacynone'] = "پنهان کردن سن و تاریخ تولد";
$l['birthdayprivacyage'] = "فقط نمایش سن";
$l['leave_this_field_empty'] = "این فیلد را خالی بگذارید:";
$l['error_need_to_be_thirteen'] = "شما باید سیزده سال یا بیشتر داشته باشید تا بتوانید در این انجمن ثبت‌نام کنید.";
$l['coppa_registration'] = "فرم ثبت‌نام COPPA";
$l['coppa_form_instructions'] = "لطفاً این فرم را چاپ کرده، آن را تکمیل نموده و یا به شماره فکس زیر فکس کنید یا به آدرس پستی ارائه شده ارسال نمایید.";
$l['fax_number'] = "شماره فکس:";
$l['mailing_address'] = "آدرس پستی:";
$l['account_information'] = "اطلاعات حساب کاربری";
$l['parent_details'] = "جزئیات والدین / سرپرست";
$l['full_name'] = "نام کامل:";
$l['relation'] = "نسبت:";
$l['phone_no'] = "شماره تلفن:";
$l['coppa_parent_agreement'] = "من درک می‌کنم که اطلاعات ارائه شده صادقانه است، هرگونه اطلاعات ممکن است در آینده با وارد کردن رمز عبور ارائه شده تغییر یابد و این حساب کاربری با درخواست قابل حذف است.";

$l['coppa_agreement_1'] = "کاربران زیر ۱۳ سال باید برای ثبت‌نام در {1} از والدین یا سرپرست قانونی خود اجازه دریافت کنند.";
$l['coppa_agreement_2'] = "والدین یا سرپرست قانونی باید یک نسخه تکمیل شده از <a href=\"member.php?action=coppa_form\" target=\"_blank\" rel=\"noopener\">فرم انطباق با COPPA</a> ما را دانلود، پر و ارسال کنند تا عضویت اعطا شود.";
$l['coppa_agreement_3'] = "اگر مایل باشید، می‌توانید فرآیند ثبت‌نام را اکنون شروع کنید، اما حساب تا زمان دریافت فرم انطباق ذکر شده، غیرقابل دسترس خواهد بود.";

$l['error_invalid_birthday'] = 'تاریخ تولد وارد شده نامعتبر است. لطفاً یک تاریخ تولد معتبر وارد کنید.';
$l['error_awaitingcoppa'] = "شما نمی‌توانید با این حساب وارد شوید زیرا هنوز منتظر تأیید COPPA از سوی والدین یا سرپرست است.<br /><br />والدین یا سرپرست قانونی باید یک نسخه تکمیل شده از <a href=\"member.php?action=coppa_form\">فرم انطباق با COPPA</a> ما را دانلود، پر و برای ما ارسال کنند.<br /><br />به محض دریافت نسخه تکمیل شده این فرم، حساب فعال خواهد شد.";

$l['lang_select'] = "تنظیمات زبان:";
$l['lang_select_desc'] = "اگر در کشوری زندگی می‌کنید که به زبانی غیر از زبان پیش‌فرض انجمن صحبت می‌کند، ممکن است بتوانید یک بسته زبان نصب شده و قابل خواندن را در زیر انتخاب کنید.";
$l['lang_select_default'] = "استفاده از پیش‌فرض";

$l['submit_registration'] = "ثبت‌نام نهایی!";
$l['confirm_password'] = "تأیید رمز عبور:";
$l['referrer'] = "معرف:";
$l['referrer_desc'] = "اگر توسط یک عضو دیگر معرفی شده‌اید، می‌توانید نام کاربری او را در زیر وارد کنید. در غیر این صورت، این فیلد را خالی بگذارید.";
$l['resend_activation'] = "ارسال مجدد فعال‌سازی حساب";
$l['request_activation'] = "درخواست کد فعال‌سازی";
$l['ppp'] = "تعداد پست در هر صفحه:";
$l['ppp_desc'] = "به شما امکان می‌دهد تعداد پست‌هایی که در هر صفحه از یک موضوع نمایش داده می‌شوند را انتخاب کنید.";
$l['tpp'] = "تعداد موضوع در هر صفحه:";
$l['tpp_desc'] = "به شما امکان می‌دهد تعداد موضوع‌هایی که در هر صفحه از لیست موضوع‌ها نمایش داده می‌شوند را انتخاب کنید.";
$l['reset_password'] = "بازنشانی رمز عبور";
$l['send_password'] = "ارسال رمز عبور جدید!";
$l['registration_errors'] = "خطاهای زیر در هنگام ثبت‌نام شما رخ داد:";
$l['timeonline'] = "زمان صرف شده آنلاین:";
$l['timeonline_hidden'] = "(پنهان)";
$l['registrations_disabled'] = "متأسفم، اما در حال حاضر نمی‌توانید ثبت‌نام کنید زیرا مدیر، ثبت‌نام حساب‌های کاربری جدید را غیرفعال کرده است.";
$l['error_username_length'] = "نام کاربری شما نامعتبر است. نام‌های کاربری باید بین {1} تا {2} کاراکتر باشند.";
$l['error_stop_forum_spam_spammer'] = 'متأسفم، {1} شما با یک اسپمر شناخته شده مطابقت دارد. اگر فکر می‌کنید این اشتباه است، لطفاً با مدیر تماس بگیرید.';
$l['error_stop_forum_spam_fetching'] = 'متأسفم، مشکلی در تأیید حساب شما در برابر پایگاه داده اسپمرها رخ داد. به احتمال زیاد پایگاه داده قابل دسترسی نبوده است. لطفاً بعداً دوباره تلاش کنید.';

$l['none_registered'] = "هیچ‌کس ثبت‌نام نکرده است";
$l['not_specified'] = "تعیین نشده";
$l['membdayage'] = "({1} ساله)";
$l['mod_options'] = "گزینه‌های مدیریت";
$l['edit_in_mcp'] = "ویرایش این کاربر در کنترل‌پنل مدیریت";
$l['ban_in_mcp'] = "مسدودسازی این کاربر در کنترل‌پنل مدیریت";
$l['edit_ban_in_mcp'] = "ویرایش مسدودیت در کنترل‌پنل مدیریت";
$l['lift_ban_in_mcp'] = "برداشتن مسدودیت در کنترل‌پنل مدیریت";
$l['purgespammer'] = "حذف کاربر اسپم‌کننده";
$l['edit_usernotes'] = "ویرایش یادداشت‌های کاربر در کنترل‌پنل مدیریت";
$l['no_usernotes'] = "در حال حاضر هیچ یادداشتی برای این کاربر وجود ندارد";
$l['view_all_notes'] = "مشاهده همه یادداشت‌ها";
$l['view_notes_for'] = "مشاهده یادداشت‌های {1}";
$l['registration_ip'] = "آی‌پی ثبت‌نام:";
$l['last_known_ip'] = "آخرین آی‌پی شناخته شده:";
$l['reputation'] = "اعتبار:";
$l['reputation_vote'] = "اهدای اعتبار";
$l['reputation_details'] = "جزئیات";
$l['already_logged_in'] = "توجه: شما در حال حاضر به عنوان {1} وارد شده‌اید.";
$l['admin_edit_in_acp'] = "ویرایش این کاربر در کنترل‌پنل ادمین";
$l['admin_ban_in_acp'] = "مسدودسازی این کاربر در کنترل‌پنل ادمین";
$l['admin_lift_ban_in_acp'] = "برداشتن مسدودیت در کنترل‌پنل ادمین";
$l['admin_edit_ban_in_acp'] = "ویرایش مسدودیت در کنترل‌پنل ادمین";
$l['admin_options'] = "گزینه‌های ادمین";

$l['redirect_registered_activation'] = "از ثبت‌نام شما در {1}، {2} سپاسگزاریم.<p>برای تکمیل ثبت‌نام، لطفاً ایمیل خود را برای دستورالعمل‌های فعال‌سازی حساب بررسی کنید. ممکن است تا زمانی که حساب شما فعال نشود، نتوانید پستی ارسال کنید.";
$l['redirect_emailupdated'] = "ایمیل شما با موفقیت تغییر کرد.<br />اکنون به صفحه اصلی انجمن‌ها بازگردانده می‌شوید.";
$l['redirect_accountactivated'] = "حساب شما با موفقیت فعال شد.<br />اکنون به صفحه اصلی انجمن‌ها بازگردانده می‌شوید.";
$l['redirect_accountactivated_admin'] = "ایمیل شما با موفقیت تأیید شد.<br />ثبت‌نام شما باید توسط یک مدیر تأیید شود. تا آن زمان، ممکن است نتوانید در این انجمن‌ها پست بگذارید.<br />اکنون به صفحه اصلی انجمن‌ها بازگردانده می‌شوید.";
$l['redirect_registered'] = "از ثبت‌نام شما در {1}، {2} سپاسگزاریم.<br />اکنون به صفحه اصلی انجمن‌ها بازگردانده می‌شوید.";
$l['redirect_registered_admin_activate'] = "از ثبت‌نام شما در {1}، {2} سپاسگزاریم.<br />ثبت‌نام شما باید توسط یک مدیر تأیید شود. تا آن زمان، ممکن است نتوانید در این انجمن‌ها پست بگذارید.";
$l['redirect_loggedout'] = "شما با موفقیت خارج شدید (Logout).<br />اکنون به صفحه اصلی انجمن‌ها بازگردانده می‌شوید.";
$l['redirect_alreadyloggedout'] = "شما از قبل خارج شده بودید یا هنوز وارد نشده‌اید.<br />اکنون به صفحه اصلی انجمن‌ها بازگردانده می‌شوید.";
$l['redirect_lostpwsent'] = "متشکریم، تمام حساب‌های مرتبط با آن آدرس ایمیل، یک پیام حاوی جزئیات نحوه بازنشانی رمز عبور دریافت کرده‌اند.<br /><br />اکنون به صفحه اصلی انجمن‌ها هدایت می‌شوید.";
$l['redirect_activationresent'] = "ایمیل فعال‌سازی شما مجدداً به آدرس ایمیل ارائه شده ارسال شد.";
$l['redirect_passwordreset'] = "متشکریم، رمز عبور حساب شما بازنشانی شد. رمز عبور جدیدی که به صورت تصادفی تولید شده، به آدرس ایمیل مرتبط با حساب شما ارسال گردید.";
$l['redirect_memberrated'] = "عضو با موفقیت امتیازدهی شد.";
$l['redirect_registered_passwordsent'] = "یک رمز عبور تصادفی تولید شده و به آدرس ایمیل شما ارسال گردیده است. قبل از اینکه بتوانید وارد شوید، باید ایمیل خود را برای یافتن این رمز عبور بررسی کنید.";
$l['redirect_validated'] = "متشکریم، حساب شما تأیید شد.<br />اکنون به صفحه اصلی انجمن‌ها هدایت می‌شوید.";

$l['error_activated_by_admin'] = "شما نمی‌توانید ایمیل فعال‌سازی حساب خود را مجدداً ارسال کنید، زیرا تمام ثبت‌نام‌ها باید توسط یک مدیر تأیید شوند.";
$l['error_alreadyregistered'] = "متأسفیم، اما سیستم ما نشان می‌دهد که شما قبلاً ثبت‌نام کرده‌اید و ثبت‌نام چندین حساب غیرفعال شده است.";
$l['error_alreadyregisteredtime'] = "ما نمی‌توانیم ثبت‌نام شما را پردازش کنیم، زیرا در {2} ساعت گذشته {1} ثبت‌نام جدید از آدرس آی‌پی شما انجام شده است. لطفاً بعداً دوباره تلاش کنید.";
$l['error_badlostpwcode'] = "کد بازنشانی رمز عبور نامعتبری وارد کرده‌اید. لطفاً ایمیلی را که برای شما ارسال شده دوباره بخوانید یا برای کمک بیشتر با مدیران انجمن تماس بگیرید.";
$l['error_badactivationcode'] = "کد فعال‌سازی نامعتبری وارد کرده‌اید. برای ارسال مجدد تمام ایمیل‌های فعال‌سازی به آدرس ایمیل ثبت شده، لطفاً <a href=\"member.php?action=resendactivation\">اینجا</a> کلیک کنید.";
$l['error_alreadyactivated'] = "حساب شما قبلاً فعال شده است یا نیازی به تأیید ایمیل ندارد.";
$l['error_alreadyvalidated'] = "ایمیل شما قبلاً تأیید شده است.";
$l['error_nothreadurl'] = "پیام شما حاوی آدرس URL موضوع نیست. لطفاً از قابلیت «ارسال برای دوست» برای هدف مورد نظر آن استفاده کنید.";
$l['error_bannedusername'] = "شما نام کاربری‌ای را وارد کرده‌اید که از ثبت‌نام آن در لیست سیاه قرار دارد. لطفاً نام کاربری دیگری انتخاب کنید.";
$l['error_notloggedout'] = "شناسه کاربری شما برای ادامه فرآیند خروج از سیستم قابل تأیید نبود. این ممکن است به دلیل جاوا اسکریپت مخربی باشد که سعی در خروج خودکار شما داشته است. اگر قصد خروج داشتید، لطفاً دکمه خروج (Log Out) را در منوی بالا کلیک کنید.";
$l['error_regimageinvalid'] = "کد تأیید تصویر (Captcha) که وارد کردید، اشتباه بود. لطفاً کد را دقیقاً همان‌طور که در تصویر ظاهر می‌شود، وارد کنید.";
$l['error_regimagerequired'] = "لطفاً کد تأیید تصویر را برای ادامه فرآیند ورود پر کنید. لطفاً کد را دقیقاً همان‌طور که در تصویر ظاهر می‌شود، وارد کنید.";
$l['error_spam_deny'] = "سیستم‌های ما تشخیص می‌دهند که شما ممکن است یک اسپمر باشید، بنابراین از ثبت‌نام شما ممانعت به عمل آمده است. اگر این یک اشتباه است، لطفاً با مدیر تماس بگیرید.";
$l['error_spam_deny_time'] = "سیستم‌های ما تشخیص می‌دهند که شما ممکن است یک اسپمر باشید، بنابراین از ثبت‌نام شما ممانعت به عمل آمده است. برای جلوگیری از ثبت‌نام‌های خودکار، ثبت‌نام باید حداقل {1} ثانیه طول بکشد، اما شما در {2} ثانیه ثبت‌نام کردید. اگر این یک اشتباه است، لطفاً با مدیر تماس بگیرید.";

$l['js_validator_no_username'] = "شما باید یک نام کاربری وارد کنید.";
$l['js_validator_invalid_email'] = "شما باید یک آدرس ایمیل معتبر وارد کنید.";
$l['js_validator_email_match'] = "شما باید دوباره همان آدرس ایمیل را وارد کنید.";
$l['js_validator_no_image_text'] = "شما باید متن داخل تصویر بالا را وارد کنید.";
$l['js_validator_no_security_question'] = "شما باید پاسخ سؤال امنیتی را وارد کنید.";
$l['js_validator_password_matches'] = "رمزهای عبوری که وارد می‌کنید باید مطابقت داشته باشند.";
$l['js_validator_password_length'] = "رمز عبور شما باید {1} کاراکتر یا بیشتر باشد.";
$l['js_validator_bad_password_security'] = "رمز عبوری که وارد کردید شبیه نام کاربری یا آدرس ایمیل شماست. لطفاً یک رمز عبور قوی‌تر وارد کنید.";
$l['js_validator_not_empty'] = "شما باید یک مقدار برای این فیلد انتخاب یا وارد کنید.";
$l['js_validator_username_length'] = "نام‌های کاربری باید بین {1} تا {2} کاراکتر طول داشته باشند.";

$l['security_question'] = "سؤال امنیتی";
$l['question_note'] = "لطفاً به سؤال ارائه شده پاسخ دهید. این فرآیند برای جلوگیری از فرآیندهای خودکار استفاده می‌شود.";
$l['error_question_wrong'] = "پاسخی که برای سؤال امنیتی ارائه دادید، اشتباه است. لطفاً دوباره تلاش کنید.";

$l['subscription_method'] = "حالت پیش‌فرض اشتراک موضوع:";
$l['no_auto_subscribe'] = "اشتراک خودکار فعال نشود";
$l['no_subscribe'] = "بدون اطلاع‌رسانی";
$l['instant_email_subscribe'] = "اطلاع‌رسانی فوری از طریق ایمیل";
$l['instant_pm_subscribe'] = "اطلاع‌رسانی فوری از طریق پیام خصوصی";

$l['remove_from_buddy_list'] = "حذف از لیست دوستان";
$l['add_to_buddy_list'] = "افزودن به لیست دوستان";
$l['remove_from_ignore_list'] = "حذف از لیست سیاه";
$l['add_to_ignore_list'] = "افزودن به لیست سیاه";
$l['report_user'] = "گزارش کاربر";

$l['newregistration_subject'] = "ثبت‌نام جدید در {1}";
$l['newregistration_message'] = "{1}،

یک کاربر جدید در {2} وجود دارد که منتظر تأیید مدیر است.

نام کاربری: {3}

با تشکر،
کادر مدیریت {2}";
