<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['click_no_wait'] = "اگر نمی‌خواهید بیشتر منتظر بمانید اینجا کلیک کنید.";
$l['redirect_return_forum'] = "<br /><br />به طور متناوب، <a href=\"{1}\">به انجمن بازگردید</a>.";
$l['redirect_emailsent'] = "پیام ایمیل شما با موفقیت ارسال شد.";
$l['redirect_loggedin'] = "شما با موفقیت وارد شدید.<br />اکنون به جایی که از آن آمده بودید بازگردانده خواهید شد.";
$l['update_confirm'] = "فایل(های) زیر قبلاً ضمیمه شده‌اند و با فایل(های) جدید انتخاب شده جایگزین خواهند شد. {1} آیا مطمئن هستید؟";
$l['error_invalidpworusername'] = "ترکیب نام کاربری/رمز عبور نامعتبری را وارد کرده‌اید. <br /><br />اگر رمز عبور خود را فراموش کرده‌اید، لطفاً <a href=\"member.php?action=lostpw\">یک رمز جدید دریافت کنید</a>.";
$l['error_invalidpworusername1'] = "ترکیب ایمیل/رمز عبور نامعتبری را وارد کرده‌اید. <br /><br />اگر رمز عبور خود را فراموش کرده‌اید، لطفاً <a href=\"member.php?action=lostpw\">یک رمز جدید دریافت کنید</a>.";
$l['error_invalidpworusername2'] = "ترکیب نام کاربری/رمز عبور یا ایمیل/رمز عبور نامعتبری را وارد کرده‌اید. <br /><br />اگر رمز عبور خود را فراموش کرده‌اید، لطفاً <a href=\"member.php?action=lostpw\">یک رمز جدید دریافت کنید</a>.";
$l['error_incompletefields'] = "به نظر می‌رسد یک یا چند فیلد اجباری را خالی گذاشته‌اید. لطفاً به عقب بازگردید و فیلدهای مورد نیاز را وارد کنید.";
$l['error_alreadyuploaded'] = "این پست قبلاً یک پیوست با نام \"{1}\" دارد. لطفاً نام فایل را تغییر داده و دوباره آن را آپلود کنید. به طور متناوب، می‌توانید روی \"به‌روزرسانی پیوست\" کلیک کنید.";
$l['error_alreadyuploaded_perm'] = "این پست قبلاً یک پیوست با همین نام دارد. لطفاً یا فایل موجود را حذف کنید یا نام فایل را تغییر داده و دوباره آن را آپلود کنید.";
$l['error_updatefailed'] = "فایل \"{1}\" از قبل ضمیمه نشده است و قابل به‌روزرسانی نیست.";
$l['error_nomessage'] = "متأسفیم، چون پیام معتبری وارد نکرده‌اید نمی‌توانیم ادامه دهیم. لطفاً به عقب بازگردید و این کار را انجام دهید.";
$l['error_invalidemail'] = "آدرس ایمیل معتبری وارد نکردید.";
$l['error_nomember'] = "عضو مشخص شده نامعتبر است یا وجود ندارد.";
$l['error_maxposts'] = "متأسفیم، اما حد مجاز پست روزانه شما به پایان رسیده است. لطفاً تا فردا صبر کنید یا با مدیر خود تماس بگیرید.<br /><br />حداکثر تعداد پست‌هایی که می‌توانید در یک روز ارسال کنید {1} عدد است.";
$l['error_nohostname'] = "هیچ نام میزبانی (hostname) برای آدرس IP وارد شده یافت نشد.";
$l['error_invalidthread'] = "موضوع مشخص شده وجود ندارد.";
$l['error_invalidpost'] = "پست مشخص شده وجود ندارد.";
$l['error_invalidannouncement'] = "اعلامیه مشخص شده وجود ندارد.";
$l['error_invalidattachment'] = "پیوست مشخص شده وجود ندارد.";
$l['error_invalidforum'] = "انجمن نامعتبر";
$l['error_closedinvalidforum'] = "شما مجاز به ارسال در این انجمن نیستید، زیرا انجمن بسته شده است، یک تغییر مسیر به وب‌سایت دیگری است، یا یک دسته‌بندی است.";
$l['error_attachtype'] = "نوع فایلی که ضمیمه کردید مجاز نیست. لطفاً پیوست را حذف کنید یا نوع دیگری را انتخاب نمایید.";
$l['error_attachsize'] = "فایل \"{1}\" بیش از حد بزرگ است. حداکثر اندازه برای آن نوع فایل {2} کیلوبایت است.";
$l['error_uploadempty'] = "فایل \"{1}\" خالی است.";
$l['error_uploadsize'] = "اندازه فایل آپلود شده بیش از حد بزرگ است.";
$l['error_uploadfailed'] = "آپلود فایل ناموفق بود. لطفاً یک فایل معتبر انتخاب کرده و دوباره امتحان کنید.";
$l['error_uploadfailed_detail'] = "جزئیات خطا: ";
$l['error_uploadfailed_php1'] = "PHP بازگرداند: حجم فایل آپلود شده از دستورالعمل upload_max_filesize در php.ini فراتر رفته است. لطفاً با این خطا با مدیر انجمن خود تماس بگیرید.";
$l['error_uploadfailed_php2'] = "حجم فایل آپلود شده از حداکثر اندازه فایل مشخص شده فراتر رفت.";
$l['error_uploadfailed_php3'] = "فایل آپلود شده فقط به صورت جزئی آپلود شده است.";
$l['error_uploadfailed_php4'] = "هیچ فایلی آپلود نشد.";
$l['error_uploadfailed_php6'] = "PHP بازگرداند: پوشه موقت وجود ندارد. لطفاً با این خطا با مدیر انجمن خود تماس بگیرید.";
$l['error_uploadfailed_php7'] = "PHP بازگرداند: نوشتن فایل روی دیسک ناموفق بود. لطفاً با این خطا با مدیر انجمن خود تماس بگیرید.";
$l['error_uploadfailed_phpx'] = "PHP کد خطا بازگرداند: {1}. لطفاً با این خطا با مدیر انجمن خود تماس بگیرید.";
$l['error_uploadfailed_nothingtomove'] = "یک فایل نامعتبر مشخص شد، بنابراین فایل آپلود شده نتوانست به مقصد خود منتقل شود.";
$l['error_uploadfailed_movefailed'] = "مشکلی در انتقال فایل آپلود شده به مقصد وجود داشت.";
$l['error_uploadfailed_lost'] = "پیوست در سرور یافت نشد.";
$l['error_emailmismatch'] = "آدرس‌های ایمیلی که وارد کرده‌اید با هم مطابقت ندارند. لطفاً به عقب بازگردید و دوباره تلاش کنید.";
$l['error_nopassword'] = "رمز عبور معتبری وارد نکردید.";
$l['error_usernametaken'] = "نام کاربری انتخابی شما قبلاً ثبت شده است. اگر قبلاً در این انجمن‌ها ثبت‌نام کرده‌اید، لطفاً <a href=\"member.php?action=login\">وارد شوید</a>.";
$l['error_nousername'] = "نام کاربری وارد نکردید.";
$l['error_invalidusername'] = "نام کاربری وارد شده نامعتبر به نظر می‌رسد.";
$l['error_invalidpassword'] = "رمز عبور وارد شده اشتباه است. اگر رمز عبور خود را فراموش کرده‌اید، <a href=\"member.php?action=lostpw\">اینجا</a> کلیک کنید. در غیر این صورت، به عقب بازگردید و دوباره تلاش کنید.";
$l['error_postflooding'] = "متأسفیم اما نمی‌توانیم پست شما را پردازش کنیم. مدیر مشخص کرده است که شما فقط مجاز به ارسال یک بار در هر {1} ثانیه هستید.";
$l['error_nopermission_guest_1'] = "شما یا وارد نشده‌اید یا اجازه مشاهده این صفحه را ندارید. این ممکن است به یکی از دلایل زیر باشد:";
$l['error_nopermission_guest_2'] = "شما وارد نشده‌اید یا ثبت‌نام نکرده‌اید. لطفاً وارد شوید و اقدام مورد نظر را مجدداً امتحان کنید.";
$l['error_nopermission_guest_3'] = "شما اجازه دسترسی به این صفحه را ندارید. آیا سعی دارید به صفحات مدیریتی یا منبعی دسترسی پیدا کنید که نباید؟ قوانین انجمن را بررسی کنید تا ببینید آیا مجاز به انجام این عمل هستید یا خیر.";
$l['error_nopermission_guest_4'] = "حساب شما ممکن است توسط مدیر معلق شده باشد، یا در انتظار فعال‌سازی حساب باشد.";
$l['error_nopermission_guest_5'] = "شما به جای استفاده از فرم‌ها یا لینک‌های مناسب، مستقیماً به این صفحه دسترسی پیدا کرده‌اید.";
$l['login'] = "ورود";
$l['need_reg'] = "نیاز به ثبت‌نام دارید؟";
$l['forgot_password'] = "رمز عبور خود را فراموش کرده‌اید؟";
$l['error_nopermission_user_1'] = "شما اجازه دسترسی به این صفحه را ندارید. این ممکن است به یکی از دلایل زیر باشد:";
$l['error_nopermission_user_ajax'] = "شما اجازه دسترسی به این صفحه را ندارید.";
$l['error_nopermission_user_2'] = "حساب شما یا تعلیق شده است یا دسترسی شما به این منبع مسدود شده است.";
$l['error_nopermission_user_3'] = "شما اجازه دسترسی به این صفحه را ندارید. آیا سعی دارید به صفحات مدیریتی یا منبعی دسترسی پیدا کنید که نباید؟ قوانین انجمن را بررسی کنید تا ببینید آیا مجاز به انجام این عمل هستید یا خیر.";
$l['error_nopermission_user_4'] = "ممکن است حساب شما هنوز در انتظار فعال‌سازی یا بررسی باشد.";
$l['error_nopermission_user_5'] = "شما به جای استفاده از فرم‌ها یا لینک‌های مناسب، مستقیماً به این صفحه دسترسی پیدا کرده‌اید.";
$l['error_nopermission_user_resendactivation'] = "ارسال مجدد کد فعال‌سازی";
$l['error_nopermission_user_username'] = "شما در حال حاضر با نام کاربری '{1}' وارد شده‌اید.";
$l['logged_in_user'] = "کاربر وارد شده";
$l['error_too_many_images'] = "تعداد تصاویر بیش از حد مجاز است.";
$l['error_too_many_images2'] = "متأسفیم، اما نمی‌توانیم پست شما را پردازش کنیم زیرا حاوی تعداد تصاویر بیش از حد است. لطفاً برخی از تصاویر را از پست خود حذف کرده و ادامه دهید.";
$l['error_too_many_images3'] = "<b>توجه:</b> حداکثر تعداد تصاویر در هر پست برابر است با";
$l['error_attach_file'] = "خطا در پیوست کردن فایل";
$l['please_correct_errors'] = "لطفاً قبل از ادامه، خطاهای زیر را اصلاح کنید:";
$l['error_reachedattachquota'] = "متأسفیم، اما نمی‌توانید این فایل را ضمیمه کنید زیرا به سهمیه پیوست {1} خود رسیده‌اید.";
$l['error_maxattachpost'] = "متأسفیم اما نمی‌توانید این فایل را ضمیمه کنید زیرا به حداکثر تعداد پیوست‌های مجاز در هر پست یعنی {1} رسیده‌اید.";
$l['error_invaliduser'] = "کاربر مشخص شده نامعتبر است یا وجود ندارد.";
$l['error_invalidaction'] = "عمل نامعتبر";
$l['error_messagelength'] = "متأسفیم، پیام شما خیلی طولانی است و نمی‌تواند ارسال شود. لطفاً سعی کنید پیام خود را کوتاه‌تر کرده و دوباره ارسال کنید.";
$l['error_message_too_short'] = "متأسفیم، پیام شما خیلی کوتاه است و نمی‌تواند ارسال شود.";
$l['failed_login_wait'] = "شما در تعداد تلاش‌های مجاز برای ورود ناموفق بوده‌اید. اکنون باید {1} ساعت {2} دقیقه {3} ثانیه صبر کنید تا بتوانید دوباره وارد شوید.";
$l['failed_login_again'] = "<br />شما <strong>{1}</strong> تلاش دیگر برای ورود دارید.";
$l['error_max_emails_day'] = "شما نمی‌توانید از ویژگی‌های 'ارسال موضوع به دوست' یا 'ایمیل زدن به کاربر' استفاده کنید زیرا قبلاً سهمیه مجاز ارسال {1} پیام در 24 ساعت گذشته را مصرف کرده‌اید.";
$l['attachments_disabled'] = "شما نمی‌توانید از سیستم پیوست استفاده کنید زیرا توسط مدیر غیرفعال شده است.";
$l['error_attach_filename_length'] = "نام فایل '{1}' از حداکثر طول نام فایل {2} فراتر می‌رود. لطفاً فایلی با نام کوتاه‌تر آپلود کنید.";

$l['emailsubject_lostpw'] = "بازنشانی رمز عبور در {1}";
$l['emailsubject_passwordreset'] = "رمز عبور جدید در {1}";
$l['emailsubject_subscription'] = "پاسخ جدید به {1}";
$l['emailsubject_randompassword'] = "رمز عبور شما برای {1}";
$l['emailsubject_activateaccount'] = "فعال‌سازی حساب کاربری در {1}";
$l['emailsubject_forumsubscription'] = "موضوع جدید در {1}";
$l['emailsubject_reportpost'] = "پست گزارش شده در {1}";
$l['emailsubject_reportprofile'] = "کاربر گزارش شده در {1}";
$l['emailsubject_reportreputation'] = "اعتبار گزارش شده در {1}";
$l['emailsubject_reachedpmquota'] = "سهمیه پیام خصوصی در {1} تکمیل شد";
$l['emailsubject_changeemail'] = "تغییر ایمیل در {1}";
$l['emailsubject_newpm'] = "پیام خصوصی جدید در {1} - {2}";
$l['emailsubject_newjoinrequest'] = "درخواست عضویت جدید در {1}";
$l['emailsubject_sendtofriend'] = "بحث جالب در {1}";
$l['emailsubject_changepassword'] = "تغییر رمز عبور در {1}";
$l['emailbit_viewthread'] = "... (برای خواندن بیشتر به موضوع مراجعه کنید...)";

$l['email_lostpw'] = "{1} عزیز،

برای تکمیل مرحله بازنشانی رمز عبور حساب کاربری خود در {2}، باید از طریق مرورگر وب خود به آدرس زیر بروید:

{3}/member.php?action=resetpassword&uid={4}&code={5}

اگر لینک بالا به درستی کار نمی‌کند، به آدرس زیر بروید:

{3}/member.php?action=resetpassword

شما باید موارد زیر را وارد کنید:
نام کاربری: {1}
کد فعال‌سازی: {5}

با تشکر،
تیم {2}";
$l['email_lostpw1'] = "{1} عزیز،

برای تکمیل مرحله بازنشانی رمز عبور حساب کاربری خود در {2}، باید از طریق مرورگر وب خود به آدرس زیر بروید:

{3}/member.php?action=resetpassword&uid={4}&code={5}

اگر لینک بالا به درستی کار نمی‌کند، به آدرس زیر بروید:

{3}/member.php?action=resetpassword

شما باید موارد زیر را وارد کنید:
آدرس ایمیل شما
کد فعال‌سازی: {5}

با تشکر،
تیم {2}";
$l['email_lostpw2'] = "{1} عزیز،

برای تکمیل مرحله بازنشانی رمز عبور حساب کاربری خود در {2}، باید از طریق مرورگر وب خود به آدرس زیر بروید:

{3}/member.php?action=resetpassword&uid={4}&code={5}

اگر لینک بالا به درستی کار نمی‌کند، به آدرس زیر بروید:

{3}/member.php?action=resetpassword

شما باید موارد زیر را وارد کنید:
نام کاربری: {1} (یا آدرس ایمیل شما)
کد فعال‌سازی: {5}

با تشکر،
تیم {2}";

$l['email_reportpost'] = "{1} از {2} پست زیر را گزارش کرده است:

{3}
{4}/{5}

دلیلی که این کاربر برای گزارش این پست ارائه کرده است:
{6}

این پیام برای همه مدیران (moderators) این انجمن، یا همه مدیران ارشد و مدیران کل در صورت عدم وجود مدیر ارسال شده است.

لطفاً در اسرع وقت این پست را بررسی کنید.";

$l['email_reportprofile'] = "{1} از {2} کاربر زیر را گزارش کرده است:

{3}
{4}/{5}

دلیلی که این کاربر برای گزارش این کاربر ارائه کرده است:
{6}

این پیام برای همه مدیران (moderators) این انجمن، یا همه مدیران ارشد و مدیران کل در صورت عدم وجود مدیر ارسال شده است.

لطفاً در اسرع وقت این کاربر را بررسی کنید.";

$l['email_reportreputation'] = "{1} از {2} اعتبار زیر را گزارش کرده است:

{3}
{4}/{5}

دلیلی که این کاربر برای گزارش این اعتبار ارائه کرده است:
{6}

این پیام برای همه مدیران (moderators) این انجمن، یا همه مدیران ارشد و مدیران کل در صورت عدم وجود مدیر ارسال شده است.

لطفاً در اسرع وقت این اعتبار را بررسی کنید.";

$l['email_report_comment_extra'] = "{1}: {2}";

$l['email_passwordreset'] = "{1} عزیز،

رمز عبور شما در {2} بازنشانی شد.

رمز عبور جدید شما: {3}

برای ورود به انجمن‌ها به این رمز عبور نیاز خواهید داشت، پس از ورود باید با مراجعه به «کنترل‌پنل کاربر» آن را تغییر دهید.

با تشکر،
تیم پشتیبانی {2}";

$l['email_randompassword'] = "{1} عزیز،

از ثبت‌نام شما در {2} سپاسگزاریم. در زیر نام کاربری و رمز عبور تولید شده به صورت تصادفی شما قرار دارد. برای ورود به {2} به این جزئیات نیاز خواهید داشت.

نام کاربری: {3}
رمز عبور: {4}

توصیه می‌شود پس از ورود فوراً رمز عبور خود را تغییر دهید. می‌توانید این کار را با رفتن به کنترل‌پنل کاربر و سپس کلیک بر روی «تغییر رمز عبور» در منوی سمت چپ انجام دهید.

با تشکر،
تیم پشتیبانی {2}";

$l['email_randompassword1'] = "{1} عزیز،

از ثبت‌نام شما در {2} سپاسگزاریم. در زیر آدرس ایمیل شما و رمز عبور تولید شده به صورت تصادفی قرار دارد. برای ورود به {2} به این جزئیات نیاز خواهید داشت.

آدرس ایمیل شما
رمز عبور: {4}

توصیه می‌شود پس از ورود فوراً رمز عبور خود را تغییر دهید. می‌توانید این کار را با رفتن به کنترل‌پنل کاربر و سپس کلیک بر روی «تغییر رمز عبور» در منوی سمت چپ انجام دهید.

با تشکر،
تیم پشتیبانی {2}";

$l['email_randompassword2'] = "{1} عزیز،

از ثبت‌نام شما در {2} سپاسگزاریم. در زیر نام کاربری و رمز عبور تولید شده به صورت تصادفی شما قرار دارد. برای ورود به {2} به این جزئیات نیاز خواهید داشت.

نام کاربری: {3} (یا آدرس ایمیل شما)
رمز عبور: {4}

توصیه می‌شود پس از ورود فوراً رمز عبور خود را تغییر دهید. می‌توانید این کار را با رفتن به کنترل‌پنل کاربر و سپس کلیک بر روی «تغییر رمز عبور» در منوی سمت چپ انجام دهید.

با تشکر،
تیم پشتیبانی {2}";

$l['email_sendtofriend'] = "سلام،

{1} از {2} فکر کرد ممکن است به خواندن صفحه وب زیر علاقه‌مند باشید:

{3}

{1} پیام زیر را ضمیمه کرده است:
------------------------------------------
{4}
------------------------------------------

با تشکر،
تیم پشتیبانی {2}
";

$l['email_forumsubscription'] = "{1} عزیز،

{2} یک موضوع جدید در {3} ایجاد کرده است. این انجمنی است که شما در {4} در آن مشترک شده‌اید.

عنوان موضوع: {5}

در اینجا خلاصه‌ای از پیام آمده است:
--
{6}
--

برای مشاهده موضوع، می‌توانید به آدرس زیر بروید:
{7}/{8}

ممکن است موضوع‌ها و پاسخ‌های جدید دیگری نیز وجود داشته باشد، اما تا زمانی که دوباره از تالار دیدن نکنید، اعلان دیگری دریافت نخواهید کرد.

با تشکر،
تیم پشتیبانی {4}

------------------------------------------
اطلاعات لغو اشتراک:

اگر نمی‌خواهید اعلان‌های مربوط به موضوع‌های جدید در این انجمن را دریافت کنید، لطفاً آدرس زیر را در مرورگر خود باز کنید:
{7}/usercp.php?action=removesubscription&type=forum&fid={9}

------------------------------------------";

$l['email_activateaccount'] = "{1} عزیز،

برای تکمیل فرآیند ثبت‌نام در {2}، باید از طریق مرورگر وب خود به آدرس زیر بروید.

{3}/member.php?action=activate&uid={4}&code={5}

اگر لینک بالا به درستی کار نمی‌کند، به آدرس زیر بروید:

{3}/member.php?action=activate

شما باید موارد زیر را وارد کنید:
نام کاربری: {1}
کد فعال‌سازی: {5}

با تشکر،
تیم پشتیبانی {2}";

$l['email_activateaccount1'] = "{1} عزیز،

برای تکمیل فرآیند ثبت‌نام در {2}، باید از طریق مرورگر وب خود به آدرس زیر بروید.

{3}/member.php?action=activate&uid={4}&code={5}

اگر لینک بالا به درستی کار نمی‌کند، به آدرس زیر بروید:

{3}/member.php?action=activate

شما باید موارد زیر را وارد کنید:
آدرس ایمیل شما
کد فعال‌سازی: {5}

با تشکر،
تیم پشتیبانی {2}";

$l['email_activateaccount2'] = "{1} عزیز،

برای تکمیل فرآیند ثبت‌نام در {2}، باید از طریق مرورگر وب خود به آدرس زیر بروید.

{3}/member.php?action=activate&uid={4}&code={5}

اگر لینک بالا به درستی کار نمی‌کند، به آدرس زیر بروید:

{3}/member.php?action=activate

شما باید موارد زیر را وارد کنید:
نام کاربری: {1} (یا آدرس ایمیل شما)
کد فعال‌سازی: {5}

با تشکر،
تیم پشتیبانی {2}";

$l['email_subscription'] = "{1} عزیز،

{2} به تازگی در موضوعی که شما در {3} مشترک شده‌اید، پاسخ داده است. عنوان این موضوع {4} است.

در اینجا خلاصه‌ای از پیام آمده است:
------------------------------------------
{5}
------------------------------------------

برای مشاهده موضوع، می‌توانید به آدرس زیر بروید:
{6}/{7}

ممکن است پاسخ‌های دیگری به این موضوع وجود داشته باشد، اما تا زمانی که دوباره از تالار دیدن نکنید، اعلان دیگری دریافت نخواهید کرد.

با تشکر،
تیم پشتیبانی {3}

------------------------------------------
اطلاعات لغو اشتراک:

اگر نمی‌خواهید اعلان‌های مربوط به پاسخ‌های این موضوع را دریافت کنید، لطفاً آدرس زیر را در مرورگر خود باز کنید:
{6}/usercp.php?action=removesubscription&tid={8}

------------------------------------------";
$l['email_reachedpmquota'] = "{1} عزیز،

این یک ایمیل خودکار از طرف {2} است تا به شما اطلاع دهد که صندوق پیام خصوصی شما به حداکثر ظرفیت خود رسیده است.

ممکن است یک یا چند کاربر سعی کرده باشند برای شما پیام خصوصی ارسال کنند اما به دلیل پر بودن صندوق، موفق نشده باشند.

لطفاً برخی از پیام‌های خصوصی ذخیره شده خود را حذف کنید و به یاد داشته باشید که آن‌ها را از «سطل زباله» (Trash Can) نیز حذف نمایید.

با تشکر،
تیم پشتیبانی {2}
{3}";
$l['email_changeemail'] = "{1} عزیز،

ما در {2} درخواست تغییر آدرس ایمیل شما را دریافت کرده‌ایم (جزئیات در زیر آمده است).

آدرس ایمیل قدیمی: {3}
آدرس ایمیل جدید: {4}

اگر این تغییرات صحیح است، لطفاً با مراجعه به آدرس زیر در مرورگر وب خود، فرآیند اعتبارسنجی را در {2} تکمیل نمایید.

{5}/member.php?action=activate&uid={8}&code={6}

اگر لینک بالا به درستی کار نمی‌کند، به آدرس زیر بروید:

{5}/member.php?action=activate

شما باید موارد زیر را وارد کنید:
نام کاربری: {7}
کد فعال‌سازی: {6}

اگر آدرس ایمیل جدید خود را تأیید نکنید، پروفایل شما به‌روزرسانی نخواهد شد و همان آدرس ایمیل قبلی شما باقی خواهد ماند.

با تشکر،
تیم پشتیبانی {2}
{5}";

$l['email_changeemail_noactivation'] = "{1} عزیز،

ما در {2} درخواست تغییر آدرس ایمیل شما را دریافت کرده‌ایم (جزئیات در زیر آمده است).

آدرس ایمیل قدیمی: {3}
آدرس ایمیل جدید: {4}

این تغییر به صورت خودکار پردازش شده است. اگر شما این تغییر را درخواست نکرده‌اید، لطفاً با یک مدیر تماس بگیرید.

با تشکر،
تیم پشتیبانی {2}
{5}";

$l['email_changepassword'] = "{1} عزیز،

شما این ایمیل را دریافت کرده‌اید زیرا اخیراً رمز عبور حساب شما توسط شما یا فردی که به رمز عبور شما دسترسی داشته است، تغییر یافته است.

نام کاربری: {1}
آدرس ایمیل: {2}

اگر شما این تغییر را درخواست نکرده‌اید، لطفاً با یک مدیر تماس بگیرید.

با تشکر،
تیم پشتیبانی {3}
{4}";

$l['email_newpm'] = "{1} عزیز،

شما یک پیام خصوصی جدید در {3} از طرف {2} دریافت کرده‌اید:

------------------------------------------
{5}
------------------------------------------

برای مشاهده، پاسخ دادن یا ارسال مجدد این پیام، می‌توانید روی این لینک کلیک کنید:

{4}/private.php

لطفاً توجه داشته باشید که تا زمانی که مجدداً از {3} بازدید نکنید، اعلان‌های مربوط به پیام‌های جدید دیگری دریافت نخواهید کرد.

می‌توانید اعلان‌های پیام جدید را در صفحه تنظیمات حساب کاربری خود غیرفعال کنید:

{4}/usercp.php?action=options

با تشکر،
تیم پشتیبانی {3}
{4}";

$l['email_emailuser'] = "{1} عزیز،

{2} از طرف {3} پیام زیر را برای شما ارسال کرده است:
------------------------------------------
{5}
------------------------------------------

با تشکر،
تیم پشتیبانی {3}
{4}

------------------------------------------
نمی‌خواهید از سایر اعضا ایمیل دریافت کنید؟

اگر نمی‌خواهید سایر اعضا بتوانند به شما ایمیل بزنند، لطفاً به کنترل‌پنل کاربر خود بروید و گزینه «پنهان کردن ایمیل از سایر اعضا» را فعال کنید:
{4}/usercp.php?action=options

------------------------------------------";

$l['email_groupleader_joinrequest'] = "{1} عزیز،

{2} درخواست پیوستن به گروه {3} در {4} را ارسال کرده است (جزئیات در زیر).

دلیل: {5}

برای پذیرش یا رد این درخواست، به آدرس زیر بروید:

{6}/managegroup.php?gid={7}

با تشکر،
تیم پشتیبانی {4}";

$l['email_contact_subject'] = "تماس: {1}";
$l['email_contact'] = "ایمیل: {1}
پروفایل انجمن: {2}
آدرس IP: {3}
پیام:
{4}";

$l['pmsubject_subscription'] = "پاسخ جدید به {1}";
$l['pm_subscription'] = "{1},

{2} به تازگی به موضوعی که شما در آن مشترک شده‌اید پاسخ داده است. عنوان این موضوع {3} است.

در اینجا گزیده‌ای از پیام آمده است:
------------------------------------------
{4}
------------------------------------------

برای مشاهده موضوع، می‌توانید به آدرس اینترنتی زیر بروید:
[url]{5}/{6/url]

ممکن است پاسخ‌های دیگری نیز به این موضوع وجود داشته باشد، اما تا زمانی که دوباره از موضوع بازدید نکنید، اعلان‌های دیگری دریافت نخواهید کرد.

-------------------------------------------
اطلاعات لغو اشتراک:

اگر نمی‌خواهید اعلان‌های بیشتری از پاسخ‌های این موضوع دریافت کنید، به آدرس اینترنتی زیر در مرورگر خود مراجعه کنید:
[url]{5}/usercp.php?action=removesubscription&tid={7/url]

--------------------------------------------";

$l['email_broken_task_subject'] = "خطای وظیفه MyBB در {1}";
$l['email_broken_task'] = "نسخه MyBB شما که روی {1} ({2}) اجرا می‌شود، با خطایی در سیستم وظیفه مواجه شده است.

فایل وظیفه برای {3} وجود ندارد.

این وظیفه تا زمان حل مشکل غیرفعال شده است.";
