<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['nav_helpdocs'] = "اسناد راهنما";
$l['nav_smilies'] = "لیست شکلک‌ها";
$l['nav_syndication'] = "پیوند آخرین موضوعات (RSS)";

$l['buddy_list'] = "لیست دوستان";
$l['online'] = "آنلاین";
$l['online_none'] = "<em>شما هیچ دوست آنلاینی ندارید</em>";
$l['offline'] = "آفلاین";
$l['offline_none'] = "<em>شما هیچ دوست آفلاینی ندارید</em>";
$l['delete_buddy'] = "X";
$l['pm_buddy'] = "ارسال پیام خصوصی";
$l['last_active'] = "<strong>آخرین فعالیت:</strong> {1}";
$l['close'] = "بستن";
$l['no_buddies'] = "<em>لیست دوستان شما در حال حاضر خالی است. از کنترل‌پنل کاربری خود استفاده کنید یا از پروفایل کاربری برای اضافه کردن کاربران به لیست دوستان خود بازدید کنید.</em>";

$l['help_docs'] = "اسناد راهنما";

$l['search_help_documents'] = "جستجوی اسناد راهنما";
$l['search_by_name'] = "جستجو بر اساس نام";
$l['search_by_document'] = "جستجو بر اساس سند";
$l['enter_keywords'] = "کلمات کلیدی را وارد کنید";
$l['search'] = "جستجو";
$l['redirect_searchresults'] = "متشکرم، جستجوی شما ارسال شد و اکنون به لیست نتایج هدایت خواهید شد.";
$l['search_results'] = "نتایج جستجو";
$l['help_doc_results'] = "نتایج سند راهنما";
$l['document'] = "سند";
$l['error_nosearchresults'] = "متاسفیم، اما هیچ نتیجه‌ای با استفاده از اطلاعات جستجویی که ارائه دادید، بازگردانده نشد. لطفاً عبارات جستجوی خود را دوباره تعریف کنید و دوباره امتحان کنید.";
$l['no_help_results'] = "متاسفیم، اما هیچ نتیجه‌ای با استفاده از اطلاعات جستجویی که ارائه دادید، بازگردانده نشد.";
$l['error_helpsearchdisabled'] = "امکان جستجوی اسناد راهنما توسط مدیر غیرفعال شده است.";

$l['smilies_listing'] = "لیست شکلک‌ها";
$l['name'] = "نام";
$l['abbreviation'] = "مخفف";
$l['click_to_add'] = "برای درج شکلک در پیام خود، روی آن کلیک کنید";
$l['close_window'] = "بستن پنجره";
$l['no_smilies'] = "در حال حاضر هیچ شکلکی موجود نیست.";

$l['who_posted'] = "چه کسی ارسال کرده است؟";
$l['total_posts'] = "تعداد پست‌ها:";
$l['user'] = "کاربر";
$l['num_posts'] = "تعداد پست‌ها";

$l['forum_rules'] = "{1} - قوانین";

$l['error_invalid_limit'] = "محدودیتی که برای تعداد آیتم‌های فید وارد کرده‌اید نامعتبر است. لطفاً یک محدودیت معتبر مشخص کنید.";

$l['syndication'] = "پیوند (RSS) آخرین موضوعات";
$l['syndication_generated_url'] = "پیوند همنشری تولید شدهتان:";
$l['syndication_note'] = "در زیر می‌توانید لینک‌هایی به فیدهای همنشری RSS خاص ایجاد کنید. لینک‌ها می‌توانند برای همه انجمن‌ها، هر انجمن یا برای تعداد مشخصی از انجمن‌ها ایجاد شوند. سپس لینکی به شما نمایش داده می‌شود که می‌توانید آن را در یک RSS خوان کپی کنید. <i><a href=\"https://en.wikipedia.org/wiki/RSS\" target=\"_blank\" rel=\"noopener\">RSS چیست؟</a></i>";
$l['syndication_forum'] = "انجمن مورد نظر برای ایجاد پیوند:";
$l['syndication_forum_desc'] = "لطفاً یک انجمن را از سمت راست انتخاب کنید. برای انتخاب چندین انجمن از کلید CTRL استفاده کنید.";
$l['syndication_version'] = "نسخه فید:";
$l['syndication_version_desc'] = "لطفاً نسخه فیدهایی را که می‌خواهید ایجاد کنید انتخاب کنید.";
$l['syndication_version_json1'] = "JSON Feed 1";
$l['syndication_version_atom1'] = "Atom 1.0";
$l['syndication_version_rss2'] = "RSS 2.00 (پیش‌فرض)";
$l['syndication_generate'] = "ایجاد لینک پیوند";
$l['syndication_limit'] = "محدودیت:";
$l['syndication_limit_desc'] = "تعداد موضوع‌هایی که باید همزمان دانلود شوند. حداکثر میتوان ۵۰ مورد را در یک زمان دانلود کرد.";
$l['syndication_threads_time'] = "موضوع‌ها در یک زمان";
$l['syndicate_all_forums'] = "همه انجمن‌ها را پیوند کنید";

$l['redirect_markforumread'] = "انجمن انتخاب شده به عنوان خوانده شده علامت گذاری شده است.";
$l['redirect_markforumsread'] = "همه انجمن‌ها به عنوان خوانده شده علامت گذاری شده اند.";
$l['redirect_forumpasscleared'] = "رمز عبور ذخیره شده برای این انجمن پاک شده است.";
$l['redirect_cookiescleared'] = "همه کوکی‌ها پاک شده‌اند.";

$l['error_invalidforum'] = "انجمن نامعتبر";
$l['error_invalidhelpdoc'] = "به نظر نمی‌رسد سند راهنمای مشخص شده وجود داشته باشد.";
$l['error_invalidsearch'] = "جستجوی نامعتبری انجام شد. لطفاً برگردید و دوباره امتحان کنید.";
$l['error_no_search_support'] = "این موتور پایگاه داده از جستجو پشتیبانی نمی‌کند.";
$l['error_searchflooding'] = "متاسفیم، اما شما فقط می‌توانید هر {1} ثانیه یک جستجو انجام دهید. لطفاً قبل از تلاش برای جستجو دوباره، {2} ثانیه دیگر صبر کنید.";
$l['error_searchflooding_1'] = "متاسفیم، اما شما فقط می‌توانید هر {1} ثانیه یک جستجو انجام دهید. لطفاً قبل از تلاش برای جستجو دوباره، 1 ثانیه دیگر صبر کنید.";

$l['dst_settings_updated'] = "تنظیمات ساعت تابستانی شما به طور خودکار تنظیم شده است.<br /><br />اکنون به فهرست انجمن بازگردانده خواهید شد.";
