<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['nav_newthread'] = "موضوع جدید";
$l['newthread_in'] = "موضوع جدید در {1}";
$l['post_new_thread'] = "ارسال یک موضوع جدید";
$l['thread_subject'] = "موضوع موضوع:";
$l['your_message'] = "پیام شما:";
$l['post_options'] = "گزینه‌های ارسال:";
$l['options_sig'] = "<b>امضا:</b> امضای خود را درج کنید. (فقط کاربران ثبت‌نام کرده)";
$l['options_emailnotify'] = "<b>اعلان ایمیلی:</b> در صورت دریافت پاسخ جدید ایمیل دریافت کنید. (فقط کاربران ثبت‌نام کرده)";
$l['options_disablesmilies'] = "<b>غیرفعال کردن شکلک‌ها:</b> شکلک‌ها در این پست نمایش داده نشوند.";
$l['post_thread'] = "ارسال موضوع";
$l['preview_post'] = "پیش‌نمایش پست";
$l['poll'] = "نظرسنجی:";
$l['poll_desc'] = "به صورت اختیاری می‌توانید یک نظرسنجی به این موضوع ضمیمه کنید.";
$l['poll_check'] = "می‌خواهم یک نظرسنجی ارسال کنم";
$l['num_options'] = "تعداد گزینه‌ها:";
$l['max_options'] = "(حداکثر: {1})";
$l['mod_options'] = "گزینه‌های مدیر:";
$l['close_thread'] = "<b>بستن موضوع:</b> جلوگیری از ارسال پاسخ‌های بیشتر در این موضوع.";
$l['stick_thread'] = "<b>سنجاق کردن موضوع:</b> این موضوع را در بالای انجمن ثابت نگه دار.";
$l['draft_saved'] = "موضوع جدید با موفقیت به عنوان پیش‌نویس ذخیره شد.<br />اکنون به لیست پیش‌نویس‌های خود هدایت خواهید شد.";
$l['error_post_already_submitted'] = "شما قبلاً این موضوع را در این انجمن ارسال کرده‌اید. لطفاً برای مشاهده موضوع خود به انجمن مراجعه کنید.";
$l['no_prefix'] = "بدون پیشوند";
$l['forum_rules'] = "قوانین {1}";

$l['multiquote_external_one'] = "شما یک پست از یک موضوع دیگر را انتخاب کرده‌اید.";
$l['multiquote_external'] = "شما {1} پست از موضوع‌های دیگر را انتخاب کرده‌اید.";
$l['multiquote_external_one_deselect'] = "لغو انتخاب این پست";
$l['multiquote_external_deselect'] = "لغو انتخاب این پست‌ها";
$l['multiquote_external_one_quote'] = "این پست را نیز نقل قول کن";
$l['multiquote_external_quote'] = "این پست‌ها را نیز نقل قول کن";

$l['redirect_newthread'] = "متشکریم، موضوع شما ارسال شد.";
$l['redirect_newthread_poll'] = "<br />اکنون به صفحه گزینه‌ها و پیکربندی نظرسنجی هدایت خواهید شد.";
$l['redirect_newthread_moderation'] = "<br />مدیر تعیین کرده است که تمام موضوع‌های جدید نیاز به تأیید دارند. اکنون به لیست موضوع‌ها بازگردانده خواهید شد.";
$l['redirect_newthread_unviewable'] = "<br />شما مجوز مشاهده موضوع‌ها در این انجمن را ندارید. اکنون به انجمن بازگردانده خواهید شد.";
$l['redirect_newthread_thread'] = "<br />اکنون به موضوع جدید هدایت خواهید شد.";
$l['invalidthread'] = "پیش‌نویس مشخص شده وجود ندارد یا شما مجوز مشاهده آن را ندارید.";

$l['error_stop_forum_spam_spammer'] = 'متأسفیم، {1} شما با مشخصات یک اسپمر شناخته شده مطابقت دارد. اگر فکر می‌کنید این اشتباه است، لطفاً با مدیر تماس بگیرید.';
$l['error_stop_forum_spam_fetching'] = 'متأسفیم، مشکلی در بررسی موضوع شما در برابر پایگاه داده اسپمرها رخ داد. احتمالاً پایگاه داده قابل دسترسی نبوده است. لطفاً بعداً دوباره تلاش کنید.';

$l['error_suspendedposting'] = "امتیازات ارسال شما در حال حاضر معلق شده است {1}.<br /><br />

تاریخ تعلیق: {2}";
$l['error_suspendedposting_temporal'] = "تا تاریخ {1}";
$l['error_suspendedposting_permanent'] = "به صورت دائمی";
