<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['nav_postpoll'] = "ارسال نظرسنجی";
$l['nav_editpoll'] = "ویرایش نظرسنجی";
$l['nav_pollresults'] = "نتایج نظرسنجی";

$l['edit_poll'] = "ویرایش نظرسنجی";
$l['delete_poll'] = "حذف نظرسنجی";
$l['delete_q'] = "حذف شود؟";
$l['delete_note'] = "برای حذف این نظرسنجی، کادر سمت چپ را علامت زده و دکمه سمت راست را کلیک کنید.";
$l['delete_note2'] = "<b>توجه:</b> پس از حذف این نظرسنجی، راهی برای بازگرداندن آن وجود ندارد.";
$l['question'] = "پرسش:";
$l['num_options'] = "تعداد گزینه‌ها:";
$l['max_options'] = "حداکثر:";
$l['poll_options'] = "گزینه‌های نظرسنجی:";
$l['update_options'] = "به‌روزرسانی گزینه‌ها";
$l['poll_options_note'] = "گزینه‌های نظرسنجی باید کوتاه و مختصر باشند.";
$l['options'] = "گزینه‌ها:";
$l['option_multiple'] = "<b>اجازه انتخاب چندگانه:</b> کاربران قابلیت رأی دادن به بیش از یک گزینه را دارند.";
$l['option_multiple_maxoptions'] = "حداکثر تعداد گزینه‌های انتخابی برای هر کاربر (0 برای عدم محدودیت):";
$l['option_public'] = "<b>نظرسنجی عمومی:</b> به کاربران اجازه دهید ببینند کدام کاربر به کدام گزینه(ها) رأی داده است.";
$l['option_closed'] = "<b>نظرسنجی بسته است:</b> اگر علامت زده شود، رأی‌گیری در این نظرسنجی متوقف خواهد شد.";
$l['poll_timeout'] = "مهلت زمانی نظرسنجی:";
$l['timeout_note'] = "تعداد روزهایی که افراد می‌توانند به این نظرسنجی رأی دهند.<br />(برای اینکه نظرسنجی مهلت زمانی نداشته باشد، روی 0 تنظیم کنید.)";
$l['days_after'] = "روز پس از:";
$l['update_poll'] = "به‌روزرسانی نظرسنجی";
$l['option'] = "گزینه";
$l['votes'] = "تعداد آرا:";
$l['post_new_poll'] = "ارسال نظرسنجی جدید";
$l['days'] = "روز";
$l['poll_results'] = "نتایج نظرسنجی";
$l['poll_total'] = "مجموع:";
$l['poll_votes'] = "رأی";

$l['redirect_pollposted'] = "نظرسنجی شما ارسال شد.<br />اکنون به موضوع بازگردانده خواهید شد.";
$l['redirect_pollpostedmoderated'] = "نظرسنجی شما ارسال شد، اما موضوع شما هنوز در انتظار تأیید است.<br />به انجمن بازگردانده خواهید شد.";
$l['redirect_pollupdated'] = "نظرسنجی به‌روزرسانی شد.<br />اکنون به موضوع بازگردانده خواهید شد.";
$l['redirect_votethanks'] = "از رأی شما متشکریم.<br />اکنون به موضوع بازگردانده خواهید شد.";
$l['redirect_unvoted'] = "آرای شما در این موضوع حذف شد.<br />اکنون به موضوع بازگردانده خواهید شد.";
$l['redirect_polldeleted'] = "متشکریم، نظرسنجی با موفقیت از موضوع حذف شد.<br />اکنون به موضوع بازگردانده خواهید شد.";

$l['error_polloptiontoolong'] = "یک یا چند گزینه نظرسنجی که وارد کردید، طولانی‌تر از حد مجاز هستند. لطفاً به عقب بازگردید و آن‌ها را کوتاه کنید.";
$l['error_polloptionsequence'] = "یک یا چند گزینه نظرسنجی که وارد کردید حاوی دنباله‌ای است که نباید در آن‌ها استفاده شود: <strong>||~|~||</strong>. لطفاً به عقب بازگردید و آن را حذف کنید.";
$l['error_noquestionoptions'] = "شما یا سؤالی برای نظرسنجی وارد نکرده‌اید یا تعداد گزینه‌ها کافی نیست. حداقل تعداد گزینه‌هایی که یک نظرسنجی می‌تواند داشته باشد 2 تا است.<br />لطفاً به عقب بازگردید و این خطا را برطرف کنید.";
$l['error_pollalready'] = "موضوع از قبل نظرسنجی دارد!";
$l['error_nopolloptions'] = "گزینه نظرسنجی مشخص شده نامعتبر است یا وجود ندارد.";
$l['error_maxpolloptions'] = "شما برای تعداد زیادی گزینه رأی داده‌اید. فقط مجاز به رأی دادن برای {1} گزینه هستید.<br />لطفاً به عقب بازگردید و دوباره تلاش کنید.";
$l['error_alreadyvoted'] = "شما قبلاً در این نظرسنجی رأی داده‌اید.";
$l['error_notvoted'] = "شما در این نظرسنجی رأی نداده‌اید.";
$l['error_invalidpoll'] = "نظرسنجی مشخص شده نامعتبر است یا وجود ندارد.";
$l['error_pollclosed'] = "شما نمی‌توانید در نظرسنجی‌ای که بسته شده رأی دهید.";
$l['poll_time_limit'] = "متأسفیم، اما نمی‌توانید نظرسنجی به موضوع خود اضافه کنید. مدیر تعیین کرده است که نظرسنجی‌ها فقط ظرف {1} ساعت پس از ارسال قابل اضافه شدن هستند.";

$l['poll_deleted'] = "نظرسنجی حذف شد";
$l['poll_edited'] = "نظرسنجی ویرایش شد";
