<?php
/**
 * MyBB 1.8 Persian Language Pack
 * Copyright 2025 ParsanIT Group, All Rights Reserved
 *
 */

$l['no_new_subject'] = "شما موضوع جدیدی وارد نکردید.";
$l['post_moderation'] = "پست شما اکنون تحت بررسی است.";
$l['thread_moderation'] = "موضوع شما اکنون تحت بررسی است.";
$l['post_doesnt_exist'] = "پست مشخص شده وجود ندارد.";
$l['thread_doesnt_exist'] = "موضوع مشخص شده وجود ندارد.";
$l['thread_closed_edit_subjects'] = "این موضوع بسته شده است و شما نمی‌توانید موضوعات آن را ویرایش کنید.";
$l['no_permission_edit_subject'] = "شما اجازه ویرایش موضوع این موضوع را ندارید.";
$l['thread_closed_edit_message'] = "این موضوع بسته شده است و شما نمی‌توانید پیام‌های درون آن را ویرایش کنید.";
$l['no_permission_edit_post'] = "شما اجازه ویرایش این پیام را ندارید.";
$l['edit_time_limit'] = "شما فقط می‌توانید پیام‌ها را تا {1} دقیقه پس از ارسال آنها ویرایش کنید.";
$l['postbit_edited'] = "آخرین ویرایش این پست: {1} توسط";
$l['postbit_editreason'] = "دلیل ویرایش";
$l['save_changes'] = "ذخیره تغییرات";
$l['cancel_edit'] = "لغو ویرایش";
$l['answer_valid_not_exists'] = "سوالی که می‌خواهید به آن پاسخ دهید وجود ندارد.";
$l['captcha_not_exists'] = "تصویر تأیید تصویری که می‌خواهید به‌روزرسانی کنید وجود ندارد.";
$l['captcha_valid_not_exists'] = "تصویر تأیید تصویری که می‌خواهید بررسی کنید به نظر نمی‌رسد وجود داشته باشد.";
$l['captcha_does_not_match'] = "کد تأیید تصویری که وارد کرده‌اید نادرست است. لطفاً کد را دقیقاً همانطور که در تصویر نشان داده شده است وارد کنید.";
$l['captcha_matches'] = "کد تأیید تصویری که وارد کرده‌اید صحیح است.";
$l['answer_does_not_match'] = "پاسخی که وارد کرده‌اید صحیح نیست.";
$l['banned_username'] = "نام کاربری که وارد کرده‌اید توسط مدیر مجاز نشده است";
$l['banned_characters_username'] = "نام کاربری شما شامل یک یا چند کاراکتر نامعتبر است";
$l['complex_password_fails'] = "رمز عبور نیاز به یک حرف بزرگ، یک حرف کوچک و یک عدد دارد";
$l['username_taken'] = "{1} قبلاً توسط عضو دیگری ثبت شده است";
$l['username_available'] = "{1} در دسترس است";
$l['invalid_username'] = "{1} نام کاربری یک عضو ثبت نام شده نیست";
$l['valid_username'] = "{1} یک معرف معتبر است.";
$l['buddylist_error'] = "به نظر می‌رسد هیچ دوستی در لیست دوستان خود ندارید. لطفاً قبل از استفاده از این، چند نفر را اضافه کنید.";
$l['close'] = "بستن";
$l['select_buddies'] = "انتخاب دوستان";
$l['select_buddies_desc'] = "برای افزودن یک یا چند نفر از دوستان خود به عنوان گیرنده، آنها را در زیر انتخاب کرده و روی تأیید کلیک کنید.";
$l['selected_recipients'] = "گیرندگان انتخاب شده";
$l['ok'] = "تأیید";
$l['cancel'] = "لغو";
$l['online'] = "آنلاین";
$l['offline'] = "آفلاین";
$l['edited_post'] = "پست ویرایش شده";
$l['usergroup'] = "گروه کاربری";
